module {
  func.func @forward(%arg0: tensor<30522x768xf32>, %arg1: tensor<2x768xf32>, %arg2: tensor<512x768xf32>, %arg3: tensor<768xf32>, %arg4: tensor<768xf32>, %arg5: tensor<768x768xf32>, %arg6: tensor<768xf32>, %arg7: tensor<768x768xf32>, %arg8: tensor<768xf32>, %arg9: tensor<768x768xf32>, %arg10: tensor<768xf32>, %arg11: tensor<768x768xf32>, %arg12: tensor<768xf32>, %arg13: tensor<768xf32>, %arg14: tensor<768xf32>, %arg15: tensor<3072x768xf32>, %arg16: tensor<3072xf32>, %arg17: tensor<768x3072xf32>, %arg18: tensor<768xf32>, %arg19: tensor<768xf32>, %arg20: tensor<768xf32>, %arg21: tensor<768x768xf32>, %arg22: tensor<768xf32>, %arg23: tensor<768x768xf32>, %arg24: tensor<768xf32>, %arg25: tensor<768x768xf32>, %arg26: tensor<768xf32>, %arg27: tensor<768x768xf32>, %arg28: tensor<768xf32>, %arg29: tensor<768xf32>, %arg30: tensor<768xf32>, %arg31: tensor<3072x768xf32>, %arg32: tensor<3072xf32>, %arg33: tensor<768x3072xf32>, %arg34: tensor<768xf32>, %arg35: tensor<768xf32>, %arg36: tensor<768xf32>, %arg37: tensor<768x768xf32>, %arg38: tensor<768xf32>, %arg39: tensor<768x768xf32>, %arg40: tensor<768xf32>, %arg41: tensor<768x768xf32>, %arg42: tensor<768xf32>, %arg43: tensor<768x768xf32>, %arg44: tensor<768xf32>, %arg45: tensor<768xf32>, %arg46: tensor<768xf32>, %arg47: tensor<3072x768xf32>, %arg48: tensor<3072xf32>, %arg49: tensor<768x3072xf32>, %arg50: tensor<768xf32>, %arg51: tensor<768xf32>, %arg52: tensor<768xf32>, %arg53: tensor<768x768xf32>, %arg54: tensor<768xf32>, %arg55: tensor<768x768xf32>, %arg56: tensor<768xf32>, %arg57: tensor<768x768xf32>, %arg58: tensor<768xf32>, %arg59: tensor<768x768xf32>, %arg60: tensor<768xf32>, %arg61: tensor<768xf32>, %arg62: tensor<768xf32>, %arg63: tensor<3072x768xf32>, %arg64: tensor<3072xf32>, %arg65: tensor<768x3072xf32>, %arg66: tensor<768xf32>, %arg67: tensor<768xf32>, %arg68: tensor<768xf32>, %arg69: tensor<768x768xf32>, %arg70: tensor<768xf32>, %arg71: tensor<768x768xf32>, %arg72: tensor<768xf32>, %arg73: tensor<768x768xf32>, %arg74: tensor<768xf32>, %arg75: tensor<768x768xf32>, %arg76: tensor<768xf32>, %arg77: tensor<768xf32>, %arg78: tensor<768xf32>, %arg79: tensor<3072x768xf32>, %arg80: tensor<3072xf32>, %arg81: tensor<768x3072xf32>, %arg82: tensor<768xf32>, %arg83: tensor<768xf32>, %arg84: tensor<768xf32>, %arg85: tensor<768x768xf32>, %arg86: tensor<768xf32>, %arg87: tensor<768x768xf32>, %arg88: tensor<768xf32>, %arg89: tensor<768x768xf32>, %arg90: tensor<768xf32>, %arg91: tensor<768x768xf32>, %arg92: tensor<768xf32>, %arg93: tensor<768xf32>, %arg94: tensor<768xf32>, %arg95: tensor<3072x768xf32>, %arg96: tensor<3072xf32>, %arg97: tensor<768x3072xf32>, %arg98: tensor<768xf32>, %arg99: tensor<768xf32>, %arg100: tensor<768xf32>, %arg101: tensor<768x768xf32>, %arg102: tensor<768xf32>, %arg103: tensor<768x768xf32>, %arg104: tensor<768xf32>, %arg105: tensor<768x768xf32>, %arg106: tensor<768xf32>, %arg107: tensor<768x768xf32>, %arg108: tensor<768xf32>, %arg109: tensor<768xf32>, %arg110: tensor<768xf32>, %arg111: tensor<3072x768xf32>, %arg112: tensor<3072xf32>, %arg113: tensor<768x3072xf32>, %arg114: tensor<768xf32>, %arg115: tensor<768xf32>, %arg116: tensor<768xf32>, %arg117: tensor<768x768xf32>, %arg118: tensor<768xf32>, %arg119: tensor<768x768xf32>, %arg120: tensor<768xf32>, %arg121: tensor<768x768xf32>, %arg122: tensor<768xf32>, %arg123: tensor<768x768xf32>, %arg124: tensor<768xf32>, %arg125: tensor<768xf32>, %arg126: tensor<768xf32>, %arg127: tensor<3072x768xf32>, %arg128: tensor<3072xf32>, %arg129: tensor<768x3072xf32>, %arg130: tensor<768xf32>, %arg131: tensor<768xf32>, %arg132: tensor<768xf32>, %arg133: tensor<768x768xf32>, %arg134: tensor<768xf32>, %arg135: tensor<768x768xf32>, %arg136: tensor<768xf32>, %arg137: tensor<768x768xf32>, %arg138: tensor<768xf32>, %arg139: tensor<768x768xf32>, %arg140: tensor<768xf32>, %arg141: tensor<768xf32>, %arg142: tensor<768xf32>, %arg143: tensor<3072x768xf32>, %arg144: tensor<3072xf32>, %arg145: tensor<768x3072xf32>, %arg146: tensor<768xf32>, %arg147: tensor<768xf32>, %arg148: tensor<768xf32>, %arg149: tensor<768x768xf32>, %arg150: tensor<768xf32>, %arg151: tensor<768x768xf32>, %arg152: tensor<768xf32>, %arg153: tensor<768x768xf32>, %arg154: tensor<768xf32>, %arg155: tensor<768x768xf32>, %arg156: tensor<768xf32>, %arg157: tensor<768xf32>, %arg158: tensor<768xf32>, %arg159: tensor<3072x768xf32>, %arg160: tensor<3072xf32>, %arg161: tensor<768x3072xf32>, %arg162: tensor<768xf32>, %arg163: tensor<768xf32>, %arg164: tensor<768xf32>, %arg165: tensor<768x768xf32>, %arg166: tensor<768xf32>, %arg167: tensor<768x768xf32>, %arg168: tensor<768xf32>, %arg169: tensor<768x768xf32>, %arg170: tensor<768xf32>, %arg171: tensor<768x768xf32>, %arg172: tensor<768xf32>, %arg173: tensor<768xf32>, %arg174: tensor<768xf32>, %arg175: tensor<3072x768xf32>, %arg176: tensor<3072xf32>, %arg177: tensor<768x3072xf32>, %arg178: tensor<768xf32>, %arg179: tensor<768xf32>, %arg180: tensor<768xf32>, %arg181: tensor<768x768xf32>, %arg182: tensor<768xf32>, %arg183: tensor<768x768xf32>, %arg184: tensor<768xf32>, %arg185: tensor<768x768xf32>, %arg186: tensor<768xf32>, %arg187: tensor<768x768xf32>, %arg188: tensor<768xf32>, %arg189: tensor<768xf32>, %arg190: tensor<768xf32>, %arg191: tensor<3072x768xf32>, %arg192: tensor<3072xf32>, %arg193: tensor<768x3072xf32>, %arg194: tensor<768xf32>, %arg195: tensor<768xf32>, %arg196: tensor<768xf32>, %arg197: tensor<768x768xf32>, %arg198: tensor<768xf32>, %arg199: tensor<6x768xf32>, %arg200: tensor<6xf32>, %arg201: tensor<1x512xi64>, %arg202: tensor<1x5xi64>, %arg203: tensor<1x5xi64>, %arg204: tensor<1x5xi64>) -> tensor<1x6xf32> {
    %extracted_slice = tensor.extract_slice %arg203[0, 0] [1, 5] [1, 1] : tensor<1x5xi64> to tensor<1x5xi64>
    %0 = tosa.reshape %extracted_slice {new_shape = array<i64: 1, 1, 5>} : (tensor<1x5xi64>) -> tensor<1x1x5xi64>
    %1 = tosa.reshape %0 {new_shape = array<i64: 1, 1, 1, 5>} : (tensor<1x1x5xi64>) -> tensor<1x1x1x5xi64>
    %extracted_slice_0 = tensor.extract_slice %1[0, 0, 0, 0] [1, 1, 1, 5] [1, 1, 1, 1] : tensor<1x1x1x5xi64> to tensor<1x1x1x5xi64>
    %2 = tosa.cast %extracted_slice_0 : (tensor<1x1x1x5xi64>) -> tensor<1x1x1x5xf32>
    %3 = "tosa.const"() <{value = dense<1.000000e+00> : tensor<1x1x1x5xf32>}> : () -> tensor<1x1x1x5xf32>
    %4 = tosa.sub %3, %2 : (tensor<1x1x1x5xf32>, tensor<1x1x1x5xf32>) -> tensor<1x1x1x5xf32>
    %5 = "tosa.const"() <{value = dense<-3.40282347E+38> : tensor<1x1x1x5xf32>}> : () -> tensor<1x1x1x5xf32>
    %6 = tosa.mul %4, %5 {shift = 0 : i8} : (tensor<1x1x1x5xf32>, tensor<1x1x1x5xf32>) -> tensor<1x1x1x5xf32>
    %extracted_slice_1 = tensor.extract_slice %arg201[0, 0] [1, 512] [1, 1] : tensor<1x512xi64> to tensor<1x512xi64>
    %extracted_slice_2 = tensor.extract_slice %extracted_slice_1[0, 0] [1, 5] [1, 1] : tensor<1x512xi64> to tensor<1x5xi64>
    %7 = tosa.cast %arg202 : (tensor<1x5xi64>) -> tensor<1x5xi32>
    %8 = tosa.reshape %arg0 {new_shape = array<i64: 1, 30522, 768>} : (tensor<30522x768xf32>) -> tensor<1x30522x768xf32>
    %9 = tosa.gather %8, %7 : (tensor<1x30522x768xf32>, tensor<1x5xi32>) -> tensor<1x5x768xf32>
    %10 = tosa.reshape %9 {new_shape = array<i64: 1, 5, 768>} : (tensor<1x5x768xf32>) -> tensor<1x5x768xf32>
    %11 = tosa.cast %arg204 : (tensor<1x5xi64>) -> tensor<1x5xi32>
    %12 = tosa.reshape %arg1 {new_shape = array<i64: 1, 2, 768>} : (tensor<2x768xf32>) -> tensor<1x2x768xf32>
    %13 = tosa.gather %12, %11 : (tensor<1x2x768xf32>, tensor<1x5xi32>) -> tensor<1x5x768xf32>
    %14 = tosa.reshape %13 {new_shape = array<i64: 1, 5, 768>} : (tensor<1x5x768xf32>) -> tensor<1x5x768xf32>
    %15 = tosa.add %10, %14 : (tensor<1x5x768xf32>, tensor<1x5x768xf32>) -> tensor<1x5x768xf32>
    %16 = tosa.cast %extracted_slice_2 : (tensor<1x5xi64>) -> tensor<1x5xi32>
    %17 = tosa.reshape %arg2 {new_shape = array<i64: 1, 512, 768>} : (tensor<512x768xf32>) -> tensor<1x512x768xf32>
    %18 = tosa.gather %17, %16 : (tensor<1x512x768xf32>, tensor<1x5xi32>) -> tensor<1x5x768xf32>
    %19 = tosa.reshape %18 {new_shape = array<i64: 1, 5, 768>} : (tensor<1x5x768xf32>) -> tensor<1x5x768xf32>
    %20 = tosa.add %15, %19 : (tensor<1x5x768xf32>, tensor<1x5x768xf32>) -> tensor<1x5x768xf32>
    %21 = tosa.reduce_sum %20 {axis = 2 : i32} : (tensor<1x5x768xf32>) -> tensor<1x5x1xf32>
    %22 = "tosa.const"() <{value = dense<7.680000e+02> : tensor<1xf32>}> : () -> tensor<1xf32>
    %23 = tosa.reciprocal %22 : (tensor<1xf32>) -> tensor<1xf32>
    %24 = tosa.mul %23, %21 {shift = 0 : i8} : (tensor<1xf32>, tensor<1x5x1xf32>) -> tensor<1x5x1xf32>
    %25 = tosa.sub %20, %24 : (tensor<1x5x768xf32>, tensor<1x5x1xf32>) -> tensor<1x5x768xf32>
    %26 = tosa.mul %25, %25 {shift = 0 : i8} : (tensor<1x5x768xf32>, tensor<1x5x768xf32>) -> tensor<1x5x768xf32>
    %27 = tosa.reduce_sum %26 {axis = 2 : i32} : (tensor<1x5x768xf32>) -> tensor<1x5x1xf32>
    %28 = "tosa.const"() <{value = dense<7.680000e+02> : tensor<1xf32>}> : () -> tensor<1xf32>
    %29 = tosa.reciprocal %28 : (tensor<1xf32>) -> tensor<1xf32>
    %30 = tosa.mul %29, %27 {shift = 0 : i8} : (tensor<1xf32>, tensor<1x5x1xf32>) -> tensor<1x5x1xf32>
    %31 = "tosa.const"() <{value = dense<9.99999996E-13> : tensor<1x5x1xf32>}> : () -> tensor<1x5x1xf32>
    %32 = tosa.add %30, %31 : (tensor<1x5x1xf32>, tensor<1x5x1xf32>) -> tensor<1x5x1xf32>
    %33 = tosa.rsqrt %32 : (tensor<1x5x1xf32>) -> tensor<1x5x1xf32>
    %34 = tosa.sub %20, %24 : (tensor<1x5x768xf32>, tensor<1x5x1xf32>) -> tensor<1x5x768xf32>
    %35 = tosa.mul %34, %33 {shift = 0 : i8} : (tensor<1x5x768xf32>, tensor<1x5x1xf32>) -> tensor<1x5x768xf32>
    %36 = tosa.reshape %arg3 {new_shape = array<i64: 1, 1, 768>} : (tensor<768xf32>) -> tensor<1x1x768xf32>
    %37 = tosa.mul %35, %36 {shift = 0 : i8} : (tensor<1x5x768xf32>, tensor<1x1x768xf32>) -> tensor<1x5x768xf32>
    %38 = tosa.reshape %arg4 {new_shape = array<i64: 1, 1, 768>} : (tensor<768xf32>) -> tensor<1x1x768xf32>
    %39 = tosa.add %37, %38 : (tensor<1x5x768xf32>, tensor<1x1x768xf32>) -> tensor<1x5x768xf32>
    %40 = tosa.identity %39 : (tensor<1x5x768xf32>) -> tensor<1x5x768xf32>
    %41 = tosa.reshape %40 {new_shape = array<i64: 5, 768>} : (tensor<1x5x768xf32>) -> tensor<5x768xf32>
    %42 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %43 = tosa.transpose %arg5, %42 : (tensor<768x768xf32>, tensor<2xi32>) -> tensor<768x768xf32>
    %44 = tosa.reshape %41 {new_shape = array<i64: 1, 5, 768>} : (tensor<5x768xf32>) -> tensor<1x5x768xf32>
    %45 = tosa.reshape %43 {new_shape = array<i64: 1, 768, 768>} : (tensor<768x768xf32>) -> tensor<1x768x768xf32>
    %46 = tosa.matmul %44, %45 : (tensor<1x5x768xf32>, tensor<1x768x768xf32>) -> tensor<1x5x768xf32>
    %47 = tosa.reshape %46 {new_shape = array<i64: 5, 768>} : (tensor<1x5x768xf32>) -> tensor<5x768xf32>
    %48 = tosa.reshape %arg6 {new_shape = array<i64: 1, 768>} : (tensor<768xf32>) -> tensor<1x768xf32>
    %49 = tosa.add %48, %47 : (tensor<1x768xf32>, tensor<5x768xf32>) -> tensor<5x768xf32>
    %50 = tosa.reshape %49 {new_shape = array<i64: 1, 5, 768>} : (tensor<5x768xf32>) -> tensor<1x5x768xf32>
    %51 = tosa.reshape %40 {new_shape = array<i64: 5, 768>} : (tensor<1x5x768xf32>) -> tensor<5x768xf32>
    %52 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %53 = tosa.transpose %arg7, %52 : (tensor<768x768xf32>, tensor<2xi32>) -> tensor<768x768xf32>
    %54 = tosa.reshape %51 {new_shape = array<i64: 1, 5, 768>} : (tensor<5x768xf32>) -> tensor<1x5x768xf32>
    %55 = tosa.reshape %53 {new_shape = array<i64: 1, 768, 768>} : (tensor<768x768xf32>) -> tensor<1x768x768xf32>
    %56 = tosa.matmul %54, %55 : (tensor<1x5x768xf32>, tensor<1x768x768xf32>) -> tensor<1x5x768xf32>
    %57 = tosa.reshape %56 {new_shape = array<i64: 5, 768>} : (tensor<1x5x768xf32>) -> tensor<5x768xf32>
    %58 = tosa.reshape %arg8 {new_shape = array<i64: 1, 768>} : (tensor<768xf32>) -> tensor<1x768xf32>
    %59 = tosa.add %58, %57 : (tensor<1x768xf32>, tensor<5x768xf32>) -> tensor<5x768xf32>
    %60 = tosa.reshape %59 {new_shape = array<i64: 1, 5, 768>} : (tensor<5x768xf32>) -> tensor<1x5x768xf32>
    %61 = tosa.reshape %60 {new_shape = array<i64: 1, 5, 12, 64>} : (tensor<1x5x768xf32>) -> tensor<1x5x12x64xf32>
    %62 = "tosa.const"() <{value = dense<[0, 2, 1, 3]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %63 = tosa.transpose %61, %62 : (tensor<1x5x12x64xf32>, tensor<4xi32>) -> tensor<1x12x5x64xf32>
    %64 = tosa.reshape %40 {new_shape = array<i64: 5, 768>} : (tensor<1x5x768xf32>) -> tensor<5x768xf32>
    %65 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %66 = tosa.transpose %arg9, %65 : (tensor<768x768xf32>, tensor<2xi32>) -> tensor<768x768xf32>
    %67 = tosa.reshape %64 {new_shape = array<i64: 1, 5, 768>} : (tensor<5x768xf32>) -> tensor<1x5x768xf32>
    %68 = tosa.reshape %66 {new_shape = array<i64: 1, 768, 768>} : (tensor<768x768xf32>) -> tensor<1x768x768xf32>
    %69 = tosa.matmul %67, %68 : (tensor<1x5x768xf32>, tensor<1x768x768xf32>) -> tensor<1x5x768xf32>
    %70 = tosa.reshape %69 {new_shape = array<i64: 5, 768>} : (tensor<1x5x768xf32>) -> tensor<5x768xf32>
    %71 = tosa.reshape %arg10 {new_shape = array<i64: 1, 768>} : (tensor<768xf32>) -> tensor<1x768xf32>
    %72 = tosa.add %71, %70 : (tensor<1x768xf32>, tensor<5x768xf32>) -> tensor<5x768xf32>
    %73 = tosa.reshape %72 {new_shape = array<i64: 1, 5, 768>} : (tensor<5x768xf32>) -> tensor<1x5x768xf32>
    %74 = tosa.reshape %73 {new_shape = array<i64: 1, 5, 12, 64>} : (tensor<1x5x768xf32>) -> tensor<1x5x12x64xf32>
    %75 = "tosa.const"() <{value = dense<[0, 2, 1, 3]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %76 = tosa.transpose %74, %75 : (tensor<1x5x12x64xf32>, tensor<4xi32>) -> tensor<1x12x5x64xf32>
    %77 = tosa.reshape %50 {new_shape = array<i64: 1, 5, 12, 64>} : (tensor<1x5x768xf32>) -> tensor<1x5x12x64xf32>
    %78 = "tosa.const"() <{value = dense<[0, 2, 1, 3]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %79 = tosa.transpose %77, %78 : (tensor<1x5x12x64xf32>, tensor<4xi32>) -> tensor<1x12x5x64xf32>
    %80 = "tosa.const"() <{value = dense<[0, 1, 3, 2]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %81 = tosa.transpose %63, %80 : (tensor<1x12x5x64xf32>, tensor<4xi32>) -> tensor<1x12x64x5xf32>
    %82 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<1x12x5x64xf32>}> : () -> tensor<1x12x5x64xf32>
    %83 = tosa.add %79, %82 : (tensor<1x12x5x64xf32>, tensor<1x12x5x64xf32>) -> tensor<1x12x5x64xf32>
    %84 = tosa.reshape %83 {new_shape = array<i64: 12, 5, 64>} : (tensor<1x12x5x64xf32>) -> tensor<12x5x64xf32>
    %85 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<1x12x64x5xf32>}> : () -> tensor<1x12x64x5xf32>
    %86 = tosa.add %81, %85 : (tensor<1x12x64x5xf32>, tensor<1x12x64x5xf32>) -> tensor<1x12x64x5xf32>
    %87 = tosa.reshape %86 {new_shape = array<i64: 12, 64, 5>} : (tensor<1x12x64x5xf32>) -> tensor<12x64x5xf32>
    %88 = tosa.matmul %84, %87 : (tensor<12x5x64xf32>, tensor<12x64x5xf32>) -> tensor<12x5x5xf32>
    %89 = tosa.reshape %88 {new_shape = array<i64: 1, 12, 5, 5>} : (tensor<12x5x5xf32>) -> tensor<1x12x5x5xf32>
    %90 = "tosa.const"() <{value = dense<8.000000e+00> : tensor<1x12x5x5xf32>}> : () -> tensor<1x12x5x5xf32>
    %91 = tosa.reciprocal %90 : (tensor<1x12x5x5xf32>) -> tensor<1x12x5x5xf32>
    %92 = tosa.mul %89, %91 {shift = 0 : i8} : (tensor<1x12x5x5xf32>, tensor<1x12x5x5xf32>) -> tensor<1x12x5x5xf32>
    %93 = tosa.add %92, %6 : (tensor<1x12x5x5xf32>, tensor<1x1x1x5xf32>) -> tensor<1x12x5x5xf32>
    %94 = tosa.reduce_max %93 {axis = 3 : i32} : (tensor<1x12x5x5xf32>) -> tensor<1x12x5x1xf32>
    %95 = tosa.sub %93, %94 : (tensor<1x12x5x5xf32>, tensor<1x12x5x1xf32>) -> tensor<1x12x5x5xf32>
    %96 = tosa.exp %95 : (tensor<1x12x5x5xf32>) -> tensor<1x12x5x5xf32>
    %97 = tosa.reduce_sum %96 {axis = 3 : i32} : (tensor<1x12x5x5xf32>) -> tensor<1x12x5x1xf32>
    %98 = tosa.reciprocal %97 : (tensor<1x12x5x1xf32>) -> tensor<1x12x5x1xf32>
    %99 = tosa.mul %96, %98 {shift = 0 : i8} : (tensor<1x12x5x5xf32>, tensor<1x12x5x1xf32>) -> tensor<1x12x5x5xf32>
    %100 = tosa.identity %99 : (tensor<1x12x5x5xf32>) -> tensor<1x12x5x5xf32>
    %101 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<1x12x5x5xf32>}> : () -> tensor<1x12x5x5xf32>
    %102 = tosa.add %100, %101 : (tensor<1x12x5x5xf32>, tensor<1x12x5x5xf32>) -> tensor<1x12x5x5xf32>
    %103 = tosa.reshape %102 {new_shape = array<i64: 12, 5, 5>} : (tensor<1x12x5x5xf32>) -> tensor<12x5x5xf32>
    %104 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<1x12x5x64xf32>}> : () -> tensor<1x12x5x64xf32>
    %105 = tosa.add %76, %104 : (tensor<1x12x5x64xf32>, tensor<1x12x5x64xf32>) -> tensor<1x12x5x64xf32>
    %106 = tosa.reshape %105 {new_shape = array<i64: 12, 5, 64>} : (tensor<1x12x5x64xf32>) -> tensor<12x5x64xf32>
    %107 = tosa.matmul %103, %106 : (tensor<12x5x5xf32>, tensor<12x5x64xf32>) -> tensor<12x5x64xf32>
    %108 = tosa.reshape %107 {new_shape = array<i64: 1, 12, 5, 64>} : (tensor<12x5x64xf32>) -> tensor<1x12x5x64xf32>
    %109 = "tosa.const"() <{value = dense<[0, 2, 1, 3]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %110 = tosa.transpose %108, %109 : (tensor<1x12x5x64xf32>, tensor<4xi32>) -> tensor<1x5x12x64xf32>
    %111 = tosa.identity %110 : (tensor<1x5x12x64xf32>) -> tensor<1x5x12x64xf32>
    %112 = tosa.reshape %111 {new_shape = array<i64: 1, 5, 768>} : (tensor<1x5x12x64xf32>) -> tensor<1x5x768xf32>
    %113 = tosa.reshape %112 {new_shape = array<i64: 5, 768>} : (tensor<1x5x768xf32>) -> tensor<5x768xf32>
    %114 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %115 = tosa.transpose %arg11, %114 : (tensor<768x768xf32>, tensor<2xi32>) -> tensor<768x768xf32>
    %116 = tosa.reshape %113 {new_shape = array<i64: 1, 5, 768>} : (tensor<5x768xf32>) -> tensor<1x5x768xf32>
    %117 = tosa.reshape %115 {new_shape = array<i64: 1, 768, 768>} : (tensor<768x768xf32>) -> tensor<1x768x768xf32>
    %118 = tosa.matmul %116, %117 : (tensor<1x5x768xf32>, tensor<1x768x768xf32>) -> tensor<1x5x768xf32>
    %119 = tosa.reshape %118 {new_shape = array<i64: 5, 768>} : (tensor<1x5x768xf32>) -> tensor<5x768xf32>
    %120 = tosa.reshape %arg12 {new_shape = array<i64: 1, 768>} : (tensor<768xf32>) -> tensor<1x768xf32>
    %121 = tosa.add %120, %119 : (tensor<1x768xf32>, tensor<5x768xf32>) -> tensor<5x768xf32>
    %122 = tosa.reshape %121 {new_shape = array<i64: 1, 5, 768>} : (tensor<5x768xf32>) -> tensor<1x5x768xf32>
    %123 = tosa.identity %122 : (tensor<1x5x768xf32>) -> tensor<1x5x768xf32>
    %124 = tosa.add %123, %40 : (tensor<1x5x768xf32>, tensor<1x5x768xf32>) -> tensor<1x5x768xf32>
    %125 = tosa.reduce_sum %124 {axis = 2 : i32} : (tensor<1x5x768xf32>) -> tensor<1x5x1xf32>
    %126 = "tosa.const"() <{value = dense<7.680000e+02> : tensor<1xf32>}> : () -> tensor<1xf32>
    %127 = tosa.reciprocal %126 : (tensor<1xf32>) -> tensor<1xf32>
    %128 = tosa.mul %127, %125 {shift = 0 : i8} : (tensor<1xf32>, tensor<1x5x1xf32>) -> tensor<1x5x1xf32>
    %129 = tosa.sub %124, %128 : (tensor<1x5x768xf32>, tensor<1x5x1xf32>) -> tensor<1x5x768xf32>
    %130 = tosa.mul %129, %129 {shift = 0 : i8} : (tensor<1x5x768xf32>, tensor<1x5x768xf32>) -> tensor<1x5x768xf32>
    %131 = tosa.reduce_sum %130 {axis = 2 : i32} : (tensor<1x5x768xf32>) -> tensor<1x5x1xf32>
    %132 = "tosa.const"() <{value = dense<7.680000e+02> : tensor<1xf32>}> : () -> tensor<1xf32>
    %133 = tosa.reciprocal %132 : (tensor<1xf32>) -> tensor<1xf32>
    %134 = tosa.mul %133, %131 {shift = 0 : i8} : (tensor<1xf32>, tensor<1x5x1xf32>) -> tensor<1x5x1xf32>
    %135 = "tosa.const"() <{value = dense<9.99999996E-13> : tensor<1x5x1xf32>}> : () -> tensor<1x5x1xf32>
    %136 = tosa.add %134, %135 : (tensor<1x5x1xf32>, tensor<1x5x1xf32>) -> tensor<1x5x1xf32>
    %137 = tosa.rsqrt %136 : (tensor<1x5x1xf32>) -> tensor<1x5x1xf32>
    %138 = tosa.sub %124, %128 : (tensor<1x5x768xf32>, tensor<1x5x1xf32>) -> tensor<1x5x768xf32>
    %139 = tosa.mul %138, %137 {shift = 0 : i8} : (tensor<1x5x768xf32>, tensor<1x5x1xf32>) -> tensor<1x5x768xf32>
    %140 = tosa.reshape %arg13 {new_shape = array<i64: 1, 1, 768>} : (tensor<768xf32>) -> tensor<1x1x768xf32>
    %141 = tosa.mul %139, %140 {shift = 0 : i8} : (tensor<1x5x768xf32>, tensor<1x1x768xf32>) -> tensor<1x5x768xf32>
    %142 = tosa.reshape %arg14 {new_shape = array<i64: 1, 1, 768>} : (tensor<768xf32>) -> tensor<1x1x768xf32>
    %143 = tosa.add %141, %142 : (tensor<1x5x768xf32>, tensor<1x1x768xf32>) -> tensor<1x5x768xf32>
    %144 = tosa.reshape %143 {new_shape = array<i64: 5, 768>} : (tensor<1x5x768xf32>) -> tensor<5x768xf32>
    %145 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %146 = tosa.transpose %arg15, %145 : (tensor<3072x768xf32>, tensor<2xi32>) -> tensor<768x3072xf32>
    %147 = tosa.reshape %144 {new_shape = array<i64: 1, 5, 768>} : (tensor<5x768xf32>) -> tensor<1x5x768xf32>
    %148 = tosa.reshape %146 {new_shape = array<i64: 1, 768, 3072>} : (tensor<768x3072xf32>) -> tensor<1x768x3072xf32>
    %149 = tosa.matmul %147, %148 : (tensor<1x5x768xf32>, tensor<1x768x3072xf32>) -> tensor<1x5x3072xf32>
    %150 = tosa.reshape %149 {new_shape = array<i64: 5, 3072>} : (tensor<1x5x3072xf32>) -> tensor<5x3072xf32>
    %151 = tosa.reshape %arg16 {new_shape = array<i64: 1, 3072>} : (tensor<3072xf32>) -> tensor<1x3072xf32>
    %152 = tosa.add %151, %150 : (tensor<1x3072xf32>, tensor<5x3072xf32>) -> tensor<5x3072xf32>
    %153 = tosa.reshape %152 {new_shape = array<i64: 1, 5, 3072>} : (tensor<5x3072xf32>) -> tensor<1x5x3072xf32>
    %154 = "tosa.const"() <{value = dense<5.000000e-01> : tensor<1x5x3072xf32>}> : () -> tensor<1x5x3072xf32>
    %155 = tosa.mul %153, %154 {shift = 0 : i8} : (tensor<1x5x3072xf32>, tensor<1x5x3072xf32>) -> tensor<1x5x3072xf32>
    %156 = "tosa.const"() <{value = dense<0.707106769> : tensor<1x5x3072xf32>}> : () -> tensor<1x5x3072xf32>
    %157 = tosa.mul %153, %156 {shift = 0 : i8} : (tensor<1x5x3072xf32>, tensor<1x5x3072xf32>) -> tensor<1x5x3072xf32>
    %158 = math.erf %157 : tensor<1x5x3072xf32>
    %159 = "tosa.const"() <{value = dense<1.000000e+00> : tensor<1x5x3072xf32>}> : () -> tensor<1x5x3072xf32>
    %160 = tosa.add %158, %159 : (tensor<1x5x3072xf32>, tensor<1x5x3072xf32>) -> tensor<1x5x3072xf32>
    %161 = tosa.mul %155, %160 {shift = 0 : i8} : (tensor<1x5x3072xf32>, tensor<1x5x3072xf32>) -> tensor<1x5x3072xf32>
    %162 = tosa.reshape %161 {new_shape = array<i64: 5, 3072>} : (tensor<1x5x3072xf32>) -> tensor<5x3072xf32>
    %163 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %164 = tosa.transpose %arg17, %163 : (tensor<768x3072xf32>, tensor<2xi32>) -> tensor<3072x768xf32>
    %165 = tosa.reshape %162 {new_shape = array<i64: 1, 5, 3072>} : (tensor<5x3072xf32>) -> tensor<1x5x3072xf32>
    %166 = tosa.reshape %164 {new_shape = array<i64: 1, 3072, 768>} : (tensor<3072x768xf32>) -> tensor<1x3072x768xf32>
    %167 = tosa.matmul %165, %166 : (tensor<1x5x3072xf32>, tensor<1x3072x768xf32>) -> tensor<1x5x768xf32>
    %168 = tosa.reshape %167 {new_shape = array<i64: 5, 768>} : (tensor<1x5x768xf32>) -> tensor<5x768xf32>
    %169 = tosa.reshape %arg18 {new_shape = array<i64: 1, 768>} : (tensor<768xf32>) -> tensor<1x768xf32>
    %170 = tosa.add %169, %168 : (tensor<1x768xf32>, tensor<5x768xf32>) -> tensor<5x768xf32>
    %171 = tosa.reshape %170 {new_shape = array<i64: 1, 5, 768>} : (tensor<5x768xf32>) -> tensor<1x5x768xf32>
    %172 = tosa.identity %171 : (tensor<1x5x768xf32>) -> tensor<1x5x768xf32>
    %173 = tosa.add %172, %143 : (tensor<1x5x768xf32>, tensor<1x5x768xf32>) -> tensor<1x5x768xf32>
    %174 = tosa.reduce_sum %173 {axis = 2 : i32} : (tensor<1x5x768xf32>) -> tensor<1x5x1xf32>
    %175 = "tosa.const"() <{value = dense<7.680000e+02> : tensor<1xf32>}> : () -> tensor<1xf32>
    %176 = tosa.reciprocal %175 : (tensor<1xf32>) -> tensor<1xf32>
    %177 = tosa.mul %176, %174 {shift = 0 : i8} : (tensor<1xf32>, tensor<1x5x1xf32>) -> tensor<1x5x1xf32>
    %178 = tosa.sub %173, %177 : (tensor<1x5x768xf32>, tensor<1x5x1xf32>) -> tensor<1x5x768xf32>
    %179 = tosa.mul %178, %178 {shift = 0 : i8} : (tensor<1x5x768xf32>, tensor<1x5x768xf32>) -> tensor<1x5x768xf32>
    %180 = tosa.reduce_sum %179 {axis = 2 : i32} : (tensor<1x5x768xf32>) -> tensor<1x5x1xf32>
    %181 = "tosa.const"() <{value = dense<7.680000e+02> : tensor<1xf32>}> : () -> tensor<1xf32>
    %182 = tosa.reciprocal %181 : (tensor<1xf32>) -> tensor<1xf32>
    %183 = tosa.mul %182, %180 {shift = 0 : i8} : (tensor<1xf32>, tensor<1x5x1xf32>) -> tensor<1x5x1xf32>
    %184 = "tosa.const"() <{value = dense<9.99999996E-13> : tensor<1x5x1xf32>}> : () -> tensor<1x5x1xf32>
    %185 = tosa.add %183, %184 : (tensor<1x5x1xf32>, tensor<1x5x1xf32>) -> tensor<1x5x1xf32>
    %186 = tosa.rsqrt %185 : (tensor<1x5x1xf32>) -> tensor<1x5x1xf32>
    %187 = tosa.sub %173, %177 : (tensor<1x5x768xf32>, tensor<1x5x1xf32>) -> tensor<1x5x768xf32>
    %188 = tosa.mul %187, %186 {shift = 0 : i8} : (tensor<1x5x768xf32>, tensor<1x5x1xf32>) -> tensor<1x5x768xf32>
    %189 = tosa.reshape %arg19 {new_shape = array<i64: 1, 1, 768>} : (tensor<768xf32>) -> tensor<1x1x768xf32>
    %190 = tosa.mul %188, %189 {shift = 0 : i8} : (tensor<1x5x768xf32>, tensor<1x1x768xf32>) -> tensor<1x5x768xf32>
    %191 = tosa.reshape %arg20 {new_shape = array<i64: 1, 1, 768>} : (tensor<768xf32>) -> tensor<1x1x768xf32>
    %192 = tosa.add %190, %191 : (tensor<1x5x768xf32>, tensor<1x1x768xf32>) -> tensor<1x5x768xf32>
    %193 = tosa.reshape %192 {new_shape = array<i64: 5, 768>} : (tensor<1x5x768xf32>) -> tensor<5x768xf32>
    %194 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %195 = tosa.transpose %arg21, %194 : (tensor<768x768xf32>, tensor<2xi32>) -> tensor<768x768xf32>
    %196 = tosa.reshape %193 {new_shape = array<i64: 1, 5, 768>} : (tensor<5x768xf32>) -> tensor<1x5x768xf32>
    %197 = tosa.reshape %195 {new_shape = array<i64: 1, 768, 768>} : (tensor<768x768xf32>) -> tensor<1x768x768xf32>
    %198 = tosa.matmul %196, %197 : (tensor<1x5x768xf32>, tensor<1x768x768xf32>) -> tensor<1x5x768xf32>
    %199 = tosa.reshape %198 {new_shape = array<i64: 5, 768>} : (tensor<1x5x768xf32>) -> tensor<5x768xf32>
    %200 = tosa.reshape %arg22 {new_shape = array<i64: 1, 768>} : (tensor<768xf32>) -> tensor<1x768xf32>
    %201 = tosa.add %200, %199 : (tensor<1x768xf32>, tensor<5x768xf32>) -> tensor<5x768xf32>
    %202 = tosa.reshape %201 {new_shape = array<i64: 1, 5, 768>} : (tensor<5x768xf32>) -> tensor<1x5x768xf32>
    %203 = tosa.reshape %192 {new_shape = array<i64: 5, 768>} : (tensor<1x5x768xf32>) -> tensor<5x768xf32>
    %204 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %205 = tosa.transpose %arg23, %204 : (tensor<768x768xf32>, tensor<2xi32>) -> tensor<768x768xf32>
    %206 = tosa.reshape %203 {new_shape = array<i64: 1, 5, 768>} : (tensor<5x768xf32>) -> tensor<1x5x768xf32>
    %207 = tosa.reshape %205 {new_shape = array<i64: 1, 768, 768>} : (tensor<768x768xf32>) -> tensor<1x768x768xf32>
    %208 = tosa.matmul %206, %207 : (tensor<1x5x768xf32>, tensor<1x768x768xf32>) -> tensor<1x5x768xf32>
    %209 = tosa.reshape %208 {new_shape = array<i64: 5, 768>} : (tensor<1x5x768xf32>) -> tensor<5x768xf32>
    %210 = tosa.reshape %arg24 {new_shape = array<i64: 1, 768>} : (tensor<768xf32>) -> tensor<1x768xf32>
    %211 = tosa.add %210, %209 : (tensor<1x768xf32>, tensor<5x768xf32>) -> tensor<5x768xf32>
    %212 = tosa.reshape %211 {new_shape = array<i64: 1, 5, 768>} : (tensor<5x768xf32>) -> tensor<1x5x768xf32>
    %213 = tosa.reshape %212 {new_shape = array<i64: 1, 5, 12, 64>} : (tensor<1x5x768xf32>) -> tensor<1x5x12x64xf32>
    %214 = "tosa.const"() <{value = dense<[0, 2, 1, 3]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %215 = tosa.transpose %213, %214 : (tensor<1x5x12x64xf32>, tensor<4xi32>) -> tensor<1x12x5x64xf32>
    %216 = tosa.reshape %192 {new_shape = array<i64: 5, 768>} : (tensor<1x5x768xf32>) -> tensor<5x768xf32>
    %217 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %218 = tosa.transpose %arg25, %217 : (tensor<768x768xf32>, tensor<2xi32>) -> tensor<768x768xf32>
    %219 = tosa.reshape %216 {new_shape = array<i64: 1, 5, 768>} : (tensor<5x768xf32>) -> tensor<1x5x768xf32>
    %220 = tosa.reshape %218 {new_shape = array<i64: 1, 768, 768>} : (tensor<768x768xf32>) -> tensor<1x768x768xf32>
    %221 = tosa.matmul %219, %220 : (tensor<1x5x768xf32>, tensor<1x768x768xf32>) -> tensor<1x5x768xf32>
    %222 = tosa.reshape %221 {new_shape = array<i64: 5, 768>} : (tensor<1x5x768xf32>) -> tensor<5x768xf32>
    %223 = tosa.reshape %arg26 {new_shape = array<i64: 1, 768>} : (tensor<768xf32>) -> tensor<1x768xf32>
    %224 = tosa.add %223, %222 : (tensor<1x768xf32>, tensor<5x768xf32>) -> tensor<5x768xf32>
    %225 = tosa.reshape %224 {new_shape = array<i64: 1, 5, 768>} : (tensor<5x768xf32>) -> tensor<1x5x768xf32>
    %226 = tosa.reshape %225 {new_shape = array<i64: 1, 5, 12, 64>} : (tensor<1x5x768xf32>) -> tensor<1x5x12x64xf32>
    %227 = "tosa.const"() <{value = dense<[0, 2, 1, 3]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %228 = tosa.transpose %226, %227 : (tensor<1x5x12x64xf32>, tensor<4xi32>) -> tensor<1x12x5x64xf32>
    %229 = tosa.reshape %202 {new_shape = array<i64: 1, 5, 12, 64>} : (tensor<1x5x768xf32>) -> tensor<1x5x12x64xf32>
    %230 = "tosa.const"() <{value = dense<[0, 2, 1, 3]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %231 = tosa.transpose %229, %230 : (tensor<1x5x12x64xf32>, tensor<4xi32>) -> tensor<1x12x5x64xf32>
    %232 = "tosa.const"() <{value = dense<[0, 1, 3, 2]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %233 = tosa.transpose %215, %232 : (tensor<1x12x5x64xf32>, tensor<4xi32>) -> tensor<1x12x64x5xf32>
    %234 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<1x12x5x64xf32>}> : () -> tensor<1x12x5x64xf32>
    %235 = tosa.add %231, %234 : (tensor<1x12x5x64xf32>, tensor<1x12x5x64xf32>) -> tensor<1x12x5x64xf32>
    %236 = tosa.reshape %235 {new_shape = array<i64: 12, 5, 64>} : (tensor<1x12x5x64xf32>) -> tensor<12x5x64xf32>
    %237 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<1x12x64x5xf32>}> : () -> tensor<1x12x64x5xf32>
    %238 = tosa.add %233, %237 : (tensor<1x12x64x5xf32>, tensor<1x12x64x5xf32>) -> tensor<1x12x64x5xf32>
    %239 = tosa.reshape %238 {new_shape = array<i64: 12, 64, 5>} : (tensor<1x12x64x5xf32>) -> tensor<12x64x5xf32>
    %240 = tosa.matmul %236, %239 : (tensor<12x5x64xf32>, tensor<12x64x5xf32>) -> tensor<12x5x5xf32>
    %241 = tosa.reshape %240 {new_shape = array<i64: 1, 12, 5, 5>} : (tensor<12x5x5xf32>) -> tensor<1x12x5x5xf32>
    %242 = "tosa.const"() <{value = dense<8.000000e+00> : tensor<1x12x5x5xf32>}> : () -> tensor<1x12x5x5xf32>
    %243 = tosa.reciprocal %242 : (tensor<1x12x5x5xf32>) -> tensor<1x12x5x5xf32>
    %244 = tosa.mul %241, %243 {shift = 0 : i8} : (tensor<1x12x5x5xf32>, tensor<1x12x5x5xf32>) -> tensor<1x12x5x5xf32>
    %245 = tosa.add %244, %6 : (tensor<1x12x5x5xf32>, tensor<1x1x1x5xf32>) -> tensor<1x12x5x5xf32>
    %246 = tosa.reduce_max %245 {axis = 3 : i32} : (tensor<1x12x5x5xf32>) -> tensor<1x12x5x1xf32>
    %247 = tosa.sub %245, %246 : (tensor<1x12x5x5xf32>, tensor<1x12x5x1xf32>) -> tensor<1x12x5x5xf32>
    %248 = tosa.exp %247 : (tensor<1x12x5x5xf32>) -> tensor<1x12x5x5xf32>
    %249 = tosa.reduce_sum %248 {axis = 3 : i32} : (tensor<1x12x5x5xf32>) -> tensor<1x12x5x1xf32>
    %250 = tosa.reciprocal %249 : (tensor<1x12x5x1xf32>) -> tensor<1x12x5x1xf32>
    %251 = tosa.mul %248, %250 {shift = 0 : i8} : (tensor<1x12x5x5xf32>, tensor<1x12x5x1xf32>) -> tensor<1x12x5x5xf32>
    %252 = tosa.identity %251 : (tensor<1x12x5x5xf32>) -> tensor<1x12x5x5xf32>
    %253 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<1x12x5x5xf32>}> : () -> tensor<1x12x5x5xf32>
    %254 = tosa.add %252, %253 : (tensor<1x12x5x5xf32>, tensor<1x12x5x5xf32>) -> tensor<1x12x5x5xf32>
    %255 = tosa.reshape %254 {new_shape = array<i64: 12, 5, 5>} : (tensor<1x12x5x5xf32>) -> tensor<12x5x5xf32>
    %256 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<1x12x5x64xf32>}> : () -> tensor<1x12x5x64xf32>
    %257 = tosa.add %228, %256 : (tensor<1x12x5x64xf32>, tensor<1x12x5x64xf32>) -> tensor<1x12x5x64xf32>
    %258 = tosa.reshape %257 {new_shape = array<i64: 12, 5, 64>} : (tensor<1x12x5x64xf32>) -> tensor<12x5x64xf32>
    %259 = tosa.matmul %255, %258 : (tensor<12x5x5xf32>, tensor<12x5x64xf32>) -> tensor<12x5x64xf32>
    %260 = tosa.reshape %259 {new_shape = array<i64: 1, 12, 5, 64>} : (tensor<12x5x64xf32>) -> tensor<1x12x5x64xf32>
    %261 = "tosa.const"() <{value = dense<[0, 2, 1, 3]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %262 = tosa.transpose %260, %261 : (tensor<1x12x5x64xf32>, tensor<4xi32>) -> tensor<1x5x12x64xf32>
    %263 = tosa.identity %262 : (tensor<1x5x12x64xf32>) -> tensor<1x5x12x64xf32>
    %264 = tosa.reshape %263 {new_shape = array<i64: 1, 5, 768>} : (tensor<1x5x12x64xf32>) -> tensor<1x5x768xf32>
    %265 = tosa.reshape %264 {new_shape = array<i64: 5, 768>} : (tensor<1x5x768xf32>) -> tensor<5x768xf32>
    %266 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %267 = tosa.transpose %arg27, %266 : (tensor<768x768xf32>, tensor<2xi32>) -> tensor<768x768xf32>
    %268 = tosa.reshape %265 {new_shape = array<i64: 1, 5, 768>} : (tensor<5x768xf32>) -> tensor<1x5x768xf32>
    %269 = tosa.reshape %267 {new_shape = array<i64: 1, 768, 768>} : (tensor<768x768xf32>) -> tensor<1x768x768xf32>
    %270 = tosa.matmul %268, %269 : (tensor<1x5x768xf32>, tensor<1x768x768xf32>) -> tensor<1x5x768xf32>
    %271 = tosa.reshape %270 {new_shape = array<i64: 5, 768>} : (tensor<1x5x768xf32>) -> tensor<5x768xf32>
    %272 = tosa.reshape %arg28 {new_shape = array<i64: 1, 768>} : (tensor<768xf32>) -> tensor<1x768xf32>
    %273 = tosa.add %272, %271 : (tensor<1x768xf32>, tensor<5x768xf32>) -> tensor<5x768xf32>
    %274 = tosa.reshape %273 {new_shape = array<i64: 1, 5, 768>} : (tensor<5x768xf32>) -> tensor<1x5x768xf32>
    %275 = tosa.identity %274 : (tensor<1x5x768xf32>) -> tensor<1x5x768xf32>
    %276 = tosa.add %275, %192 : (tensor<1x5x768xf32>, tensor<1x5x768xf32>) -> tensor<1x5x768xf32>
    %277 = tosa.reduce_sum %276 {axis = 2 : i32} : (tensor<1x5x768xf32>) -> tensor<1x5x1xf32>
    %278 = "tosa.const"() <{value = dense<7.680000e+02> : tensor<1xf32>}> : () -> tensor<1xf32>
    %279 = tosa.reciprocal %278 : (tensor<1xf32>) -> tensor<1xf32>
    %280 = tosa.mul %279, %277 {shift = 0 : i8} : (tensor<1xf32>, tensor<1x5x1xf32>) -> tensor<1x5x1xf32>
    %281 = tosa.sub %276, %280 : (tensor<1x5x768xf32>, tensor<1x5x1xf32>) -> tensor<1x5x768xf32>
    %282 = tosa.mul %281, %281 {shift = 0 : i8} : (tensor<1x5x768xf32>, tensor<1x5x768xf32>) -> tensor<1x5x768xf32>
    %283 = tosa.reduce_sum %282 {axis = 2 : i32} : (tensor<1x5x768xf32>) -> tensor<1x5x1xf32>
    %284 = "tosa.const"() <{value = dense<7.680000e+02> : tensor<1xf32>}> : () -> tensor<1xf32>
    %285 = tosa.reciprocal %284 : (tensor<1xf32>) -> tensor<1xf32>
    %286 = tosa.mul %285, %283 {shift = 0 : i8} : (tensor<1xf32>, tensor<1x5x1xf32>) -> tensor<1x5x1xf32>
    %287 = "tosa.const"() <{value = dense<9.99999996E-13> : tensor<1x5x1xf32>}> : () -> tensor<1x5x1xf32>
    %288 = tosa.add %286, %287 : (tensor<1x5x1xf32>, tensor<1x5x1xf32>) -> tensor<1x5x1xf32>
    %289 = tosa.rsqrt %288 : (tensor<1x5x1xf32>) -> tensor<1x5x1xf32>
    %290 = tosa.sub %276, %280 : (tensor<1x5x768xf32>, tensor<1x5x1xf32>) -> tensor<1x5x768xf32>
    %291 = tosa.mul %290, %289 {shift = 0 : i8} : (tensor<1x5x768xf32>, tensor<1x5x1xf32>) -> tensor<1x5x768xf32>
    %292 = tosa.reshape %arg29 {new_shape = array<i64: 1, 1, 768>} : (tensor<768xf32>) -> tensor<1x1x768xf32>
    %293 = tosa.mul %291, %292 {shift = 0 : i8} : (tensor<1x5x768xf32>, tensor<1x1x768xf32>) -> tensor<1x5x768xf32>
    %294 = tosa.reshape %arg30 {new_shape = array<i64: 1, 1, 768>} : (tensor<768xf32>) -> tensor<1x1x768xf32>
    %295 = tosa.add %293, %294 : (tensor<1x5x768xf32>, tensor<1x1x768xf32>) -> tensor<1x5x768xf32>
    %296 = tosa.reshape %295 {new_shape = array<i64: 5, 768>} : (tensor<1x5x768xf32>) -> tensor<5x768xf32>
    %297 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %298 = tosa.transpose %arg31, %297 : (tensor<3072x768xf32>, tensor<2xi32>) -> tensor<768x3072xf32>
    %299 = tosa.reshape %296 {new_shape = array<i64: 1, 5, 768>} : (tensor<5x768xf32>) -> tensor<1x5x768xf32>
    %300 = tosa.reshape %298 {new_shape = array<i64: 1, 768, 3072>} : (tensor<768x3072xf32>) -> tensor<1x768x3072xf32>
    %301 = tosa.matmul %299, %300 : (tensor<1x5x768xf32>, tensor<1x768x3072xf32>) -> tensor<1x5x3072xf32>
    %302 = tosa.reshape %301 {new_shape = array<i64: 5, 3072>} : (tensor<1x5x3072xf32>) -> tensor<5x3072xf32>
    %303 = tosa.reshape %arg32 {new_shape = array<i64: 1, 3072>} : (tensor<3072xf32>) -> tensor<1x3072xf32>
    %304 = tosa.add %303, %302 : (tensor<1x3072xf32>, tensor<5x3072xf32>) -> tensor<5x3072xf32>
    %305 = tosa.reshape %304 {new_shape = array<i64: 1, 5, 3072>} : (tensor<5x3072xf32>) -> tensor<1x5x3072xf32>
    %306 = "tosa.const"() <{value = dense<5.000000e-01> : tensor<1x5x3072xf32>}> : () -> tensor<1x5x3072xf32>
    %307 = tosa.mul %305, %306 {shift = 0 : i8} : (tensor<1x5x3072xf32>, tensor<1x5x3072xf32>) -> tensor<1x5x3072xf32>
    %308 = "tosa.const"() <{value = dense<0.707106769> : tensor<1x5x3072xf32>}> : () -> tensor<1x5x3072xf32>
    %309 = tosa.mul %305, %308 {shift = 0 : i8} : (tensor<1x5x3072xf32>, tensor<1x5x3072xf32>) -> tensor<1x5x3072xf32>
    %310 = math.erf %309 : tensor<1x5x3072xf32>
    %311 = "tosa.const"() <{value = dense<1.000000e+00> : tensor<1x5x3072xf32>}> : () -> tensor<1x5x3072xf32>
    %312 = tosa.add %310, %311 : (tensor<1x5x3072xf32>, tensor<1x5x3072xf32>) -> tensor<1x5x3072xf32>
    %313 = tosa.mul %307, %312 {shift = 0 : i8} : (tensor<1x5x3072xf32>, tensor<1x5x3072xf32>) -> tensor<1x5x3072xf32>
    %314 = tosa.reshape %313 {new_shape = array<i64: 5, 3072>} : (tensor<1x5x3072xf32>) -> tensor<5x3072xf32>
    %315 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %316 = tosa.transpose %arg33, %315 : (tensor<768x3072xf32>, tensor<2xi32>) -> tensor<3072x768xf32>
    %317 = tosa.reshape %314 {new_shape = array<i64: 1, 5, 3072>} : (tensor<5x3072xf32>) -> tensor<1x5x3072xf32>
    %318 = tosa.reshape %316 {new_shape = array<i64: 1, 3072, 768>} : (tensor<3072x768xf32>) -> tensor<1x3072x768xf32>
    %319 = tosa.matmul %317, %318 : (tensor<1x5x3072xf32>, tensor<1x3072x768xf32>) -> tensor<1x5x768xf32>
    %320 = tosa.reshape %319 {new_shape = array<i64: 5, 768>} : (tensor<1x5x768xf32>) -> tensor<5x768xf32>
    %321 = tosa.reshape %arg34 {new_shape = array<i64: 1, 768>} : (tensor<768xf32>) -> tensor<1x768xf32>
    %322 = tosa.add %321, %320 : (tensor<1x768xf32>, tensor<5x768xf32>) -> tensor<5x768xf32>
    %323 = tosa.reshape %322 {new_shape = array<i64: 1, 5, 768>} : (tensor<5x768xf32>) -> tensor<1x5x768xf32>
    %324 = tosa.identity %323 : (tensor<1x5x768xf32>) -> tensor<1x5x768xf32>
    %325 = tosa.add %324, %295 : (tensor<1x5x768xf32>, tensor<1x5x768xf32>) -> tensor<1x5x768xf32>
    %326 = tosa.reduce_sum %325 {axis = 2 : i32} : (tensor<1x5x768xf32>) -> tensor<1x5x1xf32>
    %327 = "tosa.const"() <{value = dense<7.680000e+02> : tensor<1xf32>}> : () -> tensor<1xf32>
    %328 = tosa.reciprocal %327 : (tensor<1xf32>) -> tensor<1xf32>
    %329 = tosa.mul %328, %326 {shift = 0 : i8} : (tensor<1xf32>, tensor<1x5x1xf32>) -> tensor<1x5x1xf32>
    %330 = tosa.sub %325, %329 : (tensor<1x5x768xf32>, tensor<1x5x1xf32>) -> tensor<1x5x768xf32>
    %331 = tosa.mul %330, %330 {shift = 0 : i8} : (tensor<1x5x768xf32>, tensor<1x5x768xf32>) -> tensor<1x5x768xf32>
    %332 = tosa.reduce_sum %331 {axis = 2 : i32} : (tensor<1x5x768xf32>) -> tensor<1x5x1xf32>
    %333 = "tosa.const"() <{value = dense<7.680000e+02> : tensor<1xf32>}> : () -> tensor<1xf32>
    %334 = tosa.reciprocal %333 : (tensor<1xf32>) -> tensor<1xf32>
    %335 = tosa.mul %334, %332 {shift = 0 : i8} : (tensor<1xf32>, tensor<1x5x1xf32>) -> tensor<1x5x1xf32>
    %336 = "tosa.const"() <{value = dense<9.99999996E-13> : tensor<1x5x1xf32>}> : () -> tensor<1x5x1xf32>
    %337 = tosa.add %335, %336 : (tensor<1x5x1xf32>, tensor<1x5x1xf32>) -> tensor<1x5x1xf32>
    %338 = tosa.rsqrt %337 : (tensor<1x5x1xf32>) -> tensor<1x5x1xf32>
    %339 = tosa.sub %325, %329 : (tensor<1x5x768xf32>, tensor<1x5x1xf32>) -> tensor<1x5x768xf32>
    %340 = tosa.mul %339, %338 {shift = 0 : i8} : (tensor<1x5x768xf32>, tensor<1x5x1xf32>) -> tensor<1x5x768xf32>
    %341 = tosa.reshape %arg35 {new_shape = array<i64: 1, 1, 768>} : (tensor<768xf32>) -> tensor<1x1x768xf32>
    %342 = tosa.mul %340, %341 {shift = 0 : i8} : (tensor<1x5x768xf32>, tensor<1x1x768xf32>) -> tensor<1x5x768xf32>
    %343 = tosa.reshape %arg36 {new_shape = array<i64: 1, 1, 768>} : (tensor<768xf32>) -> tensor<1x1x768xf32>
    %344 = tosa.add %342, %343 : (tensor<1x5x768xf32>, tensor<1x1x768xf32>) -> tensor<1x5x768xf32>
    %345 = tosa.reshape %344 {new_shape = array<i64: 5, 768>} : (tensor<1x5x768xf32>) -> tensor<5x768xf32>
    %346 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %347 = tosa.transpose %arg37, %346 : (tensor<768x768xf32>, tensor<2xi32>) -> tensor<768x768xf32>
    %348 = tosa.reshape %345 {new_shape = array<i64: 1, 5, 768>} : (tensor<5x768xf32>) -> tensor<1x5x768xf32>
    %349 = tosa.reshape %347 {new_shape = array<i64: 1, 768, 768>} : (tensor<768x768xf32>) -> tensor<1x768x768xf32>
    %350 = tosa.matmul %348, %349 : (tensor<1x5x768xf32>, tensor<1x768x768xf32>) -> tensor<1x5x768xf32>
    %351 = tosa.reshape %350 {new_shape = array<i64: 5, 768>} : (tensor<1x5x768xf32>) -> tensor<5x768xf32>
    %352 = tosa.reshape %arg38 {new_shape = array<i64: 1, 768>} : (tensor<768xf32>) -> tensor<1x768xf32>
    %353 = tosa.add %352, %351 : (tensor<1x768xf32>, tensor<5x768xf32>) -> tensor<5x768xf32>
    %354 = tosa.reshape %353 {new_shape = array<i64: 1, 5, 768>} : (tensor<5x768xf32>) -> tensor<1x5x768xf32>
    %355 = tosa.reshape %344 {new_shape = array<i64: 5, 768>} : (tensor<1x5x768xf32>) -> tensor<5x768xf32>
    %356 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %357 = tosa.transpose %arg39, %356 : (tensor<768x768xf32>, tensor<2xi32>) -> tensor<768x768xf32>
    %358 = tosa.reshape %355 {new_shape = array<i64: 1, 5, 768>} : (tensor<5x768xf32>) -> tensor<1x5x768xf32>
    %359 = tosa.reshape %357 {new_shape = array<i64: 1, 768, 768>} : (tensor<768x768xf32>) -> tensor<1x768x768xf32>
    %360 = tosa.matmul %358, %359 : (tensor<1x5x768xf32>, tensor<1x768x768xf32>) -> tensor<1x5x768xf32>
    %361 = tosa.reshape %360 {new_shape = array<i64: 5, 768>} : (tensor<1x5x768xf32>) -> tensor<5x768xf32>
    %362 = tosa.reshape %arg40 {new_shape = array<i64: 1, 768>} : (tensor<768xf32>) -> tensor<1x768xf32>
    %363 = tosa.add %362, %361 : (tensor<1x768xf32>, tensor<5x768xf32>) -> tensor<5x768xf32>
    %364 = tosa.reshape %363 {new_shape = array<i64: 1, 5, 768>} : (tensor<5x768xf32>) -> tensor<1x5x768xf32>
    %365 = tosa.reshape %364 {new_shape = array<i64: 1, 5, 12, 64>} : (tensor<1x5x768xf32>) -> tensor<1x5x12x64xf32>
    %366 = "tosa.const"() <{value = dense<[0, 2, 1, 3]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %367 = tosa.transpose %365, %366 : (tensor<1x5x12x64xf32>, tensor<4xi32>) -> tensor<1x12x5x64xf32>
    %368 = tosa.reshape %344 {new_shape = array<i64: 5, 768>} : (tensor<1x5x768xf32>) -> tensor<5x768xf32>
    %369 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %370 = tosa.transpose %arg41, %369 : (tensor<768x768xf32>, tensor<2xi32>) -> tensor<768x768xf32>
    %371 = tosa.reshape %368 {new_shape = array<i64: 1, 5, 768>} : (tensor<5x768xf32>) -> tensor<1x5x768xf32>
    %372 = tosa.reshape %370 {new_shape = array<i64: 1, 768, 768>} : (tensor<768x768xf32>) -> tensor<1x768x768xf32>
    %373 = tosa.matmul %371, %372 : (tensor<1x5x768xf32>, tensor<1x768x768xf32>) -> tensor<1x5x768xf32>
    %374 = tosa.reshape %373 {new_shape = array<i64: 5, 768>} : (tensor<1x5x768xf32>) -> tensor<5x768xf32>
    %375 = tosa.reshape %arg42 {new_shape = array<i64: 1, 768>} : (tensor<768xf32>) -> tensor<1x768xf32>
    %376 = tosa.add %375, %374 : (tensor<1x768xf32>, tensor<5x768xf32>) -> tensor<5x768xf32>
    %377 = tosa.reshape %376 {new_shape = array<i64: 1, 5, 768>} : (tensor<5x768xf32>) -> tensor<1x5x768xf32>
    %378 = tosa.reshape %377 {new_shape = array<i64: 1, 5, 12, 64>} : (tensor<1x5x768xf32>) -> tensor<1x5x12x64xf32>
    %379 = "tosa.const"() <{value = dense<[0, 2, 1, 3]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %380 = tosa.transpose %378, %379 : (tensor<1x5x12x64xf32>, tensor<4xi32>) -> tensor<1x12x5x64xf32>
    %381 = tosa.reshape %354 {new_shape = array<i64: 1, 5, 12, 64>} : (tensor<1x5x768xf32>) -> tensor<1x5x12x64xf32>
    %382 = "tosa.const"() <{value = dense<[0, 2, 1, 3]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %383 = tosa.transpose %381, %382 : (tensor<1x5x12x64xf32>, tensor<4xi32>) -> tensor<1x12x5x64xf32>
    %384 = "tosa.const"() <{value = dense<[0, 1, 3, 2]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %385 = tosa.transpose %367, %384 : (tensor<1x12x5x64xf32>, tensor<4xi32>) -> tensor<1x12x64x5xf32>
    %386 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<1x12x5x64xf32>}> : () -> tensor<1x12x5x64xf32>
    %387 = tosa.add %383, %386 : (tensor<1x12x5x64xf32>, tensor<1x12x5x64xf32>) -> tensor<1x12x5x64xf32>
    %388 = tosa.reshape %387 {new_shape = array<i64: 12, 5, 64>} : (tensor<1x12x5x64xf32>) -> tensor<12x5x64xf32>
    %389 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<1x12x64x5xf32>}> : () -> tensor<1x12x64x5xf32>
    %390 = tosa.add %385, %389 : (tensor<1x12x64x5xf32>, tensor<1x12x64x5xf32>) -> tensor<1x12x64x5xf32>
    %391 = tosa.reshape %390 {new_shape = array<i64: 12, 64, 5>} : (tensor<1x12x64x5xf32>) -> tensor<12x64x5xf32>
    %392 = tosa.matmul %388, %391 : (tensor<12x5x64xf32>, tensor<12x64x5xf32>) -> tensor<12x5x5xf32>
    %393 = tosa.reshape %392 {new_shape = array<i64: 1, 12, 5, 5>} : (tensor<12x5x5xf32>) -> tensor<1x12x5x5xf32>
    %394 = "tosa.const"() <{value = dense<8.000000e+00> : tensor<1x12x5x5xf32>}> : () -> tensor<1x12x5x5xf32>
    %395 = tosa.reciprocal %394 : (tensor<1x12x5x5xf32>) -> tensor<1x12x5x5xf32>
    %396 = tosa.mul %393, %395 {shift = 0 : i8} : (tensor<1x12x5x5xf32>, tensor<1x12x5x5xf32>) -> tensor<1x12x5x5xf32>
    %397 = tosa.add %396, %6 : (tensor<1x12x5x5xf32>, tensor<1x1x1x5xf32>) -> tensor<1x12x5x5xf32>
    %398 = tosa.reduce_max %397 {axis = 3 : i32} : (tensor<1x12x5x5xf32>) -> tensor<1x12x5x1xf32>
    %399 = tosa.sub %397, %398 : (tensor<1x12x5x5xf32>, tensor<1x12x5x1xf32>) -> tensor<1x12x5x5xf32>
    %400 = tosa.exp %399 : (tensor<1x12x5x5xf32>) -> tensor<1x12x5x5xf32>
    %401 = tosa.reduce_sum %400 {axis = 3 : i32} : (tensor<1x12x5x5xf32>) -> tensor<1x12x5x1xf32>
    %402 = tosa.reciprocal %401 : (tensor<1x12x5x1xf32>) -> tensor<1x12x5x1xf32>
    %403 = tosa.mul %400, %402 {shift = 0 : i8} : (tensor<1x12x5x5xf32>, tensor<1x12x5x1xf32>) -> tensor<1x12x5x5xf32>
    %404 = tosa.identity %403 : (tensor<1x12x5x5xf32>) -> tensor<1x12x5x5xf32>
    %405 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<1x12x5x5xf32>}> : () -> tensor<1x12x5x5xf32>
    %406 = tosa.add %404, %405 : (tensor<1x12x5x5xf32>, tensor<1x12x5x5xf32>) -> tensor<1x12x5x5xf32>
    %407 = tosa.reshape %406 {new_shape = array<i64: 12, 5, 5>} : (tensor<1x12x5x5xf32>) -> tensor<12x5x5xf32>
    %408 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<1x12x5x64xf32>}> : () -> tensor<1x12x5x64xf32>
    %409 = tosa.add %380, %408 : (tensor<1x12x5x64xf32>, tensor<1x12x5x64xf32>) -> tensor<1x12x5x64xf32>
    %410 = tosa.reshape %409 {new_shape = array<i64: 12, 5, 64>} : (tensor<1x12x5x64xf32>) -> tensor<12x5x64xf32>
    %411 = tosa.matmul %407, %410 : (tensor<12x5x5xf32>, tensor<12x5x64xf32>) -> tensor<12x5x64xf32>
    %412 = tosa.reshape %411 {new_shape = array<i64: 1, 12, 5, 64>} : (tensor<12x5x64xf32>) -> tensor<1x12x5x64xf32>
    %413 = "tosa.const"() <{value = dense<[0, 2, 1, 3]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %414 = tosa.transpose %412, %413 : (tensor<1x12x5x64xf32>, tensor<4xi32>) -> tensor<1x5x12x64xf32>
    %415 = tosa.identity %414 : (tensor<1x5x12x64xf32>) -> tensor<1x5x12x64xf32>
    %416 = tosa.reshape %415 {new_shape = array<i64: 1, 5, 768>} : (tensor<1x5x12x64xf32>) -> tensor<1x5x768xf32>
    %417 = tosa.reshape %416 {new_shape = array<i64: 5, 768>} : (tensor<1x5x768xf32>) -> tensor<5x768xf32>
    %418 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %419 = tosa.transpose %arg43, %418 : (tensor<768x768xf32>, tensor<2xi32>) -> tensor<768x768xf32>
    %420 = tosa.reshape %417 {new_shape = array<i64: 1, 5, 768>} : (tensor<5x768xf32>) -> tensor<1x5x768xf32>
    %421 = tosa.reshape %419 {new_shape = array<i64: 1, 768, 768>} : (tensor<768x768xf32>) -> tensor<1x768x768xf32>
    %422 = tosa.matmul %420, %421 : (tensor<1x5x768xf32>, tensor<1x768x768xf32>) -> tensor<1x5x768xf32>
    %423 = tosa.reshape %422 {new_shape = array<i64: 5, 768>} : (tensor<1x5x768xf32>) -> tensor<5x768xf32>
    %424 = tosa.reshape %arg44 {new_shape = array<i64: 1, 768>} : (tensor<768xf32>) -> tensor<1x768xf32>
    %425 = tosa.add %424, %423 : (tensor<1x768xf32>, tensor<5x768xf32>) -> tensor<5x768xf32>
    %426 = tosa.reshape %425 {new_shape = array<i64: 1, 5, 768>} : (tensor<5x768xf32>) -> tensor<1x5x768xf32>
    %427 = tosa.identity %426 : (tensor<1x5x768xf32>) -> tensor<1x5x768xf32>
    %428 = tosa.add %427, %344 : (tensor<1x5x768xf32>, tensor<1x5x768xf32>) -> tensor<1x5x768xf32>
    %429 = tosa.reduce_sum %428 {axis = 2 : i32} : (tensor<1x5x768xf32>) -> tensor<1x5x1xf32>
    %430 = "tosa.const"() <{value = dense<7.680000e+02> : tensor<1xf32>}> : () -> tensor<1xf32>
    %431 = tosa.reciprocal %430 : (tensor<1xf32>) -> tensor<1xf32>
