#map = affine_map<(d0, d1, d2) -> (d1)>
#map1 = affine_map<(d0, d1, d2) -> (d0, d2)>
#map2 = affine_map<(d0, d1, d2) -> (d0, d1)>
#map3 = affine_map<(d0, d1, d2, d3) -> (d0, d1, d2, d3)>
#map4 = affine_map<(d0, d1, d2) -> (d0, d1, d2)>
module {
  // ===========================================================================
  // DeepSeek R1 Transformer Model - MLIR Representation
  // ===========================================================================
  // This file contains the MLIR representation of DeepSeek R1 transformer model
  //
  // Model Architecture Summary:
  // - Vocabulary Size: 151,936 tokens
  // - Hidden Dimension: 1,536
  // - Attention Heads: 12
  // - Head Dimension: 128 (1536/12)
  // - Transformer Layers: 28 layers
  // - FFN Expansion Ratio: ~5.83 (8960/1536)
  // - Sequence Length: 40 tokens (in this example)
  // - Activation: SwiGLU (Sigmoid-Gated Linear Unit)
  // - Positional Encoding: RoPE (Rotary Position Embedding)
  // - Normalization: Layer Normalization (Pre-Norm)
  //
  // Main Components:
  // 1. Token Embedding: %arg0 (151936x1536) - vocabulary_size x hidden_dim
  // 2. Positional Encoding: %arg3 (64) - rotary embedding frequencies
  // 3. Transformer Layers (28 layers, each with):
  //    - Multi-Head Self-Attention (12 heads, 128 dims per head)
  //    - SwiGLU Feed-Forward Network (1536 -> 8960 -> 1536)
  //    - Residual Connections and Layer Normalization
  // 4. Output Projection: %arg341 (151936x1536) - hidden_dim x vocabulary_size
  //
  // Note: This MLIR file represents a single forward pass through the model.
  // The model follows the standard Transformer decoder architecture with
  // causal attention masking for autoregressive language modeling.
  // ===========================================

  func.func @subgraph0(%arg0: tensor<151936x1536xf32>, %arg1: tensor<1x40xi64>, %arg2: tensor<1x40xi64>, %arg3: tensor<64xf32>, %arg4: tensor<1536xf32>, %arg5: tensor<1536x1536xf32>, %arg6: tensor<1536xf32>, %arg7: tensor<256x1536xf32>, %arg8: tensor<256xf32>, %arg9: tensor<256x1536xf32>, %arg10: tensor<256xf32>, %arg11: tensor<1536x1536xf32>, %arg12: tensor<1536xf32>, %arg13: tensor<8960x1536xf32>, %arg14: tensor<8960x1536xf32>, %arg15: tensor<1536x8960xf32>, %arg16: tensor<1536xf32>, %arg17: tensor<1536x1536xf32>, %arg18: tensor<1536xf32>, %arg19: tensor<256x1536xf32>, %arg20: tensor<256xf32>, %arg21: tensor<256x1536xf32>, %arg22: tensor<256xf32>, %arg23: tensor<1536x1536xf32>, %arg24: tensor<1536xf32>, %arg25: tensor<8960x1536xf32>, %arg26: tensor<8960x1536xf32>, %arg27: tensor<1536x8960xf32>, %arg28: tensor<1536xf32>, %arg29: tensor<1536x1536xf32>, %arg30: tensor<1536xf32>, %arg31: tensor<256x1536xf32>, %arg32: tensor<256xf32>, %arg33: tensor<256x1536xf32>, %arg34: tensor<256xf32>, %arg35: tensor<1536x1536xf32>, %arg36: tensor<1536xf32>, %arg37: tensor<8960x1536xf32>, %arg38: tensor<8960x1536xf32>, %arg39: tensor<1536x8960xf32>, %arg40: tensor<1536xf32>, %arg41: tensor<1536x1536xf32>, %arg42: tensor<1536xf32>, %arg43: tensor<256x1536xf32>, %arg44: tensor<256xf32>, %arg45: tensor<256x1536xf32>, %arg46: tensor<256xf32>, %arg47: tensor<1536x1536xf32>, %arg48: tensor<1536xf32>, %arg49: tensor<8960x1536xf32>, %arg50: tensor<8960x1536xf32>, %arg51: tensor<1536x8960xf32>, %arg52: tensor<1536xf32>, %arg53: tensor<1536x1536xf32>, %arg54: tensor<1536xf32>, %arg55: tensor<256x1536xf32>, %arg56: tensor<256xf32>, %arg57: tensor<256x1536xf32>, %arg58: tensor<256xf32>, %arg59: tensor<1536x1536xf32>, %arg60: tensor<1536xf32>, %arg61: tensor<8960x1536xf32>, %arg62: tensor<8960x1536xf32>, %arg63: tensor<1536x8960xf32>, %arg64: tensor<1536xf32>, %arg65: tensor<1536x1536xf32>, %arg66: tensor<1536xf32>, %arg67: tensor<256x1536xf32>, %arg68: tensor<256xf32>, %arg69: tensor<256x1536xf32>, %arg70: tensor<256xf32>, %arg71: tensor<1536x1536xf32>, %arg72: tensor<1536xf32>, %arg73: tensor<8960x1536xf32>, %arg74: tensor<8960x1536xf32>, %arg75: tensor<1536x8960xf32>, %arg76: tensor<1536xf32>, %arg77: tensor<1536x1536xf32>, %arg78: tensor<1536xf32>, %arg79: tensor<256x1536xf32>, %arg80: tensor<256xf32>, %arg81: tensor<256x1536xf32>, %arg82: tensor<256xf32>, %arg83: tensor<1536x1536xf32>, %arg84: tensor<1536xf32>, %arg85: tensor<8960x1536xf32>, %arg86: tensor<8960x1536xf32>, %arg87: tensor<1536x8960xf32>, %arg88: tensor<1536xf32>, %arg89: tensor<1536x1536xf32>, %arg90: tensor<1536xf32>, %arg91: tensor<256x1536xf32>, %arg92: tensor<256xf32>, %arg93: tensor<256x1536xf32>, %arg94: tensor<256xf32>, %arg95: tensor<1536x1536xf32>, %arg96: tensor<1536xf32>, %arg97: tensor<8960x1536xf32>, %arg98: tensor<8960x1536xf32>, %arg99: tensor<1536x8960xf32>, %arg100: tensor<1536xf32>, %arg101: tensor<1536x1536xf32>, %arg102: tensor<1536xf32>, %arg103: tensor<256x1536xf32>, %arg104: tensor<256xf32>, %arg105: tensor<256x1536xf32>, %arg106: tensor<256xf32>, %arg107: tensor<1536x1536xf32>, %arg108: tensor<1536xf32>, %arg109: tensor<8960x1536xf32>, %arg110: tensor<8960x1536xf32>, %arg111: tensor<1536x8960xf32>, %arg112: tensor<1536xf32>, %arg113: tensor<1536x1536xf32>, %arg114: tensor<1536xf32>, %arg115: tensor<256x1536xf32>, %arg116: tensor<256xf32>, %arg117: tensor<256x1536xf32>, %arg118: tensor<256xf32>, %arg119: tensor<1536x1536xf32>, %arg120: tensor<1536xf32>, %arg121: tensor<8960x1536xf32>, %arg122: tensor<8960x1536xf32>, %arg123: tensor<1536x8960xf32>, %arg124: tensor<1536xf32>, %arg125: tensor<1536x1536xf32>, %arg126: tensor<1536xf32>, %arg127: tensor<256x1536xf32>, %arg128: tensor<256xf32>, %arg129: tensor<256x1536xf32>, %arg130: tensor<256xf32>, %arg131: tensor<1536x1536xf32>, %arg132: tensor<1536xf32>, %arg133: tensor<8960x1536xf32>, %arg134: tensor<8960x1536xf32>, %arg135: tensor<1536x8960xf32>, %arg136: tensor<1536xf32>, %arg137: tensor<1536x1536xf32>, %arg138: tensor<1536xf32>, %arg139: tensor<256x1536xf32>, %arg140: tensor<256xf32>, %arg141: tensor<256x1536xf32>, %arg142: tensor<256xf32>, %arg143: tensor<1536x1536xf32>, %arg144: tensor<1536xf32>, %arg145: tensor<8960x1536xf32>, %arg146: tensor<8960x1536xf32>, %arg147: tensor<1536x8960xf32>, %arg148: tensor<1536xf32>, %arg149: tensor<1536x1536xf32>, %arg150: tensor<1536xf32>, %arg151: tensor<256x1536xf32>, %arg152: tensor<256xf32>, %arg153: tensor<256x1536xf32>, %arg154: tensor<256xf32>, %arg155: tensor<1536x1536xf32>, %arg156: tensor<1536xf32>, %arg157: tensor<8960x1536xf32>, %arg158: tensor<8960x1536xf32>, %arg159: tensor<1536x8960xf32>, %arg160: tensor<1536xf32>, %arg161: tensor<1536x1536xf32>, %arg162: tensor<1536xf32>, %arg163: tensor<256x1536xf32>, %arg164: tensor<256xf32>, %arg165: tensor<256x1536xf32>, %arg166: tensor<256xf32>, %arg167: tensor<1536x1536xf32>, %arg168: tensor<1536xf32>, %arg169: tensor<8960x1536xf32>, %arg170: tensor<8960x1536xf32>, %arg171: tensor<1536x8960xf32>, %arg172: tensor<1536xf32>, %arg173: tensor<1536x1536xf32>, %arg174: tensor<1536xf32>, %arg175: tensor<256x1536xf32>, %arg176: tensor<256xf32>, %arg177: tensor<256x1536xf32>, %arg178: tensor<256xf32>, %arg179: tensor<1536x1536xf32>, %arg180: tensor<1536xf32>, %arg181: tensor<8960x1536xf32>, %arg182: tensor<8960x1536xf32>, %arg183: tensor<1536x8960xf32>, %arg184: tensor<1536xf32>, %arg185: tensor<1536x1536xf32>, %arg186: tensor<1536xf32>, %arg187: tensor<256x1536xf32>, %arg188: tensor<256xf32>, %arg189: tensor<256x1536xf32>, %arg190: tensor<256xf32>, %arg191: tensor<1536x1536xf32>, %arg192: tensor<1536xf32>, %arg193: tensor<8960x1536xf32>, %arg194: tensor<8960x1536xf32>, %arg195: tensor<1536x8960xf32>, %arg196: tensor<1536xf32>, %arg197: tensor<1536x1536xf32>, %arg198: tensor<1536xf32>, %arg199: tensor<256x1536xf32>, %arg200: tensor<256xf32>, %arg201: tensor<256x1536xf32>, %arg202: tensor<256xf32>, %arg203: tensor<1536x1536xf32>, %arg204: tensor<1536xf32>, %arg205: tensor<8960x1536xf32>, %arg206: tensor<8960x1536xf32>, %arg207: tensor<1536x8960xf32>, %arg208: tensor<1536xf32>, %arg209: tensor<1536x1536xf32>, %arg210: tensor<1536xf32>, %arg211: tensor<256x1536xf32>, %arg212: tensor<256xf32>, %arg213: tensor<256x1536xf32>, %arg214: tensor<256xf32>, %arg215: tensor<1536x1536xf32>, %arg216: tensor<1536xf32>, %arg217: tensor<8960x1536xf32>, %arg218: tensor<8960x1536xf32>, %arg219: tensor<1536x8960xf32>, %arg220: tensor<1536xf32>, %arg221: tensor<1536x1536xf32>, %arg222: tensor<1536xf32>, %arg223: tensor<256x1536xf32>, %arg224: tensor<256xf32>, %arg225: tensor<256x1536xf32>, %arg226: tensor<256xf32>, %arg227: tensor<1536x1536xf32>, %arg228: tensor<1536xf32>, %arg229: tensor<8960x1536xf32>, %arg230: tensor<8960x1536xf32>, %arg231: tensor<1536x8960xf32>, %arg232: tensor<1536xf32>, %arg233: tensor<1536x1536xf32>, %arg234: tensor<1536xf32>, %arg235: tensor<256x1536xf32>, %arg236: tensor<256xf32>, %arg237: tensor<256x1536xf32>, %arg238: tensor<256xf32>, %arg239: tensor<1536x1536xf32>, %arg240: tensor<1536xf32>, %arg241: tensor<8960x1536xf32>, %arg242: tensor<8960x1536xf32>, %arg243: tensor<1536x8960xf32>, %arg244: tensor<1536xf32>, %arg245: tensor<1536x1536xf32>, %arg246: tensor<1536xf32>, %arg247: tensor<256x1536xf32>, %arg248: tensor<256xf32>, %arg249: tensor<256x1536xf32>, %arg250: tensor<256xf32>, %arg251: tensor<1536x1536xf32>, %arg252: tensor<1536xf32>, %arg253: tensor<8960x1536xf32>, %arg254: tensor<8960x1536xf32>, %arg255: tensor<1536x8960xf32>, %arg256: tensor<1536xf32>, %arg257: tensor<1536x1536xf32>, %arg258: tensor<1536xf32>, %arg259: tensor<256x1536xf32>, %arg260: tensor<256xf32>, %arg261: tensor<256x1536xf32>, %arg262: tensor<256xf32>, %arg263: tensor<1536x1536xf32>, %arg264: tensor<1536xf32>, %arg265: tensor<8960x1536xf32>, %arg266: tensor<8960x1536xf32>, %arg267: tensor<1536x8960xf32>, %arg268: tensor<1536xf32>, %arg269: tensor<1536x1536xf32>, %arg270: tensor<1536xf32>, %arg271: tensor<256x1536xf32>, %arg272: tensor<256xf32>, %arg273: tensor<256x1536xf32>, %arg274: tensor<256xf32>, %arg275: tensor<1536x1536xf32>, %arg276: tensor<1536xf32>, %arg277: tensor<8960x1536xf32>, %arg278: tensor<8960x1536xf32>, %arg279: tensor<1536x8960xf32>, %arg280: tensor<1536xf32>, %arg281: tensor<1536x1536xf32>, %arg282: tensor<1536xf32>, %arg283: tensor<256x1536xf32>, %arg284: tensor<256xf32>, %arg285: tensor<256x1536xf32>, %arg286: tensor<256xf32>, %arg287: tensor<1536x1536xf32>, %arg288: tensor<1536xf32>, %arg289: tensor<8960x1536xf32>, %arg290: tensor<8960x1536xf32>, %arg291: tensor<1536x8960xf32>, %arg292: tensor<1536xf32>, %arg293: tensor<1536x1536xf32>, %arg294: tensor<1536xf32>, %arg295: tensor<256x1536xf32>, %arg296: tensor<256xf32>, %arg297: tensor<256x1536xf32>, %arg298: tensor<256xf32>, %arg299: tensor<1536x1536xf32>, %arg300: tensor<1536xf32>, %arg301: tensor<8960x1536xf32>, %arg302: tensor<8960x1536xf32>, %arg303: tensor<1536x8960xf32>, %arg304: tensor<1536xf32>, %arg305: tensor<1536x1536xf32>, %arg306: tensor<1536xf32>, %arg307: tensor<256x1536xf32>, %arg308: tensor<256xf32>, %arg309: tensor<256x1536xf32>, %arg310: tensor<256xf32>, %arg311: tensor<1536x1536xf32>, %arg312: tensor<1536xf32>, %arg313: tensor<8960x1536xf32>, %arg314: tensor<8960x1536xf32>, %arg315: tensor<1536x8960xf32>, %arg316: tensor<1536xf32>, %arg317: tensor<1536x1536xf32>, %arg318: tensor<1536xf32>, %arg319: tensor<256x1536xf32>, %arg320: tensor<256xf32>, %arg321: tensor<256x1536xf32>, %arg322: tensor<256xf32>, %arg323: tensor<1536x1536xf32>, %arg324: tensor<1536xf32>, %arg325: tensor<8960x1536xf32>, %arg326: tensor<8960x1536xf32>, %arg327: tensor<1536x8960xf32>, %arg328: tensor<1536xf32>, %arg329: tensor<1536x1536xf32>, %arg330: tensor<1536xf32>, %arg331: tensor<256x1536xf32>, %arg332: tensor<256xf32>, %arg333: tensor<256x1536xf32>, %arg334: tensor<256xf32>, %arg335: tensor<1536x1536xf32>, %arg336: tensor<1536xf32>, %arg337: tensor<8960x1536xf32>, %arg338: tensor<8960x1536xf32>, %arg339: tensor<1536x8960xf32>, %arg340: tensor<1536xf32>, %arg341: tensor<151936x1536xf32>) -> tensor<1x40x151936xf32> {
    // ===========================================
    // 1. TOKEN EMBEDDING LAYER
    // ===========================================
    // Input: %arg1 (1x40xi64) - token IDs for sequence of length 40
    // Embedding weights: %arg0 (151936x1536) - vocabulary_size x hidden_dim
    // Output: token embeddings (1x40x1536)

    %0 = tosa.cast %arg1 : (tensor<1x40xi64>) -> tensor<1x40xi32>
    %1 = tosa.reshape %arg0 {new_shape = array<i64: 1, 151936, 1536>} : (tensor<151936x1536xf32>) -> tensor<1x151936x1536xf32>
    %2 = tosa.gather %1, %0 : (tensor<1x151936x1536xf32>, tensor<1x40xi32>) -> tensor<1x40x1536xf32>
    %3 = tosa.reshape %2 {new_shape = array<i64: 1, 40, 1536>} : (tensor<1x40x1536xf32>) -> tensor<1x40x1536xf32>
    // ===========================================
    // 2. POSITIONAL ENCODING & ATTENTION MASK
    // ===========================================
    // Create causal attention mask to prevent attending to future tokens
    // Input: %arg2 (1x40xi64) - position indices for causal masking
    // Rotary embedding weights: %arg3 (64xf32) - rotary embedding frequencies

    %4 = "tosa.const"() <{value = dense<[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39]> : tensor<40xi64>}> : () -> tensor<40xi64>
    %5 = tosa.reshape %4 {new_shape = array<i64: 1, 40>} : (tensor<40xi64>) -> tensor<1x40xi64>
    %cst = arith.constant dense<-3.40282347E+38> : tensor<40x40xf32>
    %6 = "tosa.const"() <{value = dense<[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39]> : tensor<40xi64>}> : () -> tensor<40xi64>
    %7 = tosa.reshape %4 {new_shape = array<i64: 40, 1>} : (tensor<40xi64>) -> tensor<40x1xi64>
    %8 = tensor.empty() : tensor<40x40xi1>
    %9 = linalg.generic {indexing_maps = [#map, #map1, #map2], iterator_types = ["parallel", "parallel", "reduction"]} ins(%6, %7 : tensor<40xi64>, tensor<40x1xi64>) outs(%8 : tensor<40x40xi1>) {
    ^bb0(%in: i64, %in_843: i64, %out: i1):
      %3964 = arith.cmpi sgt, %in, %in_843 : i64
      linalg.yield %3964 : i1
    } -> tensor<40x40xi1>
    %10 = tosa.cast %9 : (tensor<40x40xi1>) -> tensor<40x40xf32>
    %11 = tosa.mul %cst, %10 : (tensor<40x40xf32>, tensor<40x40xf32>) -> tensor<40x40xf32>
    %12 = tosa.reshape %11 {new_shape = array<i64: 1, 40, 40>} : (tensor<40x40xf32>) -> tensor<1x40x40xf32>
    %13 = tosa.reshape %12 {new_shape = array<i64: 1, 1, 40, 40>} : (tensor<1x40x40xf32>) -> tensor<1x1x40x40xf32>
    %extracted_slice = tensor.extract_slice %13[0, 0, 0, 0] [1, 1, 40, 40] [1, 1, 1, 1] : tensor<1x1x40x40xf32> to tensor<1x1x40x40xf32>
    %extracted_slice_0 = tensor.extract_slice %extracted_slice[0, 0, 0, 0] [1, 1, 40, 40] [1, 1, 1, 1] : tensor<1x1x40x40xf32> to tensor<1x1x40x40xf32>
    %14 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<1x1x40x40xf32>}> : () -> tensor<1x1x40x40xf32>
    %15 = tosa.add %extracted_slice_0, %14 : (tensor<1x1x40x40xf32>, tensor<1x1x40x40xf32>) -> tensor<1x1x40x40xf32>
    %16 = tosa.identity %15 : (tensor<1x1x40x40xf32>) -> tensor<1x1x40x40xf32>
    %extracted_slice_1 = tensor.extract_slice %16[0, 0, 0, 0] [1, 1, 40, 40] [1, 1, 1, 1] : tensor<1x1x40x40xf32> to tensor<1x1x40x40xf32>
    %extracted_slice_2 = tensor.extract_slice %extracted_slice_1[0, 0, 0, 0] [1, 1, 40, 40] [1, 1, 1, 1] : tensor<1x1x40x40xf32> to tensor<1x1x40x40xf32>
    %extracted_slice_3 = tensor.extract_slice %extracted_slice_2[0, 0, 0, 0] [1, 1, 40, 40] [1, 1, 1, 1] : tensor<1x1x40x40xf32> to tensor<1x1x40x40xf32>
    %extracted_slice_4 = tensor.extract_slice %arg2[0, 0] [1, 40] [1, 1] : tensor<1x40xi64> to tensor<1x40xi64>
    %17 = tosa.reshape %extracted_slice_4 {new_shape = array<i64: 1, 1, 40>} : (tensor<1x40xi64>) -> tensor<1x1x40xi64>
    %18 = tosa.reshape %17 {new_shape = array<i64: 1, 1, 1, 40>} : (tensor<1x1x40xi64>) -> tensor<1x1x1x40xi64>
    %extracted_slice_5 = tensor.extract_slice %18[0, 0, 0, 0] [1, 1, 1, 40] [1, 1, 1, 1] : tensor<1x1x1x40xi64> to tensor<1x1x1x40xi64>
    %19 = tosa.cast %extracted_slice_5 : (tensor<1x1x1x40xi64>) -> tensor<1x1x1x40xf32>
    %20 = tosa.add %extracted_slice_3, %19 : (tensor<1x1x40x40xf32>, tensor<1x1x1x40xf32>) -> tensor<1x1x40x40xf32>
    %cst_6 = arith.constant 0.000000e+00 : f32
    %splat = tensor.splat %cst_6 : tensor<1x1x40x40xf32>
    %21 = arith.cmpf oeq, %20, %splat : tensor<1x1x40x40xf32>
    %extracted_slice_7 = tensor.extract_slice %16[0, 0, 0, 0] [1, 1, 40, 40] [1, 1, 1, 1] : tensor<1x1x40x40xf32> to tensor<1x1x40x40xf32>
    %extracted_slice_8 = tensor.extract_slice %extracted_slice_7[0, 0, 0, 0] [1, 1, 40, 40] [1, 1, 1, 1] : tensor<1x1x40x40xf32> to tensor<1x1x40x40xf32>
    %extracted_slice_9 = tensor.extract_slice %extracted_slice_8[0, 0, 0, 0] [1, 1, 40, 40] [1, 1, 1, 1] : tensor<1x1x40x40xf32> to tensor<1x1x40x40xf32>
    %cst_10 = arith.constant -3.40282347E+38 : f32
    %22 = tensor.empty() : tensor<1x1x40x40xf32>
    %splat_11 = tensor.splat %cst_10 : tensor<1x1x40x40xf32>
    %23 = linalg.generic {indexing_maps = [#map3, #map3, #map3, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%21, %splat_11, %extracted_slice_9 : tensor<1x1x40x40xi1>, tensor<1x1x40x40xf32>, tensor<1x1x40x40xf32>) outs(%22 : tensor<1x1x40x40xf32>) {
    ^bb0(%in: i1, %in_843: f32, %in_844: f32, %out: f32):
      %3964 = arith.select %in, %in_843, %in_844 : f32
      linalg.yield %3964 : f32
    } -> tensor<1x1x40x40xf32>
    %extracted_slice_12 = tensor.extract_slice %16[0, 0, 0, 0] [1, 1, 40, 40] [1, 1, 1, 1] : tensor<1x1x40x40xf32> to tensor<1x1x40x40xf32>
    %extracted_slice_13 = tensor.extract_slice %extracted_slice_12[0, 0, 0, 0] [1, 1, 40, 40] [1, 1, 1, 1] : tensor<1x1x40x40xf32> to tensor<1x1x40x40xf32>
    %extracted_slice_14 = tensor.extract_slice %extracted_slice_13[0, 0, 0, 0] [1, 1, 40, 40] [1, 1, 1, 1] : tensor<1x1x40x40xf32> to tensor<1x1x40x40xf32>
    %24 = tensor.empty() : tensor<1x1x40x40xf32>
    %25 = linalg.generic {indexing_maps = [#map3, #map3], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%23 : tensor<1x1x40x40xf32>) outs(%extracted_slice_14 : tensor<1x1x40x40xf32>) {
    ^bb0(%in: f32, %out: f32):
      linalg.yield %in : f32
    } -> tensor<1x1x40x40xf32>
    %extracted_slice_15 = tensor.extract_slice %16[0, 0, 0, 0] [1, 1, 40, 40] [1, 1, 1, 1] : tensor<1x1x40x40xf32> to tensor<1x1x40x40xf32>
    %extracted_slice_16 = tensor.extract_slice %extracted_slice_15[0, 0, 0, 0] [1, 1, 40, 40] [1, 1, 1, 1] : tensor<1x1x40x40xf32> to tensor<1x1x40x40xf32>
    %extracted_slice_17 = tensor.extract_slice %extracted_slice_16[0, 0, 0, 0] [1, 1, 40, 40] [1, 1, 1, 1] : tensor<1x1x40x40xf32> to tensor<1x1x40x40xf32>
    %inserted_slice = tensor.insert_slice %25 into %extracted_slice_16[0, 0, 0, 0] [1, 1, 40, 40] [1, 1, 1, 1] : tensor<1x1x40x40xf32> into tensor<1x1x40x40xf32>
    %extracted_slice_18 = tensor.extract_slice %extracted_slice_15[0, 0, 0, 0] [1, 1, 40, 40] [1, 1, 1, 1] : tensor<1x1x40x40xf32> to tensor<1x1x40x40xf32>
    %inserted_slice_19 = tensor.insert_slice %inserted_slice into %extracted_slice_15[0, 0, 0, 0] [1, 1, 40, 40] [1, 1, 1, 1] : tensor<1x1x40x40xf32> into tensor<1x1x40x40xf32>
    %extracted_slice_20 = tensor.extract_slice %16[0, 0, 0, 0] [1, 1, 40, 40] [1, 1, 1, 1] : tensor<1x1x40x40xf32> to tensor<1x1x40x40xf32>
    %inserted_slice_21 = tensor.insert_slice %inserted_slice_19 into %16[0, 0, 0, 0] [1, 1, 40, 40] [1, 1, 1, 1] : tensor<1x1x40x40xf32> into tensor<1x1x40x40xf32>

    // Generate Rotary Position Embedding (RoPE)
    // %arg3 contains the rotary embedding frequencies (64 dimensions)
    %26 = tosa.reshape %arg3 {new_shape = array<i64: 1, 64>} : (tensor<64xf32>) -> tensor<1x64xf32>
    %extracted_slice_22 = tensor.extract_slice %26[0, 0] [1, 64] [1, 1] : tensor<1x64xf32> to tensor<1x64xf32>
    %27 = tosa.reshape %extracted_slice_22 {new_shape = array<i64: 1, 64, 1>} : (tensor<1x64xf32>) -> tensor<1x64x1xf32>
    %28 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<1x64x1xf32>}> : () -> tensor<1x64x1xf32>
    %29 = tosa.add %27, %28 : (tensor<1x64x1xf32>, tensor<1x64x1xf32>) -> tensor<1x64x1xf32>
    %extracted_slice_23 = tensor.extract_slice %5[0, 0] [1, 40] [1, 1] : tensor<1x40xi64> to tensor<1x40xi64>
    %30 = tosa.reshape %extracted_slice_23 {new_shape = array<i64: 1, 1, 40>} : (tensor<1x40xi64>) -> tensor<1x1x40xi64>
    %extracted_slice_24 = tensor.extract_slice %30[0, 0, 0] [1, 1, 40] [1, 1, 1] : tensor<1x1x40xi64> to tensor<1x1x40xi64>
    %31 = tosa.cast %extracted_slice_24 : (tensor<1x1x40xi64>) -> tensor<1x1x40xf32>
    %32 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<1x64x1xf32>}> : () -> tensor<1x64x1xf32>
    %33 = tosa.add %29, %32 : (tensor<1x64x1xf32>, tensor<1x64x1xf32>) -> tensor<1x64x1xf32>
    %34 = tosa.reshape %33 {new_shape = array<i64: 1, 64, 1>} : (tensor<1x64x1xf32>) -> tensor<1x64x1xf32>
    %35 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<1x1x40xf32>}> : () -> tensor<1x1x40xf32>
    %36 = tosa.add %31, %35 : (tensor<1x1x40xf32>, tensor<1x1x40xf32>) -> tensor<1x1x40xf32>
    %37 = tosa.reshape %36 {new_shape = array<i64: 1, 1, 40>} : (tensor<1x1x40xf32>) -> tensor<1x1x40xf32>
    %38 = tosa.matmul %34, %37 : (tensor<1x64x1xf32>, tensor<1x1x40xf32>) -> tensor<1x64x40xf32>
    %39 = tosa.reshape %38 {new_shape = array<i64: 1, 64, 40>} : (tensor<1x64x40xf32>) -> tensor<1x64x40xf32>
    %40 = "tosa.const"() <{value = dense<[0, 2, 1]> : tensor<3xi32>}> : () -> tensor<3xi32>
    %41 = tosa.transpose %39, %40 : (tensor<1x64x40xf32>, tensor<3xi32>) -> tensor<1x40x64xf32>
    %42 = tosa.reshape %41 {new_shape = array<i64: 1, 40, 1, 64>} : (tensor<1x40x64xf32>) -> tensor<1x40x1x64xf32>
    %43 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<1x40x2x64xf32>}> : () -> tensor<1x40x2x64xf32>
    %44 = tosa.add %42, %43 : (tensor<1x40x1x64xf32>, tensor<1x40x2x64xf32>) -> tensor<1x40x2x64xf32>
    %45 = tosa.identity %44 : (tensor<1x40x2x64xf32>) -> tensor<1x40x2x64xf32>
    %46 = tosa.reshape %45 {new_shape = array<i64: 1, 40, 128>} : (tensor<1x40x2x64xf32>) -> tensor<1x40x128xf32>
    %47 = tosa.identity %46 : (tensor<1x40x128xf32>) -> tensor<1x40x128xf32>
    %48 = math.cos %47 : tensor<1x40x128xf32>
    %49 = math.sin %47 : tensor<1x40x128xf32>
    %cst_25 = arith.constant dense<1.000000e+00> : tensor<1xf32>
    %50 = tosa.reshape %cst_25 {new_shape = array<i64: 1, 1, 1>} : (tensor<1xf32>) -> tensor<1x1x1xf32>
    %51 = tosa.mul %48, %50 : (tensor<1x40x128xf32>, tensor<1x1x1xf32>) -> tensor<1x40x128xf32>
    %cst_26 = arith.constant dense<1.000000e+00> : tensor<1xf32>
    %52 = tosa.reshape %cst_26 {new_shape = array<i64: 1, 1, 1>} : (tensor<1xf32>) -> tensor<1x1x1xf32>
    %53 = tosa.mul %49, %52 : (tensor<1x40x128xf32>, tensor<1x1x1xf32>) -> tensor<1x40x128xf32>

    // ===========================================
    // 3. LAYER NORMALIZATION (Pre-Attention)
    // ===========================================
    // Apply layer normalization before attention mechanism
    // Weights: %arg4 (1536xf32) - layer norm scale
    // Bias: %arg6 (1536xf32) - layer norm bias

    %54 = tensor.empty() : tensor<1x40x1536xf32>
    %c2_i32 = arith.constant 2 : i32
    %55 = linalg.generic {indexing_maps = [#map4, #map4], iterator_types = ["parallel", "parallel", "parallel"]} ins(%3 : tensor<1x40x1536xf32>) outs(%54 : tensor<1x40x1536xf32>) {
    ^bb0(%in: f32, %out: f32):
      %3964 = math.fpowi %in, %c2_i32 : f32, i32
      linalg.yield %3964 : f32
    } -> tensor<1x40x1536xf32>
    %56 = tosa.reduce_sum %55 {axis = 2 : i32} : (tensor<1x40x1536xf32>) -> tensor<1x40x1xf32>
    %57 = "tosa.const"() <{value = dense<1.536000e+03> : tensor<1xf32>}> : () -> tensor<1xf32>
    %58 = tosa.reciprocal %57 : (tensor<1xf32>) -> tensor<1xf32>
    %59 = tosa.reshape %58 {new_shape = array<i64: 1, 1, 1>} : (tensor<1xf32>) -> tensor<1x1x1xf32>
    %60 = tosa.mul %59, %56 : (tensor<1x1x1xf32>, tensor<1x40x1xf32>) -> tensor<1x40x1xf32>
    %61 = "tosa.const"() <{value = dense<9.99999997E-7> : tensor<1x40x1xf32>}> : () -> tensor<1x40x1xf32>
    %62 = tosa.add %60, %61 : (tensor<1x40x1xf32>, tensor<1x40x1xf32>) -> tensor<1x40x1xf32>
    %63 = tosa.rsqrt %62 : (tensor<1x40x1xf32>) -> tensor<1x40x1xf32>
    %64 = tosa.mul %3, %63 : (tensor<1x40x1536xf32>, tensor<1x40x1xf32>) -> tensor<1x40x1536xf32>
    %65 = tosa.reshape %arg4 {new_shape = array<i64: 1, 1, 1536>} : (tensor<1536xf32>) -> tensor<1x1x1536xf32>
    %66 = tosa.mul %65, %64 : (tensor<1x1x1536xf32>, tensor<1x40x1536xf32>) -> tensor<1x40x1536xf32>

    // ===========================================
    // 4. MULTI-HEAD ATTENTION MECHANISM
    // ===========================================
    // Generate Query, Key, Value projections for attention
    // Model has 12 attention heads, 128 dimensions per head

    %67 = tosa.reshape %66 {new_shape = array<i64: 40, 1536>} : (tensor<1x40x1536xf32>) -> tensor<40x1536xf32>
    %68 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %69 = tosa.transpose %arg5, %68 : (tensor<1536x1536xf32>, tensor<2xi32>) -> tensor<1536x1536xf32>
    %70 = tosa.reshape %67 {new_shape = array<i64: 1, 40, 1536>} : (tensor<40x1536xf32>) -> tensor<1x40x1536xf32>
    %71 = tosa.reshape %69 {new_shape = array<i64: 1, 1536, 1536>} : (tensor<1536x1536xf32>) -> tensor<1x1536x1536xf32>
    %72 = tosa.matmul %70, %71 : (tensor<1x40x1536xf32>, tensor<1x1536x1536xf32>) -> tensor<1x40x1536xf32>
    %73 = tosa.reshape %72 {new_shape = array<i64: 40, 1536>} : (tensor<1x40x1536xf32>) -> tensor<40x1536xf32>
    %74 = tosa.reshape %arg6 {new_shape = array<i64: 1, 1536>} : (tensor<1536xf32>) -> tensor<1x1536xf32>
    %75 = tosa.add %74, %73 : (tensor<1x1536xf32>, tensor<40x1536xf32>) -> tensor<40x1536xf32>
    %76 = tosa.reshape %75 {new_shape = array<i64: 1, 40, 1536>} : (tensor<40x1536xf32>) -> tensor<1x40x1536xf32>

    // Query Projection: %arg7 (256x1536) -> Q weights
    %77 = tosa.reshape %66 {new_shape = array<i64: 40, 1536>} : (tensor<1x40x1536xf32>) -> tensor<40x1536xf32>
    %78 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %79 = tosa.transpose %arg7, %78 : (tensor<256x1536xf32>, tensor<2xi32>) -> tensor<1536x256xf32>
    %80 = tosa.reshape %77 {new_shape = array<i64: 1, 40, 1536>} : (tensor<40x1536xf32>) -> tensor<1x40x1536xf32>
    %81 = tosa.reshape %79 {new_shape = array<i64: 1, 1536, 256>} : (tensor<1536x256xf32>) -> tensor<1x1536x256xf32>
    %82 = tosa.matmul %80, %81 : (tensor<1x40x1536xf32>, tensor<1x1536x256xf32>) -> tensor<1x40x256xf32>
    %83 = tosa.reshape %82 {new_shape = array<i64: 40, 256>} : (tensor<1x40x256xf32>) -> tensor<40x256xf32>
    %84 = tosa.reshape %arg8 {new_shape = array<i64: 1, 256>} : (tensor<256xf32>) -> tensor<1x256xf32>
    %85 = tosa.add %84, %83 : (tensor<1x256xf32>, tensor<40x256xf32>) -> tensor<40x256xf32>
    %86 = tosa.reshape %85 {new_shape = array<i64: 1, 40, 256>} : (tensor<40x256xf32>) -> tensor<1x40x256xf32>

    // Key Projection: %arg9 (256x1536) -> K weights
    %87 = tosa.reshape %66 {new_shape = array<i64: 40, 1536>} : (tensor<1x40x1536xf32>) -> tensor<40x1536xf32>
    %88 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %89 = tosa.transpose %arg9, %88 : (tensor<256x1536xf32>, tensor<2xi32>) -> tensor<1536x256xf32>
    %90 = tosa.reshape %87 {new_shape = array<i64: 1, 40, 1536>} : (tensor<40x1536xf32>) -> tensor<1x40x1536xf32>
    %91 = tosa.reshape %89 {new_shape = array<i64: 1, 1536, 256>} : (tensor<1536x256xf32>) -> tensor<1x1536x256xf32>
    %92 = tosa.matmul %90, %91 : (tensor<1x40x1536xf32>, tensor<1x1536x256xf32>) -> tensor<1x40x256xf32>
    %93 = tosa.reshape %92 {new_shape = array<i64: 40, 256>} : (tensor<1x40x256xf32>) -> tensor<40x256xf32>
    %94 = tosa.reshape %arg10 {new_shape = array<i64: 1, 256>} : (tensor<256xf32>) -> tensor<1x256xf32>
    %95 = tosa.add %94, %93 : (tensor<1x256xf32>, tensor<40x256xf32>) -> tensor<40x256xf32>
    %96 = tosa.reshape %95 {new_shape = array<i64: 1, 40, 256>} : (tensor<40x256xf32>) -> tensor<1x40x256xf32>
    // Apply RoPE (Rotary Position Embedding) to Q, K vectors
    // Reshape for multi-head attention: 12 heads x 128 dims per head

    %97 = tosa.reshape %76 {new_shape = array<i64: 1, 40, 12, 128>} : (tensor<1x40x1536xf32>) -> tensor<1x40x12x128xf32>
    %98 = "tosa.const"() <{value = dense<[0, 2, 1, 3]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %99 = tosa.transpose %97, %98 : (tensor<1x40x12x128xf32>, tensor<4xi32>) -> tensor<1x12x40x128xf32>
    %100 = tosa.reshape %86 {new_shape = array<i64: 1, 40, 2, 128>} : (tensor<1x40x256xf32>) -> tensor<1x40x2x128xf32>
    %101 = "tosa.const"() <{value = dense<[0, 2, 1, 3]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %102 = tosa.transpose %100, %101 : (tensor<1x40x2x128xf32>, tensor<4xi32>) -> tensor<1x2x40x128xf32>
    %103 = tosa.reshape %96 {new_shape = array<i64: 1, 40, 2, 128>} : (tensor<1x40x256xf32>) -> tensor<1x40x2x128xf32>
    %104 = "tosa.const"() <{value = dense<[0, 2, 1, 3]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %105 = tosa.transpose %103, %104 : (tensor<1x40x2x128xf32>, tensor<4xi32>) -> tensor<1x2x40x128xf32>
    %106 = tosa.reshape %51 {new_shape = array<i64: 1, 1, 40, 128>} : (tensor<1x40x128xf32>) -> tensor<1x1x40x128xf32>
    %107 = tosa.reshape %53 {new_shape = array<i64: 1, 1, 40, 128>} : (tensor<1x40x128xf32>) -> tensor<1x1x40x128xf32>

    // Apply RoPE to Query (Q) vectors
    %108 = tosa.mul %99, %106 : (tensor<1x12x40x128xf32>, tensor<1x1x40x128xf32>) -> tensor<1x12x40x128xf32>
    %extracted_slice_27 = tensor.extract_slice %99[0, 0, 0, 0] [1, 12, 40, 64] [1, 1, 1, 1] : tensor<1x12x40x128xf32> to tensor<1x12x40x64xf32>
    %extracted_slice_28 = tensor.extract_slice %99[0, 0, 0, 64] [1, 12, 40, 64] [1, 1, 1, 1] : tensor<1x12x40x128xf32> to tensor<1x12x40x64xf32>
    %109 = tensor.empty() : tensor<1x12x40x64xf32>
    %110 = linalg.negf ins(%extracted_slice_28 : tensor<1x12x40x64xf32>) outs(%109 : tensor<1x12x40x64xf32>) -> tensor<1x12x40x64xf32>
    %111 = tensor.empty() : tensor<1x12x40x128xf32>
    %inserted_slice_29 = tensor.insert_slice %110 into %111[0, 0, 0, 0] [1, 12, 40, 64] [1, 1, 1, 1] : tensor<1x12x40x64xf32> into tensor<1x12x40x128xf32>
    %inserted_slice_30 = tensor.insert_slice %extracted_slice_27 into %inserted_slice_29[0, 0, 0, 64] [1, 12, 40, 64] [1, 1, 1, 1] : tensor<1x12x40x64xf32> into tensor<1x12x40x128xf32>
    %112 = tosa.mul %inserted_slice_30, %107 : (tensor<1x12x40x128xf32>, tensor<1x1x40x128xf32>) -> tensor<1x12x40x128xf32>
    %113 = tosa.add %108, %112 : (tensor<1x12x40x128xf32>, tensor<1x12x40x128xf32>) -> tensor<1x12x40x128xf32>

    // Apply RoPE to Key (K) vectors
    %114 = tosa.mul %102, %106 : (tensor<1x2x40x128xf32>, tensor<1x1x40x128xf32>) -> tensor<1x2x40x128xf32>
    %extracted_slice_31 = tensor.extract_slice %102[0, 0, 0, 0] [1, 2, 40, 64] [1, 1, 1, 1] : tensor<1x2x40x128xf32> to tensor<1x2x40x64xf32>
    %extracted_slice_32 = tensor.extract_slice %102[0, 0, 0, 64] [1, 2, 40, 64] [1, 1, 1, 1] : tensor<1x2x40x128xf32> to tensor<1x2x40x64xf32>
    %115 = tensor.empty() : tensor<1x2x40x64xf32>
    %116 = linalg.negf ins(%extracted_slice_32 : tensor<1x2x40x64xf32>) outs(%115 : tensor<1x2x40x64xf32>) -> tensor<1x2x40x64xf32>
    %117 = tensor.empty() : tensor<1x2x40x128xf32>
    %inserted_slice_33 = tensor.insert_slice %116 into %117[0, 0, 0, 0] [1, 2, 40, 64] [1, 1, 1, 1] : tensor<1x2x40x64xf32> into tensor<1x2x40x128xf32>
    %inserted_slice_34 = tensor.insert_slice %extracted_slice_31 into %inserted_slice_33[0, 0, 0, 64] [1, 2, 40, 64] [1, 1, 1, 1] : tensor<1x2x40x64xf32> into tensor<1x2x40x128xf32>
    %118 = tosa.mul %inserted_slice_34, %107 : (tensor<1x2x40x128xf32>, tensor<1x1x40x128xf32>) -> tensor<1x2x40x128xf32>
    %119 = tosa.add %114, %118 : (tensor<1x2x40x128xf32>, tensor<1x2x40x128xf32>) -> tensor<1x2x40x128xf32>
    // Reshape K vectors for attention computation
    %extracted_slice_35 = tensor.extract_slice %119[0, 0, 0, 0] [1, 2, 40, 128] [1, 1, 1, 1] : tensor<1x2x40x128xf32> to tensor<1x2x40x128xf32>
    %extracted_slice_36 = tensor.extract_slice %extracted_slice_35[0, 0, 0, 0] [1, 2, 40, 128] [1, 1, 1, 1] : tensor<1x2x40x128xf32> to tensor<1x2x40x128xf32>
    %120 = tosa.reshape %extracted_slice_36 {new_shape = array<i64: 1, 2, 1, 40, 128>} : (tensor<1x2x40x128xf32>) -> tensor<1x2x1x40x128xf32>
    %extracted_slice_37 = tensor.extract_slice %120[0, 0, 0, 0, 0] [1, 2, 1, 40, 128] [1, 1, 1, 1, 1] : tensor<1x2x1x40x128xf32> to tensor<1x2x1x40x128xf32>
    %extracted_slice_38 = tensor.extract_slice %extracted_slice_37[0, 0, 0, 0, 0] [1, 2, 1, 40, 128] [1, 1, 1, 1, 1] : tensor<1x2x1x40x128xf32> to tensor<1x2x1x40x128xf32>
    %121 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<1x2x6x40x128xf32>}> : () -> tensor<1x2x6x40x128xf32>
    %122 = tosa.add %extracted_slice_38, %121 : (tensor<1x2x1x40x128xf32>, tensor<1x2x6x40x128xf32>) -> tensor<1x2x6x40x128xf32>
    %123 = tosa.identity %122 : (tensor<1x2x6x40x128xf32>) -> tensor<1x2x6x40x128xf32>
    %124 = tosa.reshape %123 {new_shape = array<i64: 1, 12, 40, 128>} : (tensor<1x2x6x40x128xf32>) -> tensor<1x12x40x128xf32>

    // Reshape V vectors for attention computation
    %extracted_slice_39 = tensor.extract_slice %105[0, 0, 0, 0] [1, 2, 40, 128] [1, 1, 1, 1] : tensor<1x2x40x128xf32> to tensor<1x2x40x128xf32>
    %extracted_slice_40 = tensor.extract_slice %extracted_slice_39[0, 0, 0, 0] [1, 2, 40, 128] [1, 1, 1, 1] : tensor<1x2x40x128xf32> to tensor<1x2x40x128xf32>
    %125 = tosa.reshape %extracted_slice_40 {new_shape = array<i64: 1, 2, 1, 40, 128>} : (tensor<1x2x40x128xf32>) -> tensor<1x2x1x40x128xf32>
    %extracted_slice_41 = tensor.extract_slice %125[0, 0, 0, 0, 0] [1, 2, 1, 40, 128] [1, 1, 1, 1, 1] : tensor<1x2x1x40x128xf32> to tensor<1x2x1x40x128xf32>
    %extracted_slice_42 = tensor.extract_slice %extracted_slice_41[0, 0, 0, 0, 0] [1, 2, 1, 40, 128] [1, 1, 1, 1, 1] : tensor<1x2x1x40x128xf32> to tensor<1x2x1x40x128xf32>
    %126 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<1x2x6x40x128xf32>}> : () -> tensor<1x2x6x40x128xf32>
    %127 = tosa.add %extracted_slice_42, %126 : (tensor<1x2x1x40x128xf32>, tensor<1x2x6x40x128xf32>) -> tensor<1x2x6x40x128xf32>
    %128 = tosa.identity %127 : (tensor<1x2x6x40x128xf32>) -> tensor<1x2x6x40x128xf32>
    %129 = tosa.reshape %128 {new_shape = array<i64: 1, 12, 40, 128>} : (tensor<1x2x6x40x128xf32>) -> tensor<1x12x40x128xf32>

    // ===========================================
    // 5. ATTENTION SCORE COMPUTATION
    // ===========================================
    // Compute attention scores: Q @ K^T / sqrt(d_k)
    // Apply causal mask and softmax normalization

    %extracted_slice_43 = tensor.extract_slice %inserted_slice_21[0, 0, 0, 0] [1, 1, 40, 40] [1, 1, 1, 1] : tensor<1x1x40x40xf32> to tensor<1x1x40x40xf32>
    %extracted_slice_44 = tensor.extract_slice %extracted_slice_43[0, 0, 0, 0] [1, 1, 40, 40] [1, 1, 1, 1] : tensor<1x1x40x40xf32> to tensor<1x1x40x40xf32>
    %extracted_slice_45 = tensor.extract_slice %extracted_slice_44[0, 0, 0, 0] [1, 1, 40, 40] [1, 1, 1, 1] : tensor<1x1x40x40xf32> to tensor<1x1x40x40xf32>
    %cst_46 = arith.constant 0.000000e+00 : f32
    %splat_47 = tensor.splat %cst_46 : tensor<40x40xf32>
    %130 = tosa.reshape %extracted_slice_45 {new_shape = array<i64: 40, 40>} : (tensor<1x1x40x40xf32>) -> tensor<40x40xf32>
    %131 = tosa.add %splat_47, %130 : (tensor<40x40xf32>, tensor<40x40xf32>) -> tensor<40x40xf32>
    %132 = "tosa.const"() <{value = dense<[0, 1, 3, 2]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %133 = tosa.transpose %124, %132 : (tensor<1x12x40x128xf32>, tensor<4xi32>) -> tensor<1x12x128x40xf32>
    %134 = tosa.reshape %113 {new_shape = array<i64: 12, 40, 128>} : (tensor<1x12x40x128xf32>) -> tensor<12x40x128xf32>
    %135 = tosa.reshape %133 {new_shape = array<i64: 12, 128, 40>} : (tensor<1x12x128x40xf32>) -> tensor<12x128x40xf32>
    %136 = tosa.matmul %134, %135 : (tensor<12x40x128xf32>, tensor<12x128x40xf32>) -> tensor<12x40x40xf32>
    %cst_48 = arith.constant 0.0883883461 : f32
    %splat_49 = tensor.splat %cst_48 : tensor<12x40x40xf32>
    %137 = tosa.mul %136, %splat_49 : (tensor<12x40x40xf32>, tensor<12x40x40xf32>) -> tensor<12x40x40xf32>
    %138 = tosa.reshape %131 {new_shape = array<i64: 1, 40, 40>} : (tensor<40x40xf32>) -> tensor<1x40x40xf32>
    %139 = tosa.add %137, %138 : (tensor<12x40x40xf32>, tensor<1x40x40xf32>) -> tensor<12x40x40xf32>

    // Apply softmax with numerical stability (log-sum-exp trick)
    %140 = tosa.reduce_max %139 {axis = 2 : i32} : (tensor<12x40x40xf32>) -> tensor<12x40x1xf32>
    %141 = tosa.sub %139, %140 : (tensor<12x40x40xf32>, tensor<12x40x1xf32>) -> tensor<12x40x40xf32>
    %142 = math.exp %141 : tensor<12x40x40xf32>
    %143 = tosa.reduce_sum %142 {axis = 2 : i32} : (tensor<12x40x40xf32>) -> tensor<12x40x1xf32>
    %144 = tosa.log %143 : (tensor<12x40x1xf32>) -> tensor<12x40x1xf32>
    %145 = tosa.add %140, %144 : (tensor<12x40x1xf32>, tensor<12x40x1xf32>) -> tensor<12x40x1xf32>
    %146 = tosa.sub %139, %145 : (tensor<12x40x40xf32>, tensor<12x40x1xf32>) -> tensor<12x40x40xf32>
    %147 = math.exp %146 : tensor<12x40x40xf32>
    %148 = tosa.reshape %145 {new_shape = array<i64: 1, 12, 40>} : (tensor<12x40x1xf32>) -> tensor<1x12x40xf32>
    %149 = tosa.reshape %129 {new_shape = array<i64: 12, 40, 128>} : (tensor<1x12x40x128xf32>) -> tensor<12x40x128xf32>
    %150 = tosa.matmul %147, %149 : (tensor<12x40x40xf32>, tensor<12x40x128xf32>) -> tensor<12x40x128xf32>
    %151 = tosa.reshape %150 {new_shape = array<i64: 1, 12, 40, 128>} : (tensor<12x40x128xf32>) -> tensor<1x12x40x128xf32>
    %152 = "tosa.const"() <{value = dense<[0, 2, 1, 3]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %153 = tosa.transpose %151, %152 : (tensor<1x12x40x128xf32>, tensor<4xi32>) -> tensor<1x40x12x128xf32>
    %154 = tosa.reshape %153 {new_shape = array<i64: 1, 40, 1536>} : (tensor<1x40x12x128xf32>) -> tensor<1x40x1536xf32>

    // ===========================================
    // 6. OUTPUT PROJECTION & RESIDUAL CONNECTION
    // ===========================================
    // Project attention output back to hidden dimension
    // Add residual connection (attention output + input)

    %155 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %156 = tosa.transpose %arg11, %155 : (tensor<1536x1536xf32>, tensor<2xi32>) -> tensor<1536x1536xf32>
    %157 = tosa.reshape %154 {new_shape = array<i64: 40, 1536>} : (tensor<1x40x1536xf32>) -> tensor<40x1536xf32>
    %cst_50 = arith.constant dense<0.000000e+00> : tensor<40x1536xf32>
    %158 = linalg.matmul {cast = #linalg.type_fn<cast_signed>} ins(%157, %156 : tensor<40x1536xf32>, tensor<1536x1536xf32>) outs(%cst_50 : tensor<40x1536xf32>) -> tensor<40x1536xf32>
    %159 = tosa.reshape %158 {new_shape = array<i64: 1, 40, 1536>} : (tensor<40x1536xf32>) -> tensor<1x40x1536xf32>
    %160 = tosa.add %3, %159 : (tensor<1x40x1536xf32>, tensor<1x40x1536xf32>) -> tensor<1x40x1536xf32>

    // ===========================================
    // 7. LAYER NORMALIZATION (Pre-FFN)
    // ===========================================
    // Apply layer normalization before feed-forward network

    %161 = tensor.empty() : tensor<1x40x1536xf32>
    %c2_i32_51 = arith.constant 2 : i32
    %162 = linalg.generic {indexing_maps = [#map4, #map4], iterator_types = ["parallel", "parallel", "parallel"]} ins(%160 : tensor<1x40x1536xf32>) outs(%161 : tensor<1x40x1536xf32>) {
    ^bb0(%in: f32, %out: f32):
      %3964 = math.fpowi %in, %c2_i32_51 : f32, i32
      linalg.yield %3964 : f32
    } -> tensor<1x40x1536xf32>
    %163 = tosa.reduce_sum %162 {axis = 2 : i32} : (tensor<1x40x1536xf32>) -> tensor<1x40x1xf32>
    %164 = "tosa.const"() <{value = dense<1.536000e+03> : tensor<1xf32>}> : () -> tensor<1xf32>
    %165 = tosa.reciprocal %164 : (tensor<1xf32>) -> tensor<1xf32>
    %166 = tosa.reshape %165 {new_shape = array<i64: 1, 1, 1>} : (tensor<1xf32>) -> tensor<1x1x1xf32>
    %167 = tosa.mul %166, %163 : (tensor<1x1x1xf32>, tensor<1x40x1xf32>) -> tensor<1x40x1xf32>
    %168 = "tosa.const"() <{value = dense<9.99999997E-7> : tensor<1x40x1xf32>}> : () -> tensor<1x40x1xf32>
    %169 = tosa.add %167, %168 : (tensor<1x40x1xf32>, tensor<1x40x1xf32>) -> tensor<1x40x1xf32>
    %170 = tosa.rsqrt %169 : (tensor<1x40x1xf32>) -> tensor<1x40x1xf32>
    %171 = tosa.mul %160, %170 : (tensor<1x40x1536xf32>, tensor<1x40x1xf32>) -> tensor<1x40x1536xf32>
    %172 = tosa.reshape %arg12 {new_shape = array<i64: 1, 1, 1536>} : (tensor<1536xf32>) -> tensor<1x1x1536xf32>
    %173 = tosa.mul %172, %171 : (tensor<1x1x1536xf32>, tensor<1x40x1536xf32>) -> tensor<1x40x1536xf32>

    // ===========================================
    // 8. FEED-FORWARD NETWORK (FFN)
    // ===========================================
    // DeepSeek uses SwiGLU activation: x * sigmoid(x) * gate
    // FFN expansion ratio: 1536 -> 8960 -> 1536

    %174 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %175 = tosa.transpose %arg13, %174 : (tensor<8960x1536xf32>, tensor<2xi32>) -> tensor<1536x8960xf32>
    %176 = tosa.reshape %173 {new_shape = array<i64: 40, 1536>} : (tensor<1x40x1536xf32>) -> tensor<40x1536xf32>
    %cst_52 = arith.constant dense<0.000000e+00> : tensor<40x8960xf32>
    %177 = linalg.matmul {cast = #linalg.type_fn<cast_signed>} ins(%176, %175 : tensor<40x1536xf32>, tensor<1536x8960xf32>) outs(%cst_52 : tensor<40x8960xf32>) -> tensor<40x8960xf32>
    %178 = tosa.reshape %177 {new_shape = array<i64: 1, 40, 8960>} : (tensor<40x8960xf32>) -> tensor<1x40x8960xf32>
    %179 = tosa.sigmoid %178 : (tensor<1x40x8960xf32>) -> tensor<1x40x8960xf32>
    %180 = tosa.mul %178, %179 : (tensor<1x40x8960xf32>, tensor<1x40x8960xf32>) -> tensor<1x40x8960xf32>
    %181 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %182 = tosa.transpose %arg14, %181 : (tensor<8960x1536xf32>, tensor<2xi32>) -> tensor<1536x8960xf32>
    %183 = tosa.reshape %173 {new_shape = array<i64: 40, 1536>} : (tensor<1x40x1536xf32>) -> tensor<40x1536xf32>
    %cst_53 = arith.constant dense<0.000000e+00> : tensor<40x8960xf32>
    %184 = linalg.matmul {cast = #linalg.type_fn<cast_signed>} ins(%183, %182 : tensor<40x1536xf32>, tensor<1536x8960xf32>) outs(%cst_53 : tensor<40x8960xf32>) -> tensor<40x8960xf32>
    %185 = tosa.reshape %184 {new_shape = array<i64: 1, 40, 8960>} : (tensor<40x8960xf32>) -> tensor<1x40x8960xf32>
    %186 = tosa.mul %180, %185 : (tensor<1x40x8960xf32>, tensor<1x40x8960xf32>) -> tensor<1x40x8960xf32>
    %187 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %188 = tosa.transpose %arg15, %187 : (tensor<1536x8960xf32>, tensor<2xi32>) -> tensor<8960x1536xf32>
    %189 = tosa.reshape %186 {new_shape = array<i64: 40, 8960>} : (tensor<1x40x8960xf32>) -> tensor<40x8960xf32>
    %cst_54 = arith.constant dense<0.000000e+00> : tensor<40x1536xf32>
    %190 = linalg.matmul {cast = #linalg.type_fn<cast_signed>} ins(%189, %188 : tensor<40x8960xf32>, tensor<8960x1536xf32>) outs(%cst_54 : tensor<40x1536xf32>) -> tensor<40x1536xf32>
    %191 = tosa.reshape %190 {new_shape = array<i64: 1, 40, 1536>} : (tensor<40x1536xf32>) -> tensor<1x40x1536xf32>
    %192 = tosa.add %160, %191 : (tensor<1x40x1536xf32>, tensor<1x40x1536xf32>) -> tensor<1x40x1536xf32>
    %193 = tensor.empty() : tensor<1x40x1536xf32>
    %c2_i32_55 = arith.constant 2 : i32
    %194 = linalg.generic {indexing_maps = [#map4, #map4], iterator_types = ["parallel", "parallel", "parallel"]} ins(%192 : tensor<1x40x1536xf32>) outs(%193 : tensor<1x40x1536xf32>) {
    ^bb0(%in: f32, %out: f32):
      %3964 = math.fpowi %in, %c2_i32_55 : f32, i32
      linalg.yield %3964 : f32
    } -> tensor<1x40x1536xf32>
    %195 = tosa.reduce_sum %194 {axis = 2 : i32} : (tensor<1x40x1536xf32>) -> tensor<1x40x1xf32>
    %196 = "tosa.const"() <{value = dense<1.536000e+03> : tensor<1xf32>}> : () -> tensor<1xf32>
    %197 = tosa.reciprocal %196 : (tensor<1xf32>) -> tensor<1xf32>
    %198 = tosa.reshape %197 {new_shape = array<i64: 1, 1, 1>} : (tensor<1xf32>) -> tensor<1x1x1xf32>
    %199 = tosa.mul %198, %195 : (tensor<1x1x1xf32>, tensor<1x40x1xf32>) -> tensor<1x40x1xf32>
    %200 = "tosa.const"() <{value = dense<9.99999997E-7> : tensor<1x40x1xf32>}> : () -> tensor<1x40x1xf32>
    %201 = tosa.add %199, %200 : (tensor<1x40x1xf32>, tensor<1x40x1xf32>) -> tensor<1x40x1xf32>
    %202 = tosa.rsqrt %201 : (tensor<1x40x1xf32>) -> tensor<1x40x1xf32>
    %203 = tosa.mul %192, %202 : (tensor<1x40x1536xf32>, tensor<1x40x1xf32>) -> tensor<1x40x1536xf32>
    %204 = tosa.reshape %arg16 {new_shape = array<i64: 1, 1, 1536>} : (tensor<1536xf32>) -> tensor<1x1x1536xf32>
    %205 = tosa.mul %204, %203 : (tensor<1x1x1536xf32>, tensor<1x40x1536xf32>) -> tensor<1x40x1536xf32>
    %206 = tosa.reshape %205 {new_shape = array<i64: 40, 1536>} : (tensor<1x40x1536xf32>) -> tensor<40x1536xf32>
    %207 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %208 = tosa.transpose %arg17, %207 : (tensor<1536x1536xf32>, tensor<2xi32>) -> tensor<1536x1536xf32>
    %209 = tosa.reshape %206 {new_shape = array<i64: 1, 40, 1536>} : (tensor<40x1536xf32>) -> tensor<1x40x1536xf32>
    %210 = tosa.reshape %208 {new_shape = array<i64: 1, 1536, 1536>} : (tensor<1536x1536xf32>) -> tensor<1x1536x1536xf32>
    %211 = tosa.matmul %209, %210 : (tensor<1x40x1536xf32>, tensor<1x1536x1536xf32>) -> tensor<1x40x1536xf32>

    // ===========================================
    // 9. REMAINING TRANSFORMER LAYERS (Layer 2-28)
    // ===========================================
    // The following operations represent the remaining 27 transformer layers
    // Each layer follows the same pattern as Layer 1:
    // 1. Layer Normalization (Pre-Attention)
    // 2. Multi-Head Self-Attention with RoPE
    // 3. Residual Connection + Output Projection
    // 4. Layer Normalization (Pre-FFN)
    // 5. SwiGLU Feed-Forward Network
    // 6. Residual Connection
    //
    // Total Architecture: 28 Transformer Layers
    // - Each layer processes the same sequence length (40 tokens)
    // - Same hidden dimension (1536) and attention heads (12)
    // - Same FFN expansion ratio (1536 -> 8960 -> 1536)
    // - RoPE applied to Q, K vectors in each attention layer
    // - SwiGLU activation in each FFN layer
    //
    // Note: The parameters (arg17-arg340) represent the weights and biases
    // for all 28 transformer layers, with each layer having its own
    // set of learned parameters for attention and FFN operations.
    // ===========================================
    %212 = tosa.reshape %211 {new_shape = array<i64: 40, 1536>} : (tensor<1x40x1536xf32>) -> tensor<40x1536xf32>
    %213 = tosa.reshape %arg18 {new_shape = array<i64: 1, 1536>} : (tensor<1536xf32>) -> tensor<1x1536xf32>
    %214 = tosa.add %213, %212 : (tensor<1x1536xf32>, tensor<40x1536xf32>) -> tensor<40x1536xf32>
    %215 = tosa.reshape %214 {new_shape = array<i64: 1, 40, 1536>} : (tensor<40x1536xf32>) -> tensor<1x40x1536xf32>
    %216 = tosa.reshape %205 {new_shape = array<i64: 40, 1536>} : (tensor<1x40x1536xf32>) -> tensor<40x1536xf32>
    %217 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %218 = tosa.transpose %arg19, %217 : (tensor<256x1536xf32>, tensor<2xi32>) -> tensor<1536x256xf32>
    %219 = tosa.reshape %216 {new_shape = array<i64: 1, 40, 1536>} : (tensor<40x1536xf32>) -> tensor<1x40x1536xf32>
    %220 = tosa.reshape %218 {new_shape = array<i64: 1, 1536, 256>} : (tensor<1536x256xf32>) -> tensor<1x1536x256xf32>
    %221 = tosa.matmul %219, %220 : (tensor<1x40x1536xf32>, tensor<1x1536x256xf32>) -> tensor<1x40x256xf32>
    %222 = tosa.reshape %221 {new_shape = array<i64: 40, 256>} : (tensor<1x40x256xf32>) -> tensor<40x256xf32>
    %223 = tosa.reshape %arg20 {new_shape = array<i64: 1, 256>} : (tensor<256xf32>) -> tensor<1x256xf32>
    %224 = tosa.add %223, %222 : (tensor<1x256xf32>, tensor<40x256xf32>) -> tensor<40x256xf32>
    %225 = tosa.reshape %224 {new_shape = array<i64: 1, 40, 256>} : (tensor<40x256xf32>) -> tensor<1x40x256xf32>
    %226 = tosa.reshape %205 {new_shape = array<i64: 40, 1536>} : (tensor<1x40x1536xf32>) -> tensor<40x1536xf32>
    %227 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %228 = tosa.transpose %arg21, %227 : (tensor<256x1536xf32>, tensor<2xi32>) -> tensor<1536x256xf32>
    %229 = tosa.reshape %226 {new_shape = array<i64: 1, 40, 1536>} : (tensor<40x1536xf32>) -> tensor<1x40x1536xf32>
    %230 = tosa.reshape %228 {new_shape = array<i64: 1, 1536, 256>} : (tensor<1536x256xf32>) -> tensor<1x1536x256xf32>
    %231 = tosa.matmul %229, %230 : (tensor<1x40x1536xf32>, tensor<1x1536x256xf32>) -> tensor<1x40x256xf32>
    %232 = tosa.reshape %231 {new_shape = array<i64: 40, 256>} : (tensor<1x40x256xf32>) -> tensor<40x256xf32>
    %233 = tosa.reshape %arg22 {new_shape = array<i64: 1, 256>} : (tensor<256xf32>) -> tensor<1x256xf32>
    %234 = tosa.add %233, %232 : (tensor<1x256xf32>, tensor<40x256xf32>) -> tensor<40x256xf32>
    %235 = tosa.reshape %234 {new_shape = array<i64: 1, 40, 256>} : (tensor<40x256xf32>) -> tensor<1x40x256xf32>
    %236 = tosa.reshape %215 {new_shape = array<i64: 1, 40, 12, 128>} : (tensor<1x40x1536xf32>) -> tensor<1x40x12x128xf32>
    %237 = "tosa.const"() <{value = dense<[0, 2, 1, 3]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %238 = tosa.transpose %236, %237 : (tensor<1x40x12x128xf32>, tensor<4xi32>) -> tensor<1x12x40x128xf32>
    %239 = tosa.reshape %225 {new_shape = array<i64: 1, 40, 2, 128>} : (tensor<1x40x256xf32>) -> tensor<1x40x2x128xf32>
    %240 = "tosa.const"() <{value = dense<[0, 2, 1, 3]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %241 = tosa.transpose %239, %240 : (tensor<1x40x2x128xf32>, tensor<4xi32>) -> tensor<1x2x40x128xf32>
