module {
  func.func @subgraph0(%arg0: tensor<1x3x224x224xf32>, %arg1: tensor<16x3x3x3xf32>, %arg2: tensor<16xf32>, %arg3: tensor<16xf32>, %arg4: tensor<16xf32>, %arg5: tensor<16xf32>, %arg6: tensor<16x1x3x3xf32>, %arg7: tensor<16xf32>, %arg8: tensor<16xf32>, %arg9: tensor<16xf32>, %arg10: tensor<16xf32>, %arg11: tensor<8x16x1x1xf32>, %arg12: tensor<8xf32>, %arg13: tensor<16x8x1x1xf32>, %arg14: tensor<16xf32>, %arg15: tensor<16x16x1x1xf32>, %arg16: tensor<16xf32>, %arg17: tensor<16xf32>, %arg18: tensor<16xf32>, %arg19: tensor<16xf32>, %arg20: tensor<72x16x1x1xf32>, %arg21: tensor<72xf32>, %arg22: tensor<72xf32>, %arg23: tensor<72xf32>, %arg24: tensor<72xf32>, %arg25: tensor<72x1x3x3xf32>, %arg26: tensor<72xf32>, %arg27: tensor<72xf32>, %arg28: tensor<72xf32>, %arg29: tensor<72xf32>, %arg30: tensor<24x72x1x1xf32>, %arg31: tensor<24xf32>, %arg32: tensor<24xf32>, %arg33: tensor<24xf32>, %arg34: tensor<24xf32>, %arg35: tensor<88x24x1x1xf32>, %arg36: tensor<88xf32>, %arg37: tensor<88xf32>, %arg38: tensor<88xf32>, %arg39: tensor<88xf32>, %arg40: tensor<88x1x3x3xf32>, %arg41: tensor<88xf32>, %arg42: tensor<88xf32>, %arg43: tensor<88xf32>, %arg44: tensor<88xf32>, %arg45: tensor<24x88x1x1xf32>, %arg46: tensor<24xf32>, %arg47: tensor<24xf32>, %arg48: tensor<24xf32>, %arg49: tensor<24xf32>, %arg50: tensor<96x24x1x1xf32>, %arg51: tensor<96xf32>, %arg52: tensor<96xf32>, %arg53: tensor<96xf32>, %arg54: tensor<96xf32>, %arg55: tensor<96x1x5x5xf32>, %arg56: tensor<96xf32>, %arg57: tensor<96xf32>, %arg58: tensor<96xf32>, %arg59: tensor<96xf32>, %arg60: tensor<24x96x1x1xf32>, %arg61: tensor<24xf32>, %arg62: tensor<96x24x1x1xf32>, %arg63: tensor<96xf32>, %arg64: tensor<40x96x1x1xf32>, %arg65: tensor<40xf32>, %arg66: tensor<40xf32>, %arg67: tensor<40xf32>, %arg68: tensor<40xf32>, %arg69: tensor<240x40x1x1xf32>, %arg70: tensor<240xf32>, %arg71: tensor<240xf32>, %arg72: tensor<240xf32>, %arg73: tensor<240xf32>, %arg74: tensor<240x1x5x5xf32>, %arg75: tensor<240xf32>, %arg76: tensor<240xf32>, %arg77: tensor<240xf32>, %arg78: tensor<240xf32>, %arg79: tensor<64x240x1x1xf32>, %arg80: tensor<64xf32>, %arg81: tensor<240x64x1x1xf32>, %arg82: tensor<240xf32>, %arg83: tensor<40x240x1x1xf32>, %arg84: tensor<40xf32>, %arg85: tensor<40xf32>, %arg86: tensor<40xf32>, %arg87: tensor<40xf32>, %arg88: tensor<240x40x1x1xf32>, %arg89: tensor<240xf32>, %arg90: tensor<240xf32>, %arg91: tensor<240xf32>, %arg92: tensor<240xf32>, %arg93: tensor<240x1x5x5xf32>, %arg94: tensor<240xf32>, %arg95: tensor<240xf32>, %arg96: tensor<240xf32>, %arg97: tensor<240xf32>, %arg98: tensor<64x240x1x1xf32>, %arg99: tensor<64xf32>, %arg100: tensor<240x64x1x1xf32>, %arg101: tensor<240xf32>, %arg102: tensor<40x240x1x1xf32>, %arg103: tensor<40xf32>, %arg104: tensor<40xf32>, %arg105: tensor<40xf32>, %arg106: tensor<40xf32>, %arg107: tensor<120x40x1x1xf32>, %arg108: tensor<120xf32>, %arg109: tensor<120xf32>, %arg110: tensor<120xf32>, %arg111: tensor<120xf32>, %arg112: tensor<120x1x5x5xf32>, %arg113: tensor<120xf32>, %arg114: tensor<120xf32>, %arg115: tensor<120xf32>, %arg116: tensor<120xf32>, %arg117: tensor<32x120x1x1xf32>, %arg118: tensor<32xf32>, %arg119: tensor<120x32x1x1xf32>, %arg120: tensor<120xf32>, %arg121: tensor<48x120x1x1xf32>, %arg122: tensor<48xf32>, %arg123: tensor<48xf32>, %arg124: tensor<48xf32>, %arg125: tensor<48xf32>, %arg126: tensor<144x48x1x1xf32>, %arg127: tensor<144xf32>, %arg128: tensor<144xf32>, %arg129: tensor<144xf32>, %arg130: tensor<144xf32>, %arg131: tensor<144x1x5x5xf32>, %arg132: tensor<144xf32>, %arg133: tensor<144xf32>, %arg134: tensor<144xf32>, %arg135: tensor<144xf32>, %arg136: tensor<40x144x1x1xf32>, %arg137: tensor<40xf32>, %arg138: tensor<144x40x1x1xf32>, %arg139: tensor<144xf32>, %arg140: tensor<48x144x1x1xf32>, %arg141: tensor<48xf32>, %arg142: tensor<48xf32>, %arg143: tensor<48xf32>, %arg144: tensor<48xf32>, %arg145: tensor<288x48x1x1xf32>, %arg146: tensor<288xf32>, %arg147: tensor<288xf32>, %arg148: tensor<288xf32>, %arg149: tensor<288xf32>, %arg150: tensor<288x1x5x5xf32>, %arg151: tensor<288xf32>, %arg152: tensor<288xf32>, %arg153: tensor<288xf32>, %arg154: tensor<288xf32>, %arg155: tensor<72x288x1x1xf32>, %arg156: tensor<72xf32>, %arg157: tensor<288x72x1x1xf32>, %arg158: tensor<288xf32>, %arg159: tensor<96x288x1x1xf32>, %arg160: tensor<96xf32>, %arg161: tensor<96xf32>, %arg162: tensor<96xf32>, %arg163: tensor<96xf32>, %arg164: tensor<576x96x1x1xf32>, %arg165: tensor<576xf32>, %arg166: tensor<576xf32>, %arg167: tensor<576xf32>, %arg168: tensor<576xf32>, %arg169: tensor<576x1x5x5xf32>, %arg170: tensor<576xf32>, %arg171: tensor<576xf32>, %arg172: tensor<576xf32>, %arg173: tensor<576xf32>, %arg174: tensor<144x576x1x1xf32>, %arg175: tensor<144xf32>, %arg176: tensor<576x144x1x1xf32>, %arg177: tensor<576xf32>, %arg178: tensor<96x576x1x1xf32>, %arg179: tensor<96xf32>, %arg180: tensor<96xf32>, %arg181: tensor<96xf32>, %arg182: tensor<96xf32>, %arg183: tensor<576x96x1x1xf32>, %arg184: tensor<576xf32>, %arg185: tensor<576xf32>, %arg186: tensor<576xf32>, %arg187: tensor<576xf32>, %arg188: tensor<576x1x5x5xf32>, %arg189: tensor<576xf32>, %arg190: tensor<576xf32>, %arg191: tensor<576xf32>, %arg192: tensor<576xf32>, %arg193: tensor<144x576x1x1xf32>, %arg194: tensor<144xf32>, %arg195: tensor<576x144x1x1xf32>, %arg196: tensor<576xf32>, %arg197: tensor<96x576x1x1xf32>, %arg198: tensor<96xf32>, %arg199: tensor<96xf32>, %arg200: tensor<96xf32>, %arg201: tensor<96xf32>, %arg202: tensor<576x96x1x1xf32>, %arg203: tensor<576xf32>, %arg204: tensor<576xf32>, %arg205: tensor<576xf32>, %arg206: tensor<576xf32>, %arg207: tensor<1024x576xf32>, %arg208: tensor<1024xf32>, %arg209: tensor<1000x1024xf32>, %arg210: tensor<1000xf32>) -> tensor<1x1000xf32> {
    %0 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<16xf32>}> : () -> tensor<16xf32>
    %1 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %2 = tosa.transpose %arg0, %1 : (tensor<1x3x224x224xf32>, tensor<4xi32>) -> tensor<1x224x224x3xf32>
    %3 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %4 = tosa.transpose %arg1, %3 : (tensor<16x3x3x3xf32>, tensor<4xi32>) -> tensor<16x3x3x3xf32>
    %5 = tosa.conv2d %2, %4, %0 {dilation = array<i64: 1, 1>, pad = array<i64: 1, 1, 1, 1>, stride = array<i64: 2, 2>} : (tensor<1x224x224x3xf32>, tensor<16x3x3x3xf32>, tensor<16xf32>) -> tensor<1x112x112x16xf32>
    %6 = "tosa.const"() <{value = dense<[0, 3, 1, 2]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %7 = tosa.transpose %5, %6 : (tensor<1x112x112x16xf32>, tensor<4xi32>) -> tensor<1x16x112x112xf32>
    %8 = tosa.cast %arg2 : (tensor<16xf32>) -> tensor<16xf32>
    %9 = tosa.cast %arg3 : (tensor<16xf32>) -> tensor<16xf32>
    %10 = "tosa.const"() <{value = dense<1.000000e-03> : tensor<16xf32>}> : () -> tensor<16xf32>
    %11 = tosa.add %9, %10 : (tensor<16xf32>, tensor<16xf32>) -> tensor<16xf32>
    %12 = math.sqrt %11 : tensor<16xf32>
    %13 = tosa.reciprocal %12 : (tensor<16xf32>) -> tensor<16xf32>
    %14 = "tosa.const"() <{value = dense<1.000000e+00> : tensor<16xf32>}> : () -> tensor<16xf32>
    %15 = tosa.mul %13, %14 {shift = 0 : i8} : (tensor<16xf32>, tensor<16xf32>) -> tensor<16xf32>
    %16 = tosa.reshape %8 {new_shape = array<i64: 16, 1>} : (tensor<16xf32>) -> tensor<16x1xf32>
    %17 = tosa.reshape %16 {new_shape = array<i64: 16, 1, 1>} : (tensor<16x1xf32>) -> tensor<16x1x1xf32>
    %18 = tosa.reshape %15 {new_shape = array<i64: 16, 1>} : (tensor<16xf32>) -> tensor<16x1xf32>
    %19 = tosa.reshape %18 {new_shape = array<i64: 16, 1, 1>} : (tensor<16x1xf32>) -> tensor<16x1x1xf32>
    %20 = tosa.reshape %17 {new_shape = array<i64: 1, 16, 1, 1>} : (tensor<16x1x1xf32>) -> tensor<1x16x1x1xf32>
    %21 = tosa.sub %7, %20 : (tensor<1x16x112x112xf32>, tensor<1x16x1x1xf32>) -> tensor<1x16x112x112xf32>
    %22 = tosa.reshape %19 {new_shape = array<i64: 1, 16, 1, 1>} : (tensor<16x1x1xf32>) -> tensor<1x16x1x1xf32>
    %23 = tosa.mul %21, %22 {shift = 0 : i8} : (tensor<1x16x112x112xf32>, tensor<1x16x1x1xf32>) -> tensor<1x16x112x112xf32>
    %24 = tosa.reshape %arg4 {new_shape = array<i64: 16, 1>} : (tensor<16xf32>) -> tensor<16x1xf32>
    %25 = tosa.reshape %24 {new_shape = array<i64: 16, 1, 1>} : (tensor<16x1xf32>) -> tensor<16x1x1xf32>
    %26 = tosa.reshape %25 {new_shape = array<i64: 1, 16, 1, 1>} : (tensor<16x1x1xf32>) -> tensor<1x16x1x1xf32>
    %27 = tosa.mul %23, %26 {shift = 0 : i8} : (tensor<1x16x112x112xf32>, tensor<1x16x1x1xf32>) -> tensor<1x16x112x112xf32>
    %28 = tosa.reshape %arg5 {new_shape = array<i64: 16, 1>} : (tensor<16xf32>) -> tensor<16x1xf32>
    %29 = tosa.reshape %28 {new_shape = array<i64: 16, 1, 1>} : (tensor<16x1xf32>) -> tensor<16x1x1xf32>
    %30 = tosa.reshape %29 {new_shape = array<i64: 1, 16, 1, 1>} : (tensor<16x1x1xf32>) -> tensor<1x16x1x1xf32>
    %31 = tosa.add %27, %30 : (tensor<1x16x112x112xf32>, tensor<1x16x1x1xf32>) -> tensor<1x16x112x112xf32>
    %32 = "tosa.const"() <{value = dense<3.000000e+00> : tensor<1x16x112x112xf32>}> : () -> tensor<1x16x112x112xf32>
    %33 = tosa.add %31, %32 : (tensor<1x16x112x112xf32>, tensor<1x16x112x112xf32>) -> tensor<1x16x112x112xf32>
    %34 = tosa.clamp %33 {max_fp = 0x7F800000 : f32, max_int = 9223372036854775807 : i64, min_fp = 0.000000e+00 : f32, min_int = 0 : i64} : (tensor<1x16x112x112xf32>) -> tensor<1x16x112x112xf32>
    %35 = tosa.clamp %34 {max_fp = 6.000000e+00 : f32, max_int = 6 : i64, min_fp = 0xFF800000 : f32, min_int = -9223372036854775807 : i64} : (tensor<1x16x112x112xf32>) -> tensor<1x16x112x112xf32>
    %36 = tosa.mul %31, %35 {shift = 0 : i8} : (tensor<1x16x112x112xf32>, tensor<1x16x112x112xf32>) -> tensor<1x16x112x112xf32>
    %37 = "tosa.const"() <{value = dense<6.000000e+00> : tensor<1x16x112x112xf32>}> : () -> tensor<1x16x112x112xf32>
    %38 = tosa.reciprocal %37 : (tensor<1x16x112x112xf32>) -> tensor<1x16x112x112xf32>
    %39 = tosa.mul %36, %38 {shift = 0 : i8} : (tensor<1x16x112x112xf32>, tensor<1x16x112x112xf32>) -> tensor<1x16x112x112xf32>
    %40 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<16xf32>}> : () -> tensor<16xf32>
    %41 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %42 = tosa.transpose %39, %41 : (tensor<1x16x112x112xf32>, tensor<4xi32>) -> tensor<1x112x112x16xf32>
    %43 = "tosa.const"() <{value = dense<[2, 3, 0, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %44 = tosa.transpose %arg6, %43 : (tensor<16x1x3x3xf32>, tensor<4xi32>) -> tensor<3x3x16x1xf32>
    %45 = tosa.depthwise_conv2d %42, %44, %40 {dilation = array<i64: 1, 1>, pad = array<i64: 1, 1, 1, 1>, stride = array<i64: 2, 2>} : (tensor<1x112x112x16xf32>, tensor<3x3x16x1xf32>, tensor<16xf32>) -> tensor<1x56x56x16xf32>
    %46 = "tosa.const"() <{value = dense<[0, 3, 1, 2]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %47 = tosa.transpose %45, %46 : (tensor<1x56x56x16xf32>, tensor<4xi32>) -> tensor<1x16x56x56xf32>
    %48 = tosa.cast %arg7 : (tensor<16xf32>) -> tensor<16xf32>
    %49 = tosa.cast %arg8 : (tensor<16xf32>) -> tensor<16xf32>
    %50 = "tosa.const"() <{value = dense<1.000000e-03> : tensor<16xf32>}> : () -> tensor<16xf32>
    %51 = tosa.add %49, %50 : (tensor<16xf32>, tensor<16xf32>) -> tensor<16xf32>
    %52 = math.sqrt %51 : tensor<16xf32>
    %53 = tosa.reciprocal %52 : (tensor<16xf32>) -> tensor<16xf32>
    %54 = "tosa.const"() <{value = dense<1.000000e+00> : tensor<16xf32>}> : () -> tensor<16xf32>
    %55 = tosa.mul %53, %54 {shift = 0 : i8} : (tensor<16xf32>, tensor<16xf32>) -> tensor<16xf32>
    %56 = tosa.reshape %48 {new_shape = array<i64: 16, 1>} : (tensor<16xf32>) -> tensor<16x1xf32>
    %57 = tosa.reshape %56 {new_shape = array<i64: 16, 1, 1>} : (tensor<16x1xf32>) -> tensor<16x1x1xf32>
    %58 = tosa.reshape %55 {new_shape = array<i64: 16, 1>} : (tensor<16xf32>) -> tensor<16x1xf32>
    %59 = tosa.reshape %58 {new_shape = array<i64: 16, 1, 1>} : (tensor<16x1xf32>) -> tensor<16x1x1xf32>
    %60 = tosa.reshape %57 {new_shape = array<i64: 1, 16, 1, 1>} : (tensor<16x1x1xf32>) -> tensor<1x16x1x1xf32>
    %61 = tosa.sub %47, %60 : (tensor<1x16x56x56xf32>, tensor<1x16x1x1xf32>) -> tensor<1x16x56x56xf32>
    %62 = tosa.reshape %59 {new_shape = array<i64: 1, 16, 1, 1>} : (tensor<16x1x1xf32>) -> tensor<1x16x1x1xf32>
    %63 = tosa.mul %61, %62 {shift = 0 : i8} : (tensor<1x16x56x56xf32>, tensor<1x16x1x1xf32>) -> tensor<1x16x56x56xf32>
    %64 = tosa.reshape %arg9 {new_shape = array<i64: 16, 1>} : (tensor<16xf32>) -> tensor<16x1xf32>
    %65 = tosa.reshape %64 {new_shape = array<i64: 16, 1, 1>} : (tensor<16x1xf32>) -> tensor<16x1x1xf32>
    %66 = tosa.reshape %65 {new_shape = array<i64: 1, 16, 1, 1>} : (tensor<16x1x1xf32>) -> tensor<1x16x1x1xf32>
    %67 = tosa.mul %63, %66 {shift = 0 : i8} : (tensor<1x16x56x56xf32>, tensor<1x16x1x1xf32>) -> tensor<1x16x56x56xf32>
    %68 = tosa.reshape %arg10 {new_shape = array<i64: 16, 1>} : (tensor<16xf32>) -> tensor<16x1xf32>
    %69 = tosa.reshape %68 {new_shape = array<i64: 16, 1, 1>} : (tensor<16x1xf32>) -> tensor<16x1x1xf32>
    %70 = tosa.reshape %69 {new_shape = array<i64: 1, 16, 1, 1>} : (tensor<16x1x1xf32>) -> tensor<1x16x1x1xf32>
    %71 = tosa.add %67, %70 : (tensor<1x16x56x56xf32>, tensor<1x16x1x1xf32>) -> tensor<1x16x56x56xf32>
    %72 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<1x16x56x56xf32>}> : () -> tensor<1x16x56x56xf32>
    %73 = tosa.maximum %71, %72 : (tensor<1x16x56x56xf32>, tensor<1x16x56x56xf32>) -> tensor<1x16x56x56xf32>
    %74 = tosa.reduce_sum %73 {axis = 3 : i32} : (tensor<1x16x56x56xf32>) -> tensor<1x16x56x1xf32>
    %75 = tosa.reduce_sum %74 {axis = 2 : i32} : (tensor<1x16x56x1xf32>) -> tensor<1x16x1x1xf32>
    %76 = "tosa.const"() <{value = dense<3.136000e+03> : tensor<1xf32>}> : () -> tensor<1xf32>
    %77 = tosa.reciprocal %76 : (tensor<1xf32>) -> tensor<1xf32>
    %78 = tosa.mul %77, %75 {shift = 0 : i8} : (tensor<1xf32>, tensor<1x16x1x1xf32>) -> tensor<1x16x1x1xf32>
    %79 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %80 = tosa.transpose %78, %79 : (tensor<1x16x1x1xf32>, tensor<4xi32>) -> tensor<1x1x1x16xf32>
    %81 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %82 = tosa.transpose %arg11, %81 : (tensor<8x16x1x1xf32>, tensor<4xi32>) -> tensor<8x1x1x16xf32>
    %83 = tosa.conv2d %80, %82, %arg12 {dilation = array<i64: 1, 1>, pad = array<i64: 0, 0, 0, 0>, stride = array<i64: 1, 1>} : (tensor<1x1x1x16xf32>, tensor<8x1x1x16xf32>, tensor<8xf32>) -> tensor<1x1x1x8xf32>
    %84 = "tosa.const"() <{value = dense<[0, 3, 1, 2]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %85 = tosa.transpose %83, %84 : (tensor<1x1x1x8xf32>, tensor<4xi32>) -> tensor<1x8x1x1xf32>
    %86 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<1x8x1x1xf32>}> : () -> tensor<1x8x1x1xf32>
    %87 = tosa.maximum %85, %86 : (tensor<1x8x1x1xf32>, tensor<1x8x1x1xf32>) -> tensor<1x8x1x1xf32>
    %88 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %89 = tosa.transpose %87, %88 : (tensor<1x8x1x1xf32>, tensor<4xi32>) -> tensor<1x1x1x8xf32>
    %90 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %91 = tosa.transpose %arg13, %90 : (tensor<16x8x1x1xf32>, tensor<4xi32>) -> tensor<16x1x1x8xf32>
    %92 = tosa.conv2d %89, %91, %arg14 {dilation = array<i64: 1, 1>, pad = array<i64: 0, 0, 0, 0>, stride = array<i64: 1, 1>} : (tensor<1x1x1x8xf32>, tensor<16x1x1x8xf32>, tensor<16xf32>) -> tensor<1x1x1x16xf32>
    %93 = "tosa.const"() <{value = dense<[0, 3, 1, 2]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %94 = tosa.transpose %92, %93 : (tensor<1x1x1x16xf32>, tensor<4xi32>) -> tensor<1x16x1x1xf32>
    %95 = "tosa.const"() <{value = dense<3.000000e+00> : tensor<1x16x1x1xf32>}> : () -> tensor<1x16x1x1xf32>
    %96 = tosa.add %94, %95 : (tensor<1x16x1x1xf32>, tensor<1x16x1x1xf32>) -> tensor<1x16x1x1xf32>
    %97 = tosa.clamp %96 {max_fp = 0x7F800000 : f32, max_int = 9223372036854775807 : i64, min_fp = 0.000000e+00 : f32, min_int = 0 : i64} : (tensor<1x16x1x1xf32>) -> tensor<1x16x1x1xf32>
    %98 = tosa.clamp %97 {max_fp = 6.000000e+00 : f32, max_int = 6 : i64, min_fp = 0xFF800000 : f32, min_int = -9223372036854775807 : i64} : (tensor<1x16x1x1xf32>) -> tensor<1x16x1x1xf32>
    %99 = "tosa.const"() <{value = dense<6.000000e+00> : tensor<1x16x1x1xf32>}> : () -> tensor<1x16x1x1xf32>
    %100 = tosa.reciprocal %99 : (tensor<1x16x1x1xf32>) -> tensor<1x16x1x1xf32>
    %101 = tosa.mul %98, %100 {shift = 0 : i8} : (tensor<1x16x1x1xf32>, tensor<1x16x1x1xf32>) -> tensor<1x16x1x1xf32>
    %102 = tosa.mul %101, %73 {shift = 0 : i8} : (tensor<1x16x1x1xf32>, tensor<1x16x56x56xf32>) -> tensor<1x16x56x56xf32>
    %103 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<16xf32>}> : () -> tensor<16xf32>
    %104 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %105 = tosa.transpose %102, %104 : (tensor<1x16x56x56xf32>, tensor<4xi32>) -> tensor<1x56x56x16xf32>
    %106 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %107 = tosa.transpose %arg15, %106 : (tensor<16x16x1x1xf32>, tensor<4xi32>) -> tensor<16x1x1x16xf32>
    %108 = tosa.conv2d %105, %107, %103 {dilation = array<i64: 1, 1>, pad = array<i64: 0, 0, 0, 0>, stride = array<i64: 1, 1>} : (tensor<1x56x56x16xf32>, tensor<16x1x1x16xf32>, tensor<16xf32>) -> tensor<1x56x56x16xf32>
    %109 = "tosa.const"() <{value = dense<[0, 3, 1, 2]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %110 = tosa.transpose %108, %109 : (tensor<1x56x56x16xf32>, tensor<4xi32>) -> tensor<1x16x56x56xf32>
    %111 = tosa.cast %arg16 : (tensor<16xf32>) -> tensor<16xf32>
    %112 = tosa.cast %arg17 : (tensor<16xf32>) -> tensor<16xf32>
    %113 = "tosa.const"() <{value = dense<1.000000e-03> : tensor<16xf32>}> : () -> tensor<16xf32>
    %114 = tosa.add %112, %113 : (tensor<16xf32>, tensor<16xf32>) -> tensor<16xf32>
    %115 = math.sqrt %114 : tensor<16xf32>
    %116 = tosa.reciprocal %115 : (tensor<16xf32>) -> tensor<16xf32>
    %117 = "tosa.const"() <{value = dense<1.000000e+00> : tensor<16xf32>}> : () -> tensor<16xf32>
    %118 = tosa.mul %116, %117 {shift = 0 : i8} : (tensor<16xf32>, tensor<16xf32>) -> tensor<16xf32>
    %119 = tosa.reshape %111 {new_shape = array<i64: 16, 1>} : (tensor<16xf32>) -> tensor<16x1xf32>
    %120 = tosa.reshape %119 {new_shape = array<i64: 16, 1, 1>} : (tensor<16x1xf32>) -> tensor<16x1x1xf32>
    %121 = tosa.reshape %118 {new_shape = array<i64: 16, 1>} : (tensor<16xf32>) -> tensor<16x1xf32>
    %122 = tosa.reshape %121 {new_shape = array<i64: 16, 1, 1>} : (tensor<16x1xf32>) -> tensor<16x1x1xf32>
    %123 = tosa.reshape %120 {new_shape = array<i64: 1, 16, 1, 1>} : (tensor<16x1x1xf32>) -> tensor<1x16x1x1xf32>
    %124 = tosa.sub %110, %123 : (tensor<1x16x56x56xf32>, tensor<1x16x1x1xf32>) -> tensor<1x16x56x56xf32>
    %125 = tosa.reshape %122 {new_shape = array<i64: 1, 16, 1, 1>} : (tensor<16x1x1xf32>) -> tensor<1x16x1x1xf32>
    %126 = tosa.mul %124, %125 {shift = 0 : i8} : (tensor<1x16x56x56xf32>, tensor<1x16x1x1xf32>) -> tensor<1x16x56x56xf32>
    %127 = tosa.reshape %arg18 {new_shape = array<i64: 16, 1>} : (tensor<16xf32>) -> tensor<16x1xf32>
    %128 = tosa.reshape %127 {new_shape = array<i64: 16, 1, 1>} : (tensor<16x1xf32>) -> tensor<16x1x1xf32>
    %129 = tosa.reshape %128 {new_shape = array<i64: 1, 16, 1, 1>} : (tensor<16x1x1xf32>) -> tensor<1x16x1x1xf32>
    %130 = tosa.mul %126, %129 {shift = 0 : i8} : (tensor<1x16x56x56xf32>, tensor<1x16x1x1xf32>) -> tensor<1x16x56x56xf32>
    %131 = tosa.reshape %arg19 {new_shape = array<i64: 16, 1>} : (tensor<16xf32>) -> tensor<16x1xf32>
    %132 = tosa.reshape %131 {new_shape = array<i64: 16, 1, 1>} : (tensor<16x1xf32>) -> tensor<16x1x1xf32>
    %133 = tosa.reshape %132 {new_shape = array<i64: 1, 16, 1, 1>} : (tensor<16x1x1xf32>) -> tensor<1x16x1x1xf32>
    %134 = tosa.add %130, %133 : (tensor<1x16x56x56xf32>, tensor<1x16x1x1xf32>) -> tensor<1x16x56x56xf32>
    %135 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<72xf32>}> : () -> tensor<72xf32>
    %136 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %137 = tosa.transpose %134, %136 : (tensor<1x16x56x56xf32>, tensor<4xi32>) -> tensor<1x56x56x16xf32>
    %138 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %139 = tosa.transpose %arg20, %138 : (tensor<72x16x1x1xf32>, tensor<4xi32>) -> tensor<72x1x1x16xf32>
    %140 = tosa.conv2d %137, %139, %135 {dilation = array<i64: 1, 1>, pad = array<i64: 0, 0, 0, 0>, stride = array<i64: 1, 1>} : (tensor<1x56x56x16xf32>, tensor<72x1x1x16xf32>, tensor<72xf32>) -> tensor<1x56x56x72xf32>
    %141 = "tosa.const"() <{value = dense<[0, 3, 1, 2]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %142 = tosa.transpose %140, %141 : (tensor<1x56x56x72xf32>, tensor<4xi32>) -> tensor<1x72x56x56xf32>
    %143 = tosa.cast %arg21 : (tensor<72xf32>) -> tensor<72xf32>
    %144 = tosa.cast %arg22 : (tensor<72xf32>) -> tensor<72xf32>
    %145 = "tosa.const"() <{value = dense<1.000000e-03> : tensor<72xf32>}> : () -> tensor<72xf32>
    %146 = tosa.add %144, %145 : (tensor<72xf32>, tensor<72xf32>) -> tensor<72xf32>
    %147 = math.sqrt %146 : tensor<72xf32>
    %148 = tosa.reciprocal %147 : (tensor<72xf32>) -> tensor<72xf32>
    %149 = "tosa.const"() <{value = dense<1.000000e+00> : tensor<72xf32>}> : () -> tensor<72xf32>
    %150 = tosa.mul %148, %149 {shift = 0 : i8} : (tensor<72xf32>, tensor<72xf32>) -> tensor<72xf32>
    %151 = tosa.reshape %143 {new_shape = array<i64: 72, 1>} : (tensor<72xf32>) -> tensor<72x1xf32>
    %152 = tosa.reshape %151 {new_shape = array<i64: 72, 1, 1>} : (tensor<72x1xf32>) -> tensor<72x1x1xf32>
    %153 = tosa.reshape %150 {new_shape = array<i64: 72, 1>} : (tensor<72xf32>) -> tensor<72x1xf32>
    %154 = tosa.reshape %153 {new_shape = array<i64: 72, 1, 1>} : (tensor<72x1xf32>) -> tensor<72x1x1xf32>
    %155 = tosa.reshape %152 {new_shape = array<i64: 1, 72, 1, 1>} : (tensor<72x1x1xf32>) -> tensor<1x72x1x1xf32>
    %156 = tosa.sub %142, %155 : (tensor<1x72x56x56xf32>, tensor<1x72x1x1xf32>) -> tensor<1x72x56x56xf32>
    %157 = tosa.reshape %154 {new_shape = array<i64: 1, 72, 1, 1>} : (tensor<72x1x1xf32>) -> tensor<1x72x1x1xf32>
    %158 = tosa.mul %156, %157 {shift = 0 : i8} : (tensor<1x72x56x56xf32>, tensor<1x72x1x1xf32>) -> tensor<1x72x56x56xf32>
    %159 = tosa.reshape %arg23 {new_shape = array<i64: 72, 1>} : (tensor<72xf32>) -> tensor<72x1xf32>
    %160 = tosa.reshape %159 {new_shape = array<i64: 72, 1, 1>} : (tensor<72x1xf32>) -> tensor<72x1x1xf32>
    %161 = tosa.reshape %160 {new_shape = array<i64: 1, 72, 1, 1>} : (tensor<72x1x1xf32>) -> tensor<1x72x1x1xf32>
    %162 = tosa.mul %158, %161 {shift = 0 : i8} : (tensor<1x72x56x56xf32>, tensor<1x72x1x1xf32>) -> tensor<1x72x56x56xf32>
    %163 = tosa.reshape %arg24 {new_shape = array<i64: 72, 1>} : (tensor<72xf32>) -> tensor<72x1xf32>
    %164 = tosa.reshape %163 {new_shape = array<i64: 72, 1, 1>} : (tensor<72x1xf32>) -> tensor<72x1x1xf32>
    %165 = tosa.reshape %164 {new_shape = array<i64: 1, 72, 1, 1>} : (tensor<72x1x1xf32>) -> tensor<1x72x1x1xf32>
    %166 = tosa.add %162, %165 : (tensor<1x72x56x56xf32>, tensor<1x72x1x1xf32>) -> tensor<1x72x56x56xf32>
    %167 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<1x72x56x56xf32>}> : () -> tensor<1x72x56x56xf32>
    %168 = tosa.maximum %166, %167 : (tensor<1x72x56x56xf32>, tensor<1x72x56x56xf32>) -> tensor<1x72x56x56xf32>
    %169 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<72xf32>}> : () -> tensor<72xf32>
    %170 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %171 = tosa.transpose %168, %170 : (tensor<1x72x56x56xf32>, tensor<4xi32>) -> tensor<1x56x56x72xf32>
    %172 = "tosa.const"() <{value = dense<[2, 3, 0, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %173 = tosa.transpose %arg25, %172 : (tensor<72x1x3x3xf32>, tensor<4xi32>) -> tensor<3x3x72x1xf32>
    %174 = tosa.depthwise_conv2d %171, %173, %169 {dilation = array<i64: 1, 1>, pad = array<i64: 1, 1, 1, 1>, stride = array<i64: 2, 2>} : (tensor<1x56x56x72xf32>, tensor<3x3x72x1xf32>, tensor<72xf32>) -> tensor<1x28x28x72xf32>
    %175 = "tosa.const"() <{value = dense<[0, 3, 1, 2]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %176 = tosa.transpose %174, %175 : (tensor<1x28x28x72xf32>, tensor<4xi32>) -> tensor<1x72x28x28xf32>
    %177 = tosa.cast %arg26 : (tensor<72xf32>) -> tensor<72xf32>
    %178 = tosa.cast %arg27 : (tensor<72xf32>) -> tensor<72xf32>
    %179 = "tosa.const"() <{value = dense<1.000000e-03> : tensor<72xf32>}> : () -> tensor<72xf32>
    %180 = tosa.add %178, %179 : (tensor<72xf32>, tensor<72xf32>) -> tensor<72xf32>
    %181 = math.sqrt %180 : tensor<72xf32>
    %182 = tosa.reciprocal %181 : (tensor<72xf32>) -> tensor<72xf32>
    %183 = "tosa.const"() <{value = dense<1.000000e+00> : tensor<72xf32>}> : () -> tensor<72xf32>
    %184 = tosa.mul %182, %183 {shift = 0 : i8} : (tensor<72xf32>, tensor<72xf32>) -> tensor<72xf32>
    %185 = tosa.reshape %177 {new_shape = array<i64: 72, 1>} : (tensor<72xf32>) -> tensor<72x1xf32>
    %186 = tosa.reshape %185 {new_shape = array<i64: 72, 1, 1>} : (tensor<72x1xf32>) -> tensor<72x1x1xf32>
    %187 = tosa.reshape %184 {new_shape = array<i64: 72, 1>} : (tensor<72xf32>) -> tensor<72x1xf32>
    %188 = tosa.reshape %187 {new_shape = array<i64: 72, 1, 1>} : (tensor<72x1xf32>) -> tensor<72x1x1xf32>
    %189 = tosa.reshape %186 {new_shape = array<i64: 1, 72, 1, 1>} : (tensor<72x1x1xf32>) -> tensor<1x72x1x1xf32>
    %190 = tosa.sub %176, %189 : (tensor<1x72x28x28xf32>, tensor<1x72x1x1xf32>) -> tensor<1x72x28x28xf32>
    %191 = tosa.reshape %188 {new_shape = array<i64: 1, 72, 1, 1>} : (tensor<72x1x1xf32>) -> tensor<1x72x1x1xf32>
    %192 = tosa.mul %190, %191 {shift = 0 : i8} : (tensor<1x72x28x28xf32>, tensor<1x72x1x1xf32>) -> tensor<1x72x28x28xf32>
    %193 = tosa.reshape %arg28 {new_shape = array<i64: 72, 1>} : (tensor<72xf32>) -> tensor<72x1xf32>
    %194 = tosa.reshape %193 {new_shape = array<i64: 72, 1, 1>} : (tensor<72x1xf32>) -> tensor<72x1x1xf32>
    %195 = tosa.reshape %194 {new_shape = array<i64: 1, 72, 1, 1>} : (tensor<72x1x1xf32>) -> tensor<1x72x1x1xf32>
    %196 = tosa.mul %192, %195 {shift = 0 : i8} : (tensor<1x72x28x28xf32>, tensor<1x72x1x1xf32>) -> tensor<1x72x28x28xf32>
    %197 = tosa.reshape %arg29 {new_shape = array<i64: 72, 1>} : (tensor<72xf32>) -> tensor<72x1xf32>
    %198 = tosa.reshape %197 {new_shape = array<i64: 72, 1, 1>} : (tensor<72x1xf32>) -> tensor<72x1x1xf32>
    %199 = tosa.reshape %198 {new_shape = array<i64: 1, 72, 1, 1>} : (tensor<72x1x1xf32>) -> tensor<1x72x1x1xf32>
    %200 = tosa.add %196, %199 : (tensor<1x72x28x28xf32>, tensor<1x72x1x1xf32>) -> tensor<1x72x28x28xf32>
    %201 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<1x72x28x28xf32>}> : () -> tensor<1x72x28x28xf32>
    %202 = tosa.maximum %200, %201 : (tensor<1x72x28x28xf32>, tensor<1x72x28x28xf32>) -> tensor<1x72x28x28xf32>
    %203 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<24xf32>}> : () -> tensor<24xf32>
    %204 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %205 = tosa.transpose %202, %204 : (tensor<1x72x28x28xf32>, tensor<4xi32>) -> tensor<1x28x28x72xf32>
    %206 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %207 = tosa.transpose %arg30, %206 : (tensor<24x72x1x1xf32>, tensor<4xi32>) -> tensor<24x1x1x72xf32>
    %208 = tosa.conv2d %205, %207, %203 {dilation = array<i64: 1, 1>, pad = array<i64: 0, 0, 0, 0>, stride = array<i64: 1, 1>} : (tensor<1x28x28x72xf32>, tensor<24x1x1x72xf32>, tensor<24xf32>) -> tensor<1x28x28x24xf32>
    %209 = "tosa.const"() <{value = dense<[0, 3, 1, 2]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %210 = tosa.transpose %208, %209 : (tensor<1x28x28x24xf32>, tensor<4xi32>) -> tensor<1x24x28x28xf32>
    %211 = tosa.cast %arg31 : (tensor<24xf32>) -> tensor<24xf32>
    %212 = tosa.cast %arg32 : (tensor<24xf32>) -> tensor<24xf32>
    %213 = "tosa.const"() <{value = dense<1.000000e-03> : tensor<24xf32>}> : () -> tensor<24xf32>
    %214 = tosa.add %212, %213 : (tensor<24xf32>, tensor<24xf32>) -> tensor<24xf32>
    %215 = math.sqrt %214 : tensor<24xf32>
    %216 = tosa.reciprocal %215 : (tensor<24xf32>) -> tensor<24xf32>
    %217 = "tosa.const"() <{value = dense<1.000000e+00> : tensor<24xf32>}> : () -> tensor<24xf32>
    %218 = tosa.mul %216, %217 {shift = 0 : i8} : (tensor<24xf32>, tensor<24xf32>) -> tensor<24xf32>
    %219 = tosa.reshape %211 {new_shape = array<i64: 24, 1>} : (tensor<24xf32>) -> tensor<24x1xf32>
    %220 = tosa.reshape %219 {new_shape = array<i64: 24, 1, 1>} : (tensor<24x1xf32>) -> tensor<24x1x1xf32>
    %221 = tosa.reshape %218 {new_shape = array<i64: 24, 1>} : (tensor<24xf32>) -> tensor<24x1xf32>
    %222 = tosa.reshape %221 {new_shape = array<i64: 24, 1, 1>} : (tensor<24x1xf32>) -> tensor<24x1x1xf32>
    %223 = tosa.reshape %220 {new_shape = array<i64: 1, 24, 1, 1>} : (tensor<24x1x1xf32>) -> tensor<1x24x1x1xf32>
    %224 = tosa.sub %210, %223 : (tensor<1x24x28x28xf32>, tensor<1x24x1x1xf32>) -> tensor<1x24x28x28xf32>
    %225 = tosa.reshape %222 {new_shape = array<i64: 1, 24, 1, 1>} : (tensor<24x1x1xf32>) -> tensor<1x24x1x1xf32>
    %226 = tosa.mul %224, %225 {shift = 0 : i8} : (tensor<1x24x28x28xf32>, tensor<1x24x1x1xf32>) -> tensor<1x24x28x28xf32>
    %227 = tosa.reshape %arg33 {new_shape = array<i64: 24, 1>} : (tensor<24xf32>) -> tensor<24x1xf32>
    %228 = tosa.reshape %227 {new_shape = array<i64: 24, 1, 1>} : (tensor<24x1xf32>) -> tensor<24x1x1xf32>
    %229 = tosa.reshape %228 {new_shape = array<i64: 1, 24, 1, 1>} : (tensor<24x1x1xf32>) -> tensor<1x24x1x1xf32>
    %230 = tosa.mul %226, %229 {shift = 0 : i8} : (tensor<1x24x28x28xf32>, tensor<1x24x1x1xf32>) -> tensor<1x24x28x28xf32>
    %231 = tosa.reshape %arg34 {new_shape = array<i64: 24, 1>} : (tensor<24xf32>) -> tensor<24x1xf32>
    %232 = tosa.reshape %231 {new_shape = array<i64: 24, 1, 1>} : (tensor<24x1xf32>) -> tensor<24x1x1xf32>
    %233 = tosa.reshape %232 {new_shape = array<i64: 1, 24, 1, 1>} : (tensor<24x1x1xf32>) -> tensor<1x24x1x1xf32>
    %234 = tosa.add %230, %233 : (tensor<1x24x28x28xf32>, tensor<1x24x1x1xf32>) -> tensor<1x24x28x28xf32>
    %235 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<88xf32>}> : () -> tensor<88xf32>
    %236 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %237 = tosa.transpose %234, %236 : (tensor<1x24x28x28xf32>, tensor<4xi32>) -> tensor<1x28x28x24xf32>
    %238 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %239 = tosa.transpose %arg35, %238 : (tensor<88x24x1x1xf32>, tensor<4xi32>) -> tensor<88x1x1x24xf32>
    %240 = tosa.conv2d %237, %239, %235 {dilation = array<i64: 1, 1>, pad = array<i64: 0, 0, 0, 0>, stride = array<i64: 1, 1>} : (tensor<1x28x28x24xf32>, tensor<88x1x1x24xf32>, tensor<88xf32>) -> tensor<1x28x28x88xf32>
    %241 = "tosa.const"() <{value = dense<[0, 3, 1, 2]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %242 = tosa.transpose %240, %241 : (tensor<1x28x28x88xf32>, tensor<4xi32>) -> tensor<1x88x28x28xf32>
    %243 = tosa.cast %arg36 : (tensor<88xf32>) -> tensor<88xf32>
    %244 = tosa.cast %arg37 : (tensor<88xf32>) -> tensor<88xf32>
    %245 = "tosa.const"() <{value = dense<1.000000e-03> : tensor<88xf32>}> : () -> tensor<88xf32>
    %246 = tosa.add %244, %245 : (tensor<88xf32>, tensor<88xf32>) -> tensor<88xf32>
    %247 = math.sqrt %246 : tensor<88xf32>
    %248 = tosa.reciprocal %247 : (tensor<88xf32>) -> tensor<88xf32>
    %249 = "tosa.const"() <{value = dense<1.000000e+00> : tensor<88xf32>}> : () -> tensor<88xf32>
    %250 = tosa.mul %248, %249 {shift = 0 : i8} : (tensor<88xf32>, tensor<88xf32>) -> tensor<88xf32>
    %251 = tosa.reshape %243 {new_shape = array<i64: 88, 1>} : (tensor<88xf32>) -> tensor<88x1xf32>
    %252 = tosa.reshape %251 {new_shape = array<i64: 88, 1, 1>} : (tensor<88x1xf32>) -> tensor<88x1x1xf32>
    %253 = tosa.reshape %250 {new_shape = array<i64: 88, 1>} : (tensor<88xf32>) -> tensor<88x1xf32>
    %254 = tosa.reshape %253 {new_shape = array<i64: 88, 1, 1>} : (tensor<88x1xf32>) -> tensor<88x1x1xf32>
    %255 = tosa.reshape %252 {new_shape = array<i64: 1, 88, 1, 1>} : (tensor<88x1x1xf32>) -> tensor<1x88x1x1xf32>
    %256 = tosa.sub %242, %255 : (tensor<1x88x28x28xf32>, tensor<1x88x1x1xf32>) -> tensor<1x88x28x28xf32>
    %257 = tosa.reshape %254 {new_shape = array<i64: 1, 88, 1, 1>} : (tensor<88x1x1xf32>) -> tensor<1x88x1x1xf32>
    %258 = tosa.mul %256, %257 {shift = 0 : i8} : (tensor<1x88x28x28xf32>, tensor<1x88x1x1xf32>) -> tensor<1x88x28x28xf32>
    %259 = tosa.reshape %arg38 {new_shape = array<i64: 88, 1>} : (tensor<88xf32>) -> tensor<88x1xf32>
    %260 = tosa.reshape %259 {new_shape = array<i64: 88, 1, 1>} : (tensor<88x1xf32>) -> tensor<88x1x1xf32>
    %261 = tosa.reshape %260 {new_shape = array<i64: 1, 88, 1, 1>} : (tensor<88x1x1xf32>) -> tensor<1x88x1x1xf32>
    %262 = tosa.mul %258, %261 {shift = 0 : i8} : (tensor<1x88x28x28xf32>, tensor<1x88x1x1xf32>) -> tensor<1x88x28x28xf32>
    %263 = tosa.reshape %arg39 {new_shape = array<i64: 88, 1>} : (tensor<88xf32>) -> tensor<88x1xf32>
    %264 = tosa.reshape %263 {new_shape = array<i64: 88, 1, 1>} : (tensor<88x1xf32>) -> tensor<88x1x1xf32>
    %265 = tosa.reshape %264 {new_shape = array<i64: 1, 88, 1, 1>} : (tensor<88x1x1xf32>) -> tensor<1x88x1x1xf32>
    %266 = tosa.add %262, %265 : (tensor<1x88x28x28xf32>, tensor<1x88x1x1xf32>) -> tensor<1x88x28x28xf32>
    %267 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<1x88x28x28xf32>}> : () -> tensor<1x88x28x28xf32>
    %268 = tosa.maximum %266, %267 : (tensor<1x88x28x28xf32>, tensor<1x88x28x28xf32>) -> tensor<1x88x28x28xf32>
    %269 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<88xf32>}> : () -> tensor<88xf32>
    %270 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %271 = tosa.transpose %268, %270 : (tensor<1x88x28x28xf32>, tensor<4xi32>) -> tensor<1x28x28x88xf32>
    %272 = "tosa.const"() <{value = dense<[2, 3, 0, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %273 = tosa.transpose %arg40, %272 : (tensor<88x1x3x3xf32>, tensor<4xi32>) -> tensor<3x3x88x1xf32>
    %274 = tosa.depthwise_conv2d %271, %273, %269 {dilation = array<i64: 1, 1>, pad = array<i64: 1, 1, 1, 1>, stride = array<i64: 1, 1>} : (tensor<1x28x28x88xf32>, tensor<3x3x88x1xf32>, tensor<88xf32>) -> tensor<1x28x28x88xf32>
    %275 = "tosa.const"() <{value = dense<[0, 3, 1, 2]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %276 = tosa.transpose %274, %275 : (tensor<1x28x28x88xf32>, tensor<4xi32>) -> tensor<1x88x28x28xf32>
    %277 = tosa.cast %arg41 : (tensor<88xf32>) -> tensor<88xf32>
    %278 = tosa.cast %arg42 : (tensor<88xf32>) -> tensor<88xf32>
    %279 = "tosa.const"() <{value = dense<1.000000e-03> : tensor<88xf32>}> : () -> tensor<88xf32>
    %280 = tosa.add %278, %279 : (tensor<88xf32>, tensor<88xf32>) -> tensor<88xf32>
    %281 = math.sqrt %280 : tensor<88xf32>
    %282 = tosa.reciprocal %281 : (tensor<88xf32>) -> tensor<88xf32>
    %283 = "tosa.const"() <{value = dense<1.000000e+00> : tensor<88xf32>}> : () -> tensor<88xf32>
    %284 = tosa.mul %282, %283 {shift = 0 : i8} : (tensor<88xf32>, tensor<88xf32>) -> tensor<88xf32>
    %285 = tosa.reshape %277 {new_shape = array<i64: 88, 1>} : (tensor<88xf32>) -> tensor<88x1xf32>
    %286 = tosa.reshape %285 {new_shape = array<i64: 88, 1, 1>} : (tensor<88x1xf32>) -> tensor<88x1x1xf32>
    %287 = tosa.reshape %284 {new_shape = array<i64: 88, 1>} : (tensor<88xf32>) -> tensor<88x1xf32>
    %288 = tosa.reshape %287 {new_shape = array<i64: 88, 1, 1>} : (tensor<88x1xf32>) -> tensor<88x1x1xf32>
    %289 = tosa.reshape %286 {new_shape = array<i64: 1, 88, 1, 1>} : (tensor<88x1x1xf32>) -> tensor<1x88x1x1xf32>
    %290 = tosa.sub %276, %289 : (tensor<1x88x28x28xf32>, tensor<1x88x1x1xf32>) -> tensor<1x88x28x28xf32>
    %291 = tosa.reshape %288 {new_shape = array<i64: 1, 88, 1, 1>} : (tensor<88x1x1xf32>) -> tensor<1x88x1x1xf32>
    %292 = tosa.mul %290, %291 {shift = 0 : i8} : (tensor<1x88x28x28xf32>, tensor<1x88x1x1xf32>) -> tensor<1x88x28x28xf32>
    %293 = tosa.reshape %arg43 {new_shape = array<i64: 88, 1>} : (tensor<88xf32>) -> tensor<88x1xf32>
    %294 = tosa.reshape %293 {new_shape = array<i64: 88, 1, 1>} : (tensor<88x1xf32>) -> tensor<88x1x1xf32>
    %295 = tosa.reshape %294 {new_shape = array<i64: 1, 88, 1, 1>} : (tensor<88x1x1xf32>) -> tensor<1x88x1x1xf32>
    %296 = tosa.mul %292, %295 {shift = 0 : i8} : (tensor<1x88x28x28xf32>, tensor<1x88x1x1xf32>) -> tensor<1x88x28x28xf32>
    %297 = tosa.reshape %arg44 {new_shape = array<i64: 88, 1>} : (tensor<88xf32>) -> tensor<88x1xf32>
    %298 = tosa.reshape %297 {new_shape = array<i64: 88, 1, 1>} : (tensor<88x1xf32>) -> tensor<88x1x1xf32>
    %299 = tosa.reshape %298 {new_shape = array<i64: 1, 88, 1, 1>} : (tensor<88x1x1xf32>) -> tensor<1x88x1x1xf32>
    %300 = tosa.add %296, %299 : (tensor<1x88x28x28xf32>, tensor<1x88x1x1xf32>) -> tensor<1x88x28x28xf32>
    %301 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<1x88x28x28xf32>}> : () -> tensor<1x88x28x28xf32>
    %302 = tosa.maximum %300, %301 : (tensor<1x88x28x28xf32>, tensor<1x88x28x28xf32>) -> tensor<1x88x28x28xf32>
    %303 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<24xf32>}> : () -> tensor<24xf32>
    %304 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %305 = tosa.transpose %302, %304 : (tensor<1x88x28x28xf32>, tensor<4xi32>) -> tensor<1x28x28x88xf32>
    %306 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %307 = tosa.transpose %arg45, %306 : (tensor<24x88x1x1xf32>, tensor<4xi32>) -> tensor<24x1x1x88xf32>
    %308 = tosa.conv2d %305, %307, %303 {dilation = array<i64: 1, 1>, pad = array<i64: 0, 0, 0, 0>, stride = array<i64: 1, 1>} : (tensor<1x28x28x88xf32>, tensor<24x1x1x88xf32>, tensor<24xf32>) -> tensor<1x28x28x24xf32>
    %309 = "tosa.const"() <{value = dense<[0, 3, 1, 2]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %310 = tosa.transpose %308, %309 : (tensor<1x28x28x24xf32>, tensor<4xi32>) -> tensor<1x24x28x28xf32>
    %311 = tosa.cast %arg46 : (tensor<24xf32>) -> tensor<24xf32>
    %312 = tosa.cast %arg47 : (tensor<24xf32>) -> tensor<24xf32>
    %313 = "tosa.const"() <{value = dense<1.000000e-03> : tensor<24xf32>}> : () -> tensor<24xf32>
    %314 = tosa.add %312, %313 : (tensor<24xf32>, tensor<24xf32>) -> tensor<24xf32>
    %315 = math.sqrt %314 : tensor<24xf32>
    %316 = tosa.reciprocal %315 : (tensor<24xf32>) -> tensor<24xf32>
    %317 = "tosa.const"() <{value = dense<1.000000e+00> : tensor<24xf32>}> : () -> tensor<24xf32>
    %318 = tosa.mul %316, %317 {shift = 0 : i8} : (tensor<24xf32>, tensor<24xf32>) -> tensor<24xf32>
    %319 = tosa.reshape %311 {new_shape = array<i64: 24, 1>} : (tensor<24xf32>) -> tensor<24x1xf32>
    %320 = tosa.reshape %319 {new_shape = array<i64: 24, 1, 1>} : (tensor<24x1xf32>) -> tensor<24x1x1xf32>
    %321 = tosa.reshape %318 {new_shape = array<i64: 24, 1>} : (tensor<24xf32>) -> tensor<24x1xf32>
    %322 = tosa.reshape %321 {new_shape = array<i64: 24, 1, 1>} : (tensor<24x1xf32>) -> tensor<24x1x1xf32>
    %323 = tosa.reshape %320 {new_shape = array<i64: 1, 24, 1, 1>} : (tensor<24x1x1xf32>) -> tensor<1x24x1x1xf32>
    %324 = tosa.sub %310, %323 : (tensor<1x24x28x28xf32>, tensor<1x24x1x1xf32>) -> tensor<1x24x28x28xf32>
    %325 = tosa.reshape %322 {new_shape = array<i64: 1, 24, 1, 1>} : (tensor<24x1x1xf32>) -> tensor<1x24x1x1xf32>
    %326 = tosa.mul %324, %325 {shift = 0 : i8} : (tensor<1x24x28x28xf32>, tensor<1x24x1x1xf32>) -> tensor<1x24x28x28xf32>
    %327 = tosa.reshape %arg48 {new_shape = array<i64: 24, 1>} : (tensor<24xf32>) -> tensor<24x1xf32>
    %328 = tosa.reshape %327 {new_shape = array<i64: 24, 1, 1>} : (tensor<24x1xf32>) -> tensor<24x1x1xf32>
    %329 = tosa.reshape %328 {new_shape = array<i64: 1, 24, 1, 1>} : (tensor<24x1x1xf32>) -> tensor<1x24x1x1xf32>
    %330 = tosa.mul %326, %329 {shift = 0 : i8} : (tensor<1x24x28x28xf32>, tensor<1x24x1x1xf32>) -> tensor<1x24x28x28xf32>
    %331 = tosa.reshape %arg49 {new_shape = array<i64: 24, 1>} : (tensor<24xf32>) -> tensor<24x1xf32>
    %332 = tosa.reshape %331 {new_shape = array<i64: 24, 1, 1>} : (tensor<24x1xf32>) -> tensor<24x1x1xf32>
    %333 = tosa.reshape %332 {new_shape = array<i64: 1, 24, 1, 1>} : (tensor<24x1x1xf32>) -> tensor<1x24x1x1xf32>
    %334 = tosa.add %330, %333 : (tensor<1x24x28x28xf32>, tensor<1x24x1x1xf32>) -> tensor<1x24x28x28xf32>
    %335 = tosa.add %334, %234 : (tensor<1x24x28x28xf32>, tensor<1x24x28x28xf32>) -> tensor<1x24x28x28xf32>
    %336 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<96xf32>}> : () -> tensor<96xf32>
    %337 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %338 = tosa.transpose %335, %337 : (tensor<1x24x28x28xf32>, tensor<4xi32>) -> tensor<1x28x28x24xf32>
    %339 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %340 = tosa.transpose %arg50, %339 : (tensor<96x24x1x1xf32>, tensor<4xi32>) -> tensor<96x1x1x24xf32>
    %341 = tosa.conv2d %338, %340, %336 {dilation = array<i64: 1, 1>, pad = array<i64: 0, 0, 0, 0>, stride = array<i64: 1, 1>} : (tensor<1x28x28x24xf32>, tensor<96x1x1x24xf32>, tensor<96xf32>) -> tensor<1x28x28x96xf32>
    %342 = "tosa.const"() <{value = dense<[0, 3, 1, 2]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %343 = tosa.transpose %341, %342 : (tensor<1x28x28x96xf32>, tensor<4xi32>) -> tensor<1x96x28x28xf32>
    %344 = tosa.cast %arg51 : (tensor<96xf32>) -> tensor<96xf32>
    %345 = tosa.cast %arg52 : (tensor<96xf32>) -> tensor<96xf32>
    %346 = "tosa.const"() <{value = dense<1.000000e-03> : tensor<96xf32>}> : () -> tensor<96xf32>
    %347 = tosa.add %345, %346 : (tensor<96xf32>, tensor<96xf32>) -> tensor<96xf32>
    %348 = math.sqrt %347 : tensor<96xf32>
    %349 = tosa.reciprocal %348 : (tensor<96xf32>) -> tensor<96xf32>
    %350 = "tosa.const"() <{value = dense<1.000000e+00> : tensor<96xf32>}> : () -> tensor<96xf32>
    %351 = tosa.mul %349, %350 {shift = 0 : i8} : (tensor<96xf32>, tensor<96xf32>) -> tensor<96xf32>
    %352 = tosa.reshape %344 {new_shape = array<i64: 96, 1>} : (tensor<96xf32>) -> tensor<96x1xf32>
    %353 = tosa.reshape %352 {new_shape = array<i64: 96, 1, 1>} : (tensor<96x1xf32>) -> tensor<96x1x1xf32>
    %354 = tosa.reshape %351 {new_shape = array<i64: 96, 1>} : (tensor<96xf32>) -> tensor<96x1xf32>
    %355 = tosa.reshape %354 {new_shape = array<i64: 96, 1, 1>} : (tensor<96x1xf32>) -> tensor<96x1x1xf32>
    %356 = tosa.reshape %353 {new_shape = array<i64: 1, 96, 1, 1>} : (tensor<96x1x1xf32>) -> tensor<1x96x1x1xf32>
    %357 = tosa.sub %343, %356 : (tensor<1x96x28x28xf32>, tensor<1x96x1x1xf32>) -> tensor<1x96x28x28xf32>
    %358 = tosa.reshape %355 {new_shape = array<i64: 1, 96, 1, 1>} : (tensor<96x1x1xf32>) -> tensor<1x96x1x1xf32>
    %359 = tosa.mul %357, %358 {shift = 0 : i8} : (tensor<1x96x28x28xf32>, tensor<1x96x1x1xf32>) -> tensor<1x96x28x28xf32>
    %360 = tosa.reshape %arg53 {new_shape = array<i64: 96, 1>} : (tensor<96xf32>) -> tensor<96x1xf32>
    %361 = tosa.reshape %360 {new_shape = array<i64: 96, 1, 1>} : (tensor<96x1xf32>) -> tensor<96x1x1xf32>
    %362 = tosa.reshape %361 {new_shape = array<i64: 1, 96, 1, 1>} : (tensor<96x1x1xf32>) -> tensor<1x96x1x1xf32>
    %363 = tosa.mul %359, %362 {shift = 0 : i8} : (tensor<1x96x28x28xf32>, tensor<1x96x1x1xf32>) -> tensor<1x96x28x28xf32>
    %364 = tosa.reshape %arg54 {new_shape = array<i64: 96, 1>} : (tensor<96xf32>) -> tensor<96x1xf32>
    %365 = tosa.reshape %364 {new_shape = array<i64: 96, 1, 1>} : (tensor<96x1xf32>) -> tensor<96x1x1xf32>
    %366 = tosa.reshape %365 {new_shape = array<i64: 1, 96, 1, 1>} : (tensor<96x1x1xf32>) -> tensor<1x96x1x1xf32>
    %367 = tosa.add %363, %366 : (tensor<1x96x28x28xf32>, tensor<1x96x1x1xf32>) -> tensor<1x96x28x28xf32>
    %368 = "tosa.const"() <{value = dense<3.000000e+00> : tensor<1x96x28x28xf32>}> : () -> tensor<1x96x28x28xf32>
    %369 = tosa.add %367, %368 : (tensor<1x96x28x28xf32>, tensor<1x96x28x28xf32>) -> tensor<1x96x28x28xf32>
    %370 = tosa.clamp %369 {max_fp = 0x7F800000 : f32, max_int = 9223372036854775807 : i64, min_fp = 0.000000e+00 : f32, min_int = 0 : i64} : (tensor<1x96x28x28xf32>) -> tensor<1x96x28x28xf32>
    %371 = tosa.clamp %370 {max_fp = 6.000000e+00 : f32, max_int = 6 : i64, min_fp = 0xFF800000 : f32, min_int = -9223372036854775807 : i64} : (tensor<1x96x28x28xf32>) -> tensor<1x96x28x28xf32>
    %372 = tosa.mul %367, %371 {shift = 0 : i8} : (tensor<1x96x28x28xf32>, tensor<1x96x28x28xf32>) -> tensor<1x96x28x28xf32>
    %373 = "tosa.const"() <{value = dense<6.000000e+00> : tensor<1x96x28x28xf32>}> : () -> tensor<1x96x28x28xf32>
    %374 = tosa.reciprocal %373 : (tensor<1x96x28x28xf32>) -> tensor<1x96x28x28xf32>
    %375 = tosa.mul %372, %374 {shift = 0 : i8} : (tensor<1x96x28x28xf32>, tensor<1x96x28x28xf32>) -> tensor<1x96x28x28xf32>
    %376 = "tosa.const"() <{value = dense<0.000000e+00> : tensor<96xf32>}> : () -> tensor<96xf32>
    %377 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %378 = tosa.transpose %375, %377 : (tensor<1x96x28x28xf32>, tensor<4xi32>) -> tensor<1x28x28x96xf32>
    %379 = "tosa.const"() <{value = dense<[2, 3, 0, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %380 = tosa.transpose %arg55, %379 : (tensor<96x1x5x5xf32>, tensor<4xi32>) -> tensor<5x5x96x1xf32>
    %381 = tosa.depthwise_conv2d %378, %380, %376 {dilation = array<i64: 1, 1>, pad = array<i64: 2, 2, 2, 2>, stride = array<i64: 2, 2>} : (tensor<1x28x28x96xf32>, tensor<5x5x96x1xf32>, tensor<96xf32>) -> tensor<1x14x14x96xf32>
    %382 = "tosa.const"() <{value = dense<[0, 3, 1, 2]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %383 = tosa.transpose %381, %382 : (tensor<1x14x14x96xf32>, tensor<4xi32>) -> tensor<1x96x14x14xf32>
    %384 = tosa.cast %arg56 : (tensor<96xf32>) -> tensor<96xf32>
    %385 = tosa.cast %arg57 : (tensor<96xf32>) -> tensor<96xf32>
    %386 = "tosa.const"() <{value = dense<1.000000e-03> : tensor<96xf32>}> : () -> tensor<96xf32>
    %387 = tosa.add %385, %386 : (tensor<96xf32>, tensor<96xf32>) -> tensor<96xf32>
    %388 = math.sqrt %387 : tensor<96xf32>
    %389 = tosa.reciprocal %388 : (tensor<96xf32>) -> tensor<96xf32>
    %390 = "tosa.const"() <{value = dense<1.000000e+00> : tensor<96xf32>}> : () -> tensor<96xf32>
    %391 = tosa.mul %389, %390 {shift = 0 : i8} : (tensor<96xf32>, tensor<96xf32>) -> tensor<96xf32>
    %392 = tosa.reshape %384 {new_shape = array<i64: 96, 1>} : (tensor<96xf32>) -> tensor<96x1xf32>
    %393 = tosa.reshape %392 {new_shape = array<i64: 96, 1, 1>} : (tensor<96x1xf32>) -> tensor<96x1x1xf32>
    %394 = tosa.reshape %391 {new_shape = array<i64: 96, 1>} : (tensor<96xf32>) -> tensor<96x1xf32>
    %395 = tosa.reshape %394 {new_shape = array<i64: 96, 1, 1>} : (tensor<96x1xf32>) -> tensor<96x1x1xf32>
    %396 = tosa.reshape %393 {new_shape = array<i64: 1, 96, 1, 1>} : (tensor<96x1x1xf32>) -> tensor<1x96x1x1xf32>
    %397 = tosa.sub %383, %396 : (tensor<1x96x14x14xf32>, tensor<1x96x1x1xf32>) -> tensor<1x96x14x14xf32>
    %398 = tosa.reshape %395 {new_shape = array<i64: 1, 96, 1, 1>} : (tensor<96x1x1xf32>) -> tensor<1x96x1x1xf32>
    %399 = tosa.mul %397, %398 {shift = 0 : i8} : (tensor<1x96x14x14xf32>, tensor<1x96x1x1xf32>) -> tensor<1x96x14x14xf32>
    %400 = tosa.reshape %arg58 {new_shape = array<i64: 96, 1>} : (tensor<96xf32>) -> tensor<96x1xf32>
    %401 = tosa.reshape %400 {new_shape = array<i64: 96, 1, 1>} : (tensor<96x1xf32>) -> tensor<96x1x1xf32>
    %402 = tosa.reshape %401 {new_shape = array<i64: 1, 96, 1, 1>} : (tensor<96x1x1xf32>) -> tensor<1x96x1x1xf32>
    %403 = tosa.mul %399, %402 {shift = 0 : i8} : (tensor<1x96x14x14xf32>, tensor<1x96x1x1xf32>) -> tensor<1x96x14x14xf32>
    %404 = tosa.reshape %arg59 {new_shape = array<i64: 96, 1>} : (tensor<96xf32>) -> tensor<96x1xf32>
    %405 = tosa.reshape %404 {new_shape = array<i64: 96, 1, 1>} : (tensor<96x1xf32>) -> tensor<96x1x1xf32>
    %406 = tosa.reshape %405 {new_shape = array<i64: 1, 96, 1, 1>} : (tensor<96x1x1xf32>) -> tensor<1x96x1x1xf32>
    %407 = tosa.add %403, %406 : (tensor<1x96x14x14xf32>, tensor<1x96x1x1xf32>) -> tensor<1x96x14x14xf32>
    %408 = "tosa.const"() <{value = dense<3.000000e+00> : tensor<1x96x14x14xf32>}> : () -> tensor<1x96x14x14xf32>
    %409 = tosa.add %407, %408 : (tensor<1x96x14x14xf32>, tensor<1x96x14x14xf32>) -> tensor<1x96x14x14xf32>
    %410 = tosa.clamp %409 {max_fp = 0x7F800000 : f32, max_int = 9223372036854775807 : i64, min_fp = 0.000000e+00 : f32, min_int = 0 : i64} : (tensor<1x96x14x14xf32>) -> tensor<1x96x14x14xf32>
    %411 = tosa.clamp %410 {max_fp = 6.000000e+00 : f32, max_int = 6 : i64, min_fp = 0xFF800000 : f32, min_int = -9223372036854775807 : i64} : (tensor<1x96x14x14xf32>) -> tensor<1x96x14x14xf32>
    %412 = tosa.mul %407, %411 {shift = 0 : i8} : (tensor<1x96x14x14xf32>, tensor<1x96x14x14xf32>) -> tensor<1x96x14x14xf32>
    %413 = "tosa.const"() <{value = dense<6.000000e+00> : tensor<1x96x14x14xf32>}> : () -> tensor<1x96x14x14xf32>
    %414 = tosa.reciprocal %413 : (tensor<1x96x14x14xf32>) -> tensor<1x96x14x14xf32>
    %415 = tosa.mul %412, %414 {shift = 0 : i8} : (tensor<1x96x14x14xf32>, tensor<1x96x14x14xf32>) -> tensor<1x96x14x14xf32>
    %416 = tosa.reduce_sum %415 {axis = 3 : i32} : (tensor<1x96x14x14xf32>) -> tensor<1x96x14x1xf32>
    %417 = tosa.reduce_sum %416 {axis = 2 : i32} : (tensor<1x96x14x1xf32>) -> tensor<1x96x1x1xf32>
    %418 = "tosa.const"() <{value = dense<1.960000e+02> : tensor<1xf32>}> : () -> tensor<1xf32>
    %419 = tosa.reciprocal %418 : (tensor<1xf32>) -> tensor<1xf32>
    %420 = tosa.mul %419, %417 {shift = 0 : i8} : (tensor<1xf32>, tensor<1x96x1x1xf32>) -> tensor<1x96x1x1xf32>
