#map = affine_map<(d0, d1, d2) -> (d0, d2)>
#map1 = affine_map<(d0, d1, d2) -> (d2, d1)>
#map2 = affine_map<(d0, d1, d2) -> (d0, d1)>
#map3 = affine_map<(d0, d1, d2, d3) -> (d0, d1)>
#map4 = affine_map<(d0, d1, d2, d3) -> (d0, d1, d2, d3)>
"builtin.module"() ({
  "func.func"() <{function_type = (tensor<1x4x64x64xf32>, tensor<4x4x1x1xf32>, tensor<4xf32>, tensor<512x4x3x3xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512x512x3x3xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512x512x3x3xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512x512xf32>, tensor<512xf32>, tensor<512x512xf32>, tensor<512xf32>, tensor<512x512xf32>, tensor<512xf32>, tensor<512x512xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512x512x3x3xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512x512x3x3xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512x512x3x3xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512x512x3x3xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512x512x3x3xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512x512x3x3xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512x512x3x3xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512x512x3x3xf32>, tensor<512xf32>, tensor<512x512x3x3xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512x512x3x3xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512x512x3x3xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512x512x3x3xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512x512x3x3xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512x512x3x3xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512x512x3x3xf32>, tensor<512xf32>, tensor<512x512x3x3xf32>, tensor<512xf32>, tensor<512xf32>, tensor<512xf32>, tensor<256x512x3x3xf32>, tensor<256xf32>, tensor<256xf32>, tensor<256xf32>, tensor<256x256x3x3xf32>, tensor<256xf32>, tensor<256x512x1x1xf32>, tensor<256xf32>, tensor<256xf32>, tensor<256xf32>, tensor<256x256x3x3xf32>, tensor<256xf32>, tensor<256xf32>, tensor<256xf32>, tensor<256x256x3x3xf32>, tensor<256xf32>, tensor<256xf32>, tensor<256xf32>, tensor<256x256x3x3xf32>, tensor<256xf32>, tensor<256xf32>, tensor<256xf32>, tensor<256x256x3x3xf32>, tensor<256xf32>, tensor<256x256x3x3xf32>, tensor<256xf32>, tensor<256xf32>, tensor<256xf32>, tensor<128x256x3x3xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>, tensor<128x256x1x1xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>, tensor<128xf32>, tensor<128xf32>, tensor<3x128x3x3xf32>, tensor<3xf32>) -> tensor<1x3x512x512xf32>, sym_name = "subgraph0"}> ({
  ^bb0(%arg0: tensor<1x4x64x64xf32>, %arg1: tensor<4x4x1x1xf32>, %arg2: tensor<4xf32>, %arg3: tensor<512x4x3x3xf32>, %arg4: tensor<512xf32>, %arg5: tensor<512xf32>, %arg6: tensor<512xf32>, %arg7: tensor<512x512x3x3xf32>, %arg8: tensor<512xf32>, %arg9: tensor<512xf32>, %arg10: tensor<512xf32>, %arg11: tensor<512x512x3x3xf32>, %arg12: tensor<512xf32>, %arg13: tensor<512xf32>, %arg14: tensor<512xf32>, %arg15: tensor<512x512xf32>, %arg16: tensor<512xf32>, %arg17: tensor<512x512xf32>, %arg18: tensor<512xf32>, %arg19: tensor<512x512xf32>, %arg20: tensor<512xf32>, %arg21: tensor<512x512xf32>, %arg22: tensor<512xf32>, %arg23: tensor<512xf32>, %arg24: tensor<512xf32>, %arg25: tensor<512x512x3x3xf32>, %arg26: tensor<512xf32>, %arg27: tensor<512xf32>, %arg28: tensor<512xf32>, %arg29: tensor<512x512x3x3xf32>, %arg30: tensor<512xf32>, %arg31: tensor<512xf32>, %arg32: tensor<512xf32>, %arg33: tensor<512x512x3x3xf32>, %arg34: tensor<512xf32>, %arg35: tensor<512xf32>, %arg36: tensor<512xf32>, %arg37: tensor<512x512x3x3xf32>, %arg38: tensor<512xf32>, %arg39: tensor<512xf32>, %arg40: tensor<512xf32>, %arg41: tensor<512x512x3x3xf32>, %arg42: tensor<512xf32>, %arg43: tensor<512xf32>, %arg44: tensor<512xf32>, %arg45: tensor<512x512x3x3xf32>, %arg46: tensor<512xf32>, %arg47: tensor<512xf32>, %arg48: tensor<512xf32>, %arg49: tensor<512x512x3x3xf32>, %arg50: tensor<512xf32>, %arg51: tensor<512xf32>, %arg52: tensor<512xf32>, %arg53: tensor<512x512x3x3xf32>, %arg54: tensor<512xf32>, %arg55: tensor<512x512x3x3xf32>, %arg56: tensor<512xf32>, %arg57: tensor<512xf32>, %arg58: tensor<512xf32>, %arg59: tensor<512x512x3x3xf32>, %arg60: tensor<512xf32>, %arg61: tensor<512xf32>, %arg62: tensor<512xf32>, %arg63: tensor<512x512x3x3xf32>, %arg64: tensor<512xf32>, %arg65: tensor<512xf32>, %arg66: tensor<512xf32>, %arg67: tensor<512x512x3x3xf32>, %arg68: tensor<512xf32>, %arg69: tensor<512xf32>, %arg70: tensor<512xf32>, %arg71: tensor<512x512x3x3xf32>, %arg72: tensor<512xf32>, %arg73: tensor<512xf32>, %arg74: tensor<512xf32>, %arg75: tensor<512x512x3x3xf32>, %arg76: tensor<512xf32>, %arg77: tensor<512xf32>, %arg78: tensor<512xf32>, %arg79: tensor<512x512x3x3xf32>, %arg80: tensor<512xf32>, %arg81: tensor<512x512x3x3xf32>, %arg82: tensor<512xf32>, %arg83: tensor<512xf32>, %arg84: tensor<512xf32>, %arg85: tensor<256x512x3x3xf32>, %arg86: tensor<256xf32>, %arg87: tensor<256xf32>, %arg88: tensor<256xf32>, %arg89: tensor<256x256x3x3xf32>, %arg90: tensor<256xf32>, %arg91: tensor<256x512x1x1xf32>, %arg92: tensor<256xf32>, %arg93: tensor<256xf32>, %arg94: tensor<256xf32>, %arg95: tensor<256x256x3x3xf32>, %arg96: tensor<256xf32>, %arg97: tensor<256xf32>, %arg98: tensor<256xf32>, %arg99: tensor<256x256x3x3xf32>, %arg100: tensor<256xf32>, %arg101: tensor<256xf32>, %arg102: tensor<256xf32>, %arg103: tensor<256x256x3x3xf32>, %arg104: tensor<256xf32>, %arg105: tensor<256xf32>, %arg106: tensor<256xf32>, %arg107: tensor<256x256x3x3xf32>, %arg108: tensor<256xf32>, %arg109: tensor<256x256x3x3xf32>, %arg110: tensor<256xf32>, %arg111: tensor<256xf32>, %arg112: tensor<256xf32>, %arg113: tensor<128x256x3x3xf32>, %arg114: tensor<128xf32>, %arg115: tensor<128xf32>, %arg116: tensor<128xf32>, %arg117: tensor<128x128x3x3xf32>, %arg118: tensor<128xf32>, %arg119: tensor<128x256x1x1xf32>, %arg120: tensor<128xf32>, %arg121: tensor<128xf32>, %arg122: tensor<128xf32>, %arg123: tensor<128x128x3x3xf32>, %arg124: tensor<128xf32>, %arg125: tensor<128xf32>, %arg126: tensor<128xf32>, %arg127: tensor<128x128x3x3xf32>, %arg128: tensor<128xf32>, %arg129: tensor<128xf32>, %arg130: tensor<128xf32>, %arg131: tensor<128x128x3x3xf32>, %arg132: tensor<128xf32>, %arg133: tensor<128xf32>, %arg134: tensor<128xf32>, %arg135: tensor<128x128x3x3xf32>, %arg136: tensor<128xf32>, %arg137: tensor<128xf32>, %arg138: tensor<128xf32>, %arg139: tensor<3x128x3x3xf32>, %arg140: tensor<3xf32>):
    %0 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %1 = "tosa.transpose"(%arg0, %0) : (tensor<1x4x64x64xf32>, tensor<4xi32>) -> tensor<1x64x64x4xf32>
    %2 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %3 = "tosa.transpose"(%arg1, %2) : (tensor<4x4x1x1xf32>, tensor<4xi32>) -> tensor<4x1x1x4xf32>
    %4 = "tosa.conv2d"(%1, %3, %arg2) <{dilation = array<i64: 1, 1>, pad = array<i64: 0, 0, 0, 0>, stride = array<i64: 1, 1>}> : (tensor<1x64x64x4xf32>, tensor<4x1x1x4xf32>, tensor<4xf32>) -> tensor<1x64x64x4xf32>
    %5 = "tosa.const"() <{value = dense<[0, 3, 1, 2]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %6 = "tosa.transpose"(%4, %5) : (tensor<1x64x64x4xf32>, tensor<4xi32>) -> tensor<1x4x64x64xf32>
    %7 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %8 = "tosa.transpose"(%6, %7) : (tensor<1x4x64x64xf32>, tensor<4xi32>) -> tensor<1x64x64x4xf32>
    %9 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %10 = "tosa.transpose"(%arg3, %9) : (tensor<512x4x3x3xf32>, tensor<4xi32>) -> tensor<512x3x3x4xf32>
    %11 = "tosa.conv2d"(%8, %10, %arg4) <{dilation = array<i64: 1, 1>, pad = array<i64: 1, 1, 1, 1>, stride = array<i64: 1, 1>}> : (tensor<1x64x64x4xf32>, tensor<512x3x3x4xf32>, tensor<512xf32>) -> tensor<1x64x64x512xf32>
    %12 = "tosa.const"() <{value = dense<[0, 3, 1, 2]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %13 = "tosa.transpose"(%11, %12) : (tensor<1x64x64x512xf32>, tensor<4xi32>) -> tensor<1x512x64x64xf32>
    %14 = "tosa.reshape"(%13) <{new_shape = array<i64: 1, 32, 16, 4096>}> : (tensor<1x512x64x64xf32>) -> tensor<1x32x16x4096xf32>
    %15 = "tosa.reduce_sum"(%14) <{axis = 2 : i32}> : (tensor<1x32x16x4096xf32>) -> tensor<1x32x1x4096xf32>
    %16 = "tosa.reduce_sum"(%15) <{axis = 3 : i32}> : (tensor<1x32x1x4096xf32>) -> tensor<1x32x1x1xf32>
    %17 = "tosa.const"() <{value = dense<6.553600e+04> : tensor<1xf32>}> : () -> tensor<1xf32>
    %18 = "tosa.reciprocal"(%17) : (tensor<1xf32>) -> tensor<1xf32>
    %19 = "tosa.mul"(%18, %16) <{shift = 0 : i8}> : (tensor<1xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x1x1xf32>
    %20 = "tosa.sub"(%14, %19) : (tensor<1x32x16x4096xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x16x4096xf32>
    %21 = "tosa.mul"(%20, %20) <{shift = 0 : i8}> : (tensor<1x32x16x4096xf32>, tensor<1x32x16x4096xf32>) -> tensor<1x32x16x4096xf32>
    %22 = "tosa.reduce_sum"(%21) <{axis = 2 : i32}> : (tensor<1x32x16x4096xf32>) -> tensor<1x32x1x4096xf32>
    %23 = "tosa.reduce_sum"(%22) <{axis = 3 : i32}> : (tensor<1x32x1x4096xf32>) -> tensor<1x32x1x1xf32>
    %24 = "tosa.const"() <{value = dense<6.553600e+04> : tensor<1xf32>}> : () -> tensor<1xf32>
    %25 = "tosa.reciprocal"(%24) : (tensor<1xf32>) -> tensor<1xf32>
    %26 = "tosa.mul"(%25, %23) <{shift = 0 : i8}> : (tensor<1xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x1x1xf32>
    %27 = "tosa.const"() <{value = dense<9.99999997E-7> : tensor<1x32x1x1xf32>}> : () -> tensor<1x32x1x1xf32>
    %28 = "tosa.add"(%26, %27) : (tensor<1x32x1x1xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x1x1xf32>
    %29 = "tosa.rsqrt"(%28) : (tensor<1x32x1x1xf32>) -> tensor<1x32x1x1xf32>
    %30 = "tosa.sub"(%14, %19) : (tensor<1x32x16x4096xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x16x4096xf32>
    %31 = "tosa.mul"(%30, %29) <{shift = 0 : i8}> : (tensor<1x32x16x4096xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x16x4096xf32>
    %32 = "tosa.reshape"(%31) <{new_shape = array<i64: 1, 512, 64, 64>}> : (tensor<1x32x16x4096xf32>) -> tensor<1x512x64x64xf32>
    %33 = "tosa.reshape"(%arg5) <{new_shape = array<i64: 1, 512>}> : (tensor<512xf32>) -> tensor<1x512xf32>
    %34 = "tosa.reshape"(%33) <{new_shape = array<i64: 1, 512, 1>}> : (tensor<1x512xf32>) -> tensor<1x512x1xf32>
    %35 = "tosa.reshape"(%34) <{new_shape = array<i64: 1, 512, 1, 1>}> : (tensor<1x512x1xf32>) -> tensor<1x512x1x1xf32>
    %36 = "tosa.reshape"(%arg6) <{new_shape = array<i64: 1, 512>}> : (tensor<512xf32>) -> tensor<1x512xf32>
    %37 = "tosa.reshape"(%36) <{new_shape = array<i64: 1, 512, 1>}> : (tensor<1x512xf32>) -> tensor<1x512x1xf32>
    %38 = "tosa.reshape"(%37) <{new_shape = array<i64: 1, 512, 1, 1>}> : (tensor<1x512x1xf32>) -> tensor<1x512x1x1xf32>
    %39 = "tosa.mul"(%32, %38) <{shift = 0 : i8}> : (tensor<1x512x64x64xf32>, tensor<1x512x1x1xf32>) -> tensor<1x512x64x64xf32>
    %40 = "tosa.add"(%39, %35) : (tensor<1x512x64x64xf32>, tensor<1x512x1x1xf32>) -> tensor<1x512x64x64xf32>
    %41 = "tosa.sigmoid"(%40) : (tensor<1x512x64x64xf32>) -> tensor<1x512x64x64xf32>
    %42 = "tosa.mul"(%40, %41) <{shift = 0 : i8}> : (tensor<1x512x64x64xf32>, tensor<1x512x64x64xf32>) -> tensor<1x512x64x64xf32>
    %43 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %44 = "tosa.transpose"(%42, %43) : (tensor<1x512x64x64xf32>, tensor<4xi32>) -> tensor<1x64x64x512xf32>
    %45 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %46 = "tosa.transpose"(%arg7, %45) : (tensor<512x512x3x3xf32>, tensor<4xi32>) -> tensor<512x3x3x512xf32>
    %47 = "tosa.conv2d"(%44, %46, %arg8) <{dilation = array<i64: 1, 1>, pad = array<i64: 1, 1, 1, 1>, stride = array<i64: 1, 1>}> : (tensor<1x64x64x512xf32>, tensor<512x3x3x512xf32>, tensor<512xf32>) -> tensor<1x64x64x512xf32>
    %48 = "tosa.const"() <{value = dense<[0, 3, 1, 2]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %49 = "tosa.transpose"(%47, %48) : (tensor<1x64x64x512xf32>, tensor<4xi32>) -> tensor<1x512x64x64xf32>
    %50 = "tosa.reshape"(%49) <{new_shape = array<i64: 1, 32, 16, 4096>}> : (tensor<1x512x64x64xf32>) -> tensor<1x32x16x4096xf32>
    %51 = "tosa.reduce_sum"(%50) <{axis = 2 : i32}> : (tensor<1x32x16x4096xf32>) -> tensor<1x32x1x4096xf32>
    %52 = "tosa.reduce_sum"(%51) <{axis = 3 : i32}> : (tensor<1x32x1x4096xf32>) -> tensor<1x32x1x1xf32>
    %53 = "tosa.const"() <{value = dense<6.553600e+04> : tensor<1xf32>}> : () -> tensor<1xf32>
    %54 = "tosa.reciprocal"(%53) : (tensor<1xf32>) -> tensor<1xf32>
    %55 = "tosa.mul"(%54, %52) <{shift = 0 : i8}> : (tensor<1xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x1x1xf32>
    %56 = "tosa.sub"(%50, %55) : (tensor<1x32x16x4096xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x16x4096xf32>
    %57 = "tosa.mul"(%56, %56) <{shift = 0 : i8}> : (tensor<1x32x16x4096xf32>, tensor<1x32x16x4096xf32>) -> tensor<1x32x16x4096xf32>
    %58 = "tosa.reduce_sum"(%57) <{axis = 2 : i32}> : (tensor<1x32x16x4096xf32>) -> tensor<1x32x1x4096xf32>
    %59 = "tosa.reduce_sum"(%58) <{axis = 3 : i32}> : (tensor<1x32x1x4096xf32>) -> tensor<1x32x1x1xf32>
    %60 = "tosa.const"() <{value = dense<6.553600e+04> : tensor<1xf32>}> : () -> tensor<1xf32>
    %61 = "tosa.reciprocal"(%60) : (tensor<1xf32>) -> tensor<1xf32>
    %62 = "tosa.mul"(%61, %59) <{shift = 0 : i8}> : (tensor<1xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x1x1xf32>
    %63 = "tosa.const"() <{value = dense<9.99999997E-7> : tensor<1x32x1x1xf32>}> : () -> tensor<1x32x1x1xf32>
    %64 = "tosa.add"(%62, %63) : (tensor<1x32x1x1xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x1x1xf32>
    %65 = "tosa.rsqrt"(%64) : (tensor<1x32x1x1xf32>) -> tensor<1x32x1x1xf32>
    %66 = "tosa.sub"(%50, %55) : (tensor<1x32x16x4096xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x16x4096xf32>
    %67 = "tosa.mul"(%66, %65) <{shift = 0 : i8}> : (tensor<1x32x16x4096xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x16x4096xf32>
    %68 = "tosa.reshape"(%67) <{new_shape = array<i64: 1, 512, 64, 64>}> : (tensor<1x32x16x4096xf32>) -> tensor<1x512x64x64xf32>
    %69 = "tosa.reshape"(%arg9) <{new_shape = array<i64: 1, 512>}> : (tensor<512xf32>) -> tensor<1x512xf32>
    %70 = "tosa.reshape"(%69) <{new_shape = array<i64: 1, 512, 1>}> : (tensor<1x512xf32>) -> tensor<1x512x1xf32>
    %71 = "tosa.reshape"(%70) <{new_shape = array<i64: 1, 512, 1, 1>}> : (tensor<1x512x1xf32>) -> tensor<1x512x1x1xf32>
    %72 = "tosa.reshape"(%arg10) <{new_shape = array<i64: 1, 512>}> : (tensor<512xf32>) -> tensor<1x512xf32>
    %73 = "tosa.reshape"(%72) <{new_shape = array<i64: 1, 512, 1>}> : (tensor<1x512xf32>) -> tensor<1x512x1xf32>
    %74 = "tosa.reshape"(%73) <{new_shape = array<i64: 1, 512, 1, 1>}> : (tensor<1x512x1xf32>) -> tensor<1x512x1x1xf32>
    %75 = "tosa.mul"(%68, %74) <{shift = 0 : i8}> : (tensor<1x512x64x64xf32>, tensor<1x512x1x1xf32>) -> tensor<1x512x64x64xf32>
    %76 = "tosa.add"(%75, %71) : (tensor<1x512x64x64xf32>, tensor<1x512x1x1xf32>) -> tensor<1x512x64x64xf32>
    %77 = "tosa.sigmoid"(%76) : (tensor<1x512x64x64xf32>) -> tensor<1x512x64x64xf32>
    %78 = "tosa.mul"(%76, %77) <{shift = 0 : i8}> : (tensor<1x512x64x64xf32>, tensor<1x512x64x64xf32>) -> tensor<1x512x64x64xf32>
    %79 = "tosa.identity"(%78) : (tensor<1x512x64x64xf32>) -> tensor<1x512x64x64xf32>
    %80 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %81 = "tosa.transpose"(%79, %80) : (tensor<1x512x64x64xf32>, tensor<4xi32>) -> tensor<1x64x64x512xf32>
    %82 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %83 = "tosa.transpose"(%arg11, %82) : (tensor<512x512x3x3xf32>, tensor<4xi32>) -> tensor<512x3x3x512xf32>
    %84 = "tosa.conv2d"(%81, %83, %arg12) <{dilation = array<i64: 1, 1>, pad = array<i64: 1, 1, 1, 1>, stride = array<i64: 1, 1>}> : (tensor<1x64x64x512xf32>, tensor<512x3x3x512xf32>, tensor<512xf32>) -> tensor<1x64x64x512xf32>
    %85 = "tosa.const"() <{value = dense<[0, 3, 1, 2]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %86 = "tosa.transpose"(%84, %85) : (tensor<1x64x64x512xf32>, tensor<4xi32>) -> tensor<1x512x64x64xf32>
    %87 = "tosa.add"(%13, %86) : (tensor<1x512x64x64xf32>, tensor<1x512x64x64xf32>) -> tensor<1x512x64x64xf32>
    %88 = "tosa.const"() <{value = dense<1.000000e+00> : tensor<1x512x64x64xf32>}> : () -> tensor<1x512x64x64xf32>
    %89 = "tosa.reciprocal"(%88) : (tensor<1x512x64x64xf32>) -> tensor<1x512x64x64xf32>
    %90 = "tosa.mul"(%87, %89) <{shift = 0 : i8}> : (tensor<1x512x64x64xf32>, tensor<1x512x64x64xf32>) -> tensor<1x512x64x64xf32>
    %91 = "tosa.reshape"(%90) <{new_shape = array<i64: 1, 512, 4096>}> : (tensor<1x512x64x64xf32>) -> tensor<1x512x4096xf32>
    %92 = "tosa.const"() <{value = dense<[0, 2, 1]> : tensor<3xi32>}> : () -> tensor<3xi32>
    %93 = "tosa.transpose"(%91, %92) : (tensor<1x512x4096xf32>, tensor<3xi32>) -> tensor<1x4096x512xf32>
    %94 = "tosa.const"() <{value = dense<[0, 2, 1]> : tensor<3xi32>}> : () -> tensor<3xi32>
    %95 = "tosa.transpose"(%93, %94) : (tensor<1x4096x512xf32>, tensor<3xi32>) -> tensor<1x512x4096xf32>
    %96 = "tosa.reshape"(%95) <{new_shape = array<i64: 1, 32, 16, 4096>}> : (tensor<1x512x4096xf32>) -> tensor<1x32x16x4096xf32>
    %97 = "tosa.reduce_sum"(%96) <{axis = 2 : i32}> : (tensor<1x32x16x4096xf32>) -> tensor<1x32x1x4096xf32>
    %98 = "tosa.reduce_sum"(%97) <{axis = 3 : i32}> : (tensor<1x32x1x4096xf32>) -> tensor<1x32x1x1xf32>
    %99 = "tosa.const"() <{value = dense<6.553600e+04> : tensor<1xf32>}> : () -> tensor<1xf32>
    %100 = "tosa.reciprocal"(%99) : (tensor<1xf32>) -> tensor<1xf32>
    %101 = "tosa.mul"(%100, %98) <{shift = 0 : i8}> : (tensor<1xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x1x1xf32>
    %102 = "tosa.sub"(%96, %101) : (tensor<1x32x16x4096xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x16x4096xf32>
    %103 = "tosa.mul"(%102, %102) <{shift = 0 : i8}> : (tensor<1x32x16x4096xf32>, tensor<1x32x16x4096xf32>) -> tensor<1x32x16x4096xf32>
    %104 = "tosa.reduce_sum"(%103) <{axis = 2 : i32}> : (tensor<1x32x16x4096xf32>) -> tensor<1x32x1x4096xf32>
    %105 = "tosa.reduce_sum"(%104) <{axis = 3 : i32}> : (tensor<1x32x1x4096xf32>) -> tensor<1x32x1x1xf32>
    %106 = "tosa.const"() <{value = dense<6.553600e+04> : tensor<1xf32>}> : () -> tensor<1xf32>
    %107 = "tosa.reciprocal"(%106) : (tensor<1xf32>) -> tensor<1xf32>
    %108 = "tosa.mul"(%107, %105) <{shift = 0 : i8}> : (tensor<1xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x1x1xf32>
    %109 = "tosa.const"() <{value = dense<9.99999997E-7> : tensor<1x32x1x1xf32>}> : () -> tensor<1x32x1x1xf32>
    %110 = "tosa.add"(%108, %109) : (tensor<1x32x1x1xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x1x1xf32>
    %111 = "tosa.rsqrt"(%110) : (tensor<1x32x1x1xf32>) -> tensor<1x32x1x1xf32>
    %112 = "tosa.sub"(%96, %101) : (tensor<1x32x16x4096xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x16x4096xf32>
    %113 = "tosa.mul"(%112, %111) <{shift = 0 : i8}> : (tensor<1x32x16x4096xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x16x4096xf32>
    %114 = "tosa.reshape"(%113) <{new_shape = array<i64: 1, 512, 4096>}> : (tensor<1x32x16x4096xf32>) -> tensor<1x512x4096xf32>
    %115 = "tosa.reshape"(%arg13) <{new_shape = array<i64: 1, 512>}> : (tensor<512xf32>) -> tensor<1x512xf32>
    %116 = "tosa.reshape"(%115) <{new_shape = array<i64: 1, 512, 1>}> : (tensor<1x512xf32>) -> tensor<1x512x1xf32>
    %117 = "tosa.reshape"(%arg14) <{new_shape = array<i64: 1, 512>}> : (tensor<512xf32>) -> tensor<1x512xf32>
    %118 = "tosa.reshape"(%117) <{new_shape = array<i64: 1, 512, 1>}> : (tensor<1x512xf32>) -> tensor<1x512x1xf32>
    %119 = "tosa.mul"(%114, %118) <{shift = 0 : i8}> : (tensor<1x512x4096xf32>, tensor<1x512x1xf32>) -> tensor<1x512x4096xf32>
    %120 = "tosa.add"(%119, %116) : (tensor<1x512x4096xf32>, tensor<1x512x1xf32>) -> tensor<1x512x4096xf32>
    %121 = "tosa.const"() <{value = dense<[0, 2, 1]> : tensor<3xi32>}> : () -> tensor<3xi32>
    %122 = "tosa.transpose"(%120, %121) : (tensor<1x512x4096xf32>, tensor<3xi32>) -> tensor<1x4096x512xf32>
    %123 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %124 = "tosa.transpose"(%arg15, %123) : (tensor<512x512xf32>, tensor<2xi32>) -> tensor<512x512xf32>
    %125 = "tosa.reshape"(%122) <{new_shape = array<i64: 4096, 512>}> : (tensor<1x4096x512xf32>) -> tensor<4096x512xf32>
    %126 = "arith.constant"() <{value = dense<0.000000e+00> : tensor<4096x512xf32>}> : () -> tensor<4096x512xf32>
    %127 = "linalg.matmul"(%125, %124, %126) <{cast = #linalg.type_fn<cast_signed>, operandSegmentSizes = array<i32: 2, 1>}> ({
    ^bb0(%arg141: f32, %arg142: f32, %arg143: f32):
      %1346 = "arith.mulf"(%arg141, %arg142) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
      %1347 = "arith.addf"(%arg143, %1346) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
      "linalg.yield"(%1347) : (f32) -> ()
    }) {linalg.memoized_indexing_maps = [#map, #map1, #map2]} : (tensor<4096x512xf32>, tensor<512x512xf32>, tensor<4096x512xf32>) -> tensor<4096x512xf32>
    %128 = "tosa.reshape"(%127) <{new_shape = array<i64: 1, 4096, 512>}> : (tensor<4096x512xf32>) -> tensor<1x4096x512xf32>
    %129 = "tosa.reshape"(%arg16) <{new_shape = array<i64: 1, 1, 512>}> : (tensor<512xf32>) -> tensor<1x1x512xf32>
    %130 = "tosa.add"(%128, %129) : (tensor<1x4096x512xf32>, tensor<1x1x512xf32>) -> tensor<1x4096x512xf32>
    %131 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %132 = "tosa.transpose"(%arg17, %131) : (tensor<512x512xf32>, tensor<2xi32>) -> tensor<512x512xf32>
    %133 = "tosa.reshape"(%122) <{new_shape = array<i64: 4096, 512>}> : (tensor<1x4096x512xf32>) -> tensor<4096x512xf32>
    %134 = "arith.constant"() <{value = dense<0.000000e+00> : tensor<4096x512xf32>}> : () -> tensor<4096x512xf32>
    %135 = "linalg.matmul"(%133, %132, %134) <{cast = #linalg.type_fn<cast_signed>, operandSegmentSizes = array<i32: 2, 1>}> ({
    ^bb0(%arg141: f32, %arg142: f32, %arg143: f32):
      %1346 = "arith.mulf"(%arg141, %arg142) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
      %1347 = "arith.addf"(%arg143, %1346) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
      "linalg.yield"(%1347) : (f32) -> ()
    }) {linalg.memoized_indexing_maps = [#map, #map1, #map2]} : (tensor<4096x512xf32>, tensor<512x512xf32>, tensor<4096x512xf32>) -> tensor<4096x512xf32>
    %136 = "tosa.reshape"(%135) <{new_shape = array<i64: 1, 4096, 512>}> : (tensor<4096x512xf32>) -> tensor<1x4096x512xf32>
    %137 = "tosa.reshape"(%arg18) <{new_shape = array<i64: 1, 1, 512>}> : (tensor<512xf32>) -> tensor<1x1x512xf32>
    %138 = "tosa.add"(%136, %137) : (tensor<1x4096x512xf32>, tensor<1x1x512xf32>) -> tensor<1x4096x512xf32>
    %139 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %140 = "tosa.transpose"(%arg19, %139) : (tensor<512x512xf32>, tensor<2xi32>) -> tensor<512x512xf32>
    %141 = "tosa.reshape"(%122) <{new_shape = array<i64: 4096, 512>}> : (tensor<1x4096x512xf32>) -> tensor<4096x512xf32>
    %142 = "arith.constant"() <{value = dense<0.000000e+00> : tensor<4096x512xf32>}> : () -> tensor<4096x512xf32>
    %143 = "linalg.matmul"(%141, %140, %142) <{cast = #linalg.type_fn<cast_signed>, operandSegmentSizes = array<i32: 2, 1>}> ({
    ^bb0(%arg141: f32, %arg142: f32, %arg143: f32):
      %1346 = "arith.mulf"(%arg141, %arg142) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
      %1347 = "arith.addf"(%arg143, %1346) <{fastmath = #arith.fastmath<none>}> : (f32, f32) -> f32
      "linalg.yield"(%1347) : (f32) -> ()
    }) {linalg.memoized_indexing_maps = [#map, #map1, #map2]} : (tensor<4096x512xf32>, tensor<512x512xf32>, tensor<4096x512xf32>) -> tensor<4096x512xf32>
    %144 = "tosa.reshape"(%143) <{new_shape = array<i64: 1, 4096, 512>}> : (tensor<4096x512xf32>) -> tensor<1x4096x512xf32>
    %145 = "tosa.reshape"(%arg20) <{new_shape = array<i64: 1, 1, 512>}> : (tensor<512xf32>) -> tensor<1x1x512xf32>
    %146 = "tosa.add"(%144, %145) : (tensor<1x4096x512xf32>, tensor<1x1x512xf32>) -> tensor<1x4096x512xf32>
    %147 = "tosa.reshape"(%130) <{new_shape = array<i64: 1, 4096, 1, 512>}> : (tensor<1x4096x512xf32>) -> tensor<1x4096x1x512xf32>
    %148 = "tosa.const"() <{value = dense<[0, 2, 1, 3]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %149 = "tosa.transpose"(%147, %148) : (tensor<1x4096x1x512xf32>, tensor<4xi32>) -> tensor<1x1x4096x512xf32>
    %150 = "tosa.reshape"(%138) <{new_shape = array<i64: 1, 4096, 1, 512>}> : (tensor<1x4096x512xf32>) -> tensor<1x4096x1x512xf32>
    %151 = "tosa.const"() <{value = dense<[0, 2, 1, 3]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %152 = "tosa.transpose"(%150, %151) : (tensor<1x4096x1x512xf32>, tensor<4xi32>) -> tensor<1x1x4096x512xf32>
    %153 = "tosa.reshape"(%146) <{new_shape = array<i64: 1, 4096, 1, 512>}> : (tensor<1x4096x512xf32>) -> tensor<1x4096x1x512xf32>
    %154 = "tosa.const"() <{value = dense<[0, 2, 1, 3]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %155 = "tosa.transpose"(%153, %154) : (tensor<1x4096x1x512xf32>, tensor<4xi32>) -> tensor<1x1x4096x512xf32>
    %156 = "arith.constant"() <{value = dense<0.000000e+00> : tensor<4096x4096xf32>}> : () -> tensor<4096x4096xf32>
    %157 = "tosa.const"() <{value = dense<[0, 1, 3, 2]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %158 = "tosa.transpose"(%152, %157) : (tensor<1x1x4096x512xf32>, tensor<4xi32>) -> tensor<1x1x512x4096xf32>
    %159 = "tosa.reshape"(%149) <{new_shape = array<i64: 1, 4096, 512>}> : (tensor<1x1x4096x512xf32>) -> tensor<1x4096x512xf32>
    %160 = "tosa.reshape"(%158) <{new_shape = array<i64: 1, 512, 4096>}> : (tensor<1x1x512x4096xf32>) -> tensor<1x512x4096xf32>
    %161 = "tosa.matmul"(%159, %160) : (tensor<1x4096x512xf32>, tensor<1x512x4096xf32>) -> tensor<1x4096x4096xf32>
    %162 = "arith.constant"() <{value = dense<0.0441941731> : tensor<1x4096x4096xf32>}> : () -> tensor<1x4096x4096xf32>
    %163 = "tosa.mul"(%161, %162) <{shift = 0 : i8}> : (tensor<1x4096x4096xf32>, tensor<1x4096x4096xf32>) -> tensor<1x4096x4096xf32>
    %164 = "tosa.add"(%163, %156) : (tensor<1x4096x4096xf32>, tensor<4096x4096xf32>) -> tensor<1x4096x4096xf32>
    %165 = "arith.constant"() <{value = dense<0.000000e+00> : tensor<1x4096x4096xf32>}> : () -> tensor<1x4096x4096xf32>
    %166 = "linalg.softmax"(%164, %165) <{dimension = 3 : i64}> : (tensor<1x4096x4096xf32>, tensor<1x4096x4096xf32>) -> tensor<1x4096x4096xf32>
    %167 = "tosa.reshape"(%155) <{new_shape = array<i64: 1, 4096, 512>}> : (tensor<1x1x4096x512xf32>) -> tensor<1x4096x512xf32>
    %168 = "tosa.matmul"(%166, %167) : (tensor<1x4096x4096xf32>, tensor<1x4096x512xf32>) -> tensor<1x4096x512xf32>
    %169 = "tosa.reshape"(%168) <{new_shape = array<i64: 1, 1, 4096, 512>}> : (tensor<1x4096x512xf32>) -> tensor<1x1x4096x512xf32>
    %170 = "tosa.const"() <{value = dense<> : tensor<0xi32>}> : () -> tensor<0xi32>
    %171 = "tosa.const"() <{value = dense<> : tensor<0xi32>}> : () -> tensor<0xi32>
    %172 = "tosa.const"() <{value = dense<> : tensor<0xi32>}> : () -> tensor<0xi32>
    %173 = "tosa.const"() <{value = dense<[0, 2, 1, 3]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %174 = "tosa.transpose"(%169, %173) : (tensor<1x1x4096x512xf32>, tensor<4xi32>) -> tensor<1x4096x1x512xf32>
    %175 = "tosa.reshape"(%174) <{new_shape = array<i64: 1, 4096, 512>}> : (tensor<1x4096x1x512xf32>) -> tensor<1x4096x512xf32>
    %176 = "tosa.reshape"(%175) <{new_shape = array<i64: 4096, 512>}> : (tensor<1x4096x512xf32>) -> tensor<4096x512xf32>
    %177 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>
    %178 = "tosa.transpose"(%arg21, %177) : (tensor<512x512xf32>, tensor<2xi32>) -> tensor<512x512xf32>
    %179 = "tosa.reshape"(%176) <{new_shape = array<i64: 1, 4096, 512>}> : (tensor<4096x512xf32>) -> tensor<1x4096x512xf32>
    %180 = "tosa.reshape"(%178) <{new_shape = array<i64: 1, 512, 512>}> : (tensor<512x512xf32>) -> tensor<1x512x512xf32>
    %181 = "tosa.matmul"(%179, %180) : (tensor<1x4096x512xf32>, tensor<1x512x512xf32>) -> tensor<1x4096x512xf32>
    %182 = "tosa.reshape"(%181) <{new_shape = array<i64: 4096, 512>}> : (tensor<1x4096x512xf32>) -> tensor<4096x512xf32>
    %183 = "tosa.reshape"(%arg22) <{new_shape = array<i64: 1, 512>}> : (tensor<512xf32>) -> tensor<1x512xf32>
    %184 = "tosa.add"(%183, %182) : (tensor<1x512xf32>, tensor<4096x512xf32>) -> tensor<4096x512xf32>
    %185 = "tosa.reshape"(%184) <{new_shape = array<i64: 1, 4096, 512>}> : (tensor<4096x512xf32>) -> tensor<1x4096x512xf32>
    %186 = "tosa.identity"(%185) : (tensor<1x4096x512xf32>) -> tensor<1x4096x512xf32>
    %187 = "tosa.const"() <{value = dense<[0, 2, 1]> : tensor<3xi32>}> : () -> tensor<3xi32>
    %188 = "tosa.transpose"(%186, %187) : (tensor<1x4096x512xf32>, tensor<3xi32>) -> tensor<1x512x4096xf32>
    %189 = "tosa.reshape"(%188) <{new_shape = array<i64: 1, 512, 64, 64>}> : (tensor<1x512x4096xf32>) -> tensor<1x512x64x64xf32>
    %190 = "tosa.add"(%189, %90) : (tensor<1x512x64x64xf32>, tensor<1x512x64x64xf32>) -> tensor<1x512x64x64xf32>
    %191 = "tosa.const"() <{value = dense<1.000000e+00> : tensor<1x512x64x64xf32>}> : () -> tensor<1x512x64x64xf32>
    %192 = "tosa.reciprocal"(%191) : (tensor<1x512x64x64xf32>) -> tensor<1x512x64x64xf32>
    %193 = "tosa.mul"(%190, %192) <{shift = 0 : i8}> : (tensor<1x512x64x64xf32>, tensor<1x512x64x64xf32>) -> tensor<1x512x64x64xf32>
    %194 = "tosa.identity"(%193) : (tensor<1x512x64x64xf32>) -> tensor<1x512x64x64xf32>
    %195 = "tosa.reshape"(%194) <{new_shape = array<i64: 1, 32, 16, 4096>}> : (tensor<1x512x64x64xf32>) -> tensor<1x32x16x4096xf32>
    %196 = "tosa.reduce_sum"(%195) <{axis = 2 : i32}> : (tensor<1x32x16x4096xf32>) -> tensor<1x32x1x4096xf32>
    %197 = "tosa.reduce_sum"(%196) <{axis = 3 : i32}> : (tensor<1x32x1x4096xf32>) -> tensor<1x32x1x1xf32>
    %198 = "tosa.const"() <{value = dense<6.553600e+04> : tensor<1xf32>}> : () -> tensor<1xf32>
    %199 = "tosa.reciprocal"(%198) : (tensor<1xf32>) -> tensor<1xf32>
    %200 = "tosa.mul"(%199, %197) <{shift = 0 : i8}> : (tensor<1xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x1x1xf32>
    %201 = "tosa.sub"(%195, %200) : (tensor<1x32x16x4096xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x16x4096xf32>
    %202 = "tosa.mul"(%201, %201) <{shift = 0 : i8}> : (tensor<1x32x16x4096xf32>, tensor<1x32x16x4096xf32>) -> tensor<1x32x16x4096xf32>
    %203 = "tosa.reduce_sum"(%202) <{axis = 2 : i32}> : (tensor<1x32x16x4096xf32>) -> tensor<1x32x1x4096xf32>
    %204 = "tosa.reduce_sum"(%203) <{axis = 3 : i32}> : (tensor<1x32x1x4096xf32>) -> tensor<1x32x1x1xf32>
    %205 = "tosa.const"() <{value = dense<6.553600e+04> : tensor<1xf32>}> : () -> tensor<1xf32>
    %206 = "tosa.reciprocal"(%205) : (tensor<1xf32>) -> tensor<1xf32>
    %207 = "tosa.mul"(%206, %204) <{shift = 0 : i8}> : (tensor<1xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x1x1xf32>
    %208 = "tosa.const"() <{value = dense<9.99999997E-7> : tensor<1x32x1x1xf32>}> : () -> tensor<1x32x1x1xf32>
    %209 = "tosa.add"(%207, %208) : (tensor<1x32x1x1xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x1x1xf32>
    %210 = "tosa.rsqrt"(%209) : (tensor<1x32x1x1xf32>) -> tensor<1x32x1x1xf32>
    %211 = "tosa.sub"(%195, %200) : (tensor<1x32x16x4096xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x16x4096xf32>
    %212 = "tosa.mul"(%211, %210) <{shift = 0 : i8}> : (tensor<1x32x16x4096xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x16x4096xf32>
    %213 = "tosa.reshape"(%212) <{new_shape = array<i64: 1, 512, 64, 64>}> : (tensor<1x32x16x4096xf32>) -> tensor<1x512x64x64xf32>
    %214 = "tosa.reshape"(%arg23) <{new_shape = array<i64: 1, 512>}> : (tensor<512xf32>) -> tensor<1x512xf32>
    %215 = "tosa.reshape"(%214) <{new_shape = array<i64: 1, 512, 1>}> : (tensor<1x512xf32>) -> tensor<1x512x1xf32>
    %216 = "tosa.reshape"(%215) <{new_shape = array<i64: 1, 512, 1, 1>}> : (tensor<1x512x1xf32>) -> tensor<1x512x1x1xf32>
    %217 = "tosa.reshape"(%arg24) <{new_shape = array<i64: 1, 512>}> : (tensor<512xf32>) -> tensor<1x512xf32>
    %218 = "tosa.reshape"(%217) <{new_shape = array<i64: 1, 512, 1>}> : (tensor<1x512xf32>) -> tensor<1x512x1xf32>
    %219 = "tosa.reshape"(%218) <{new_shape = array<i64: 1, 512, 1, 1>}> : (tensor<1x512x1xf32>) -> tensor<1x512x1x1xf32>
    %220 = "tosa.mul"(%213, %219) <{shift = 0 : i8}> : (tensor<1x512x64x64xf32>, tensor<1x512x1x1xf32>) -> tensor<1x512x64x64xf32>
    %221 = "tosa.add"(%220, %216) : (tensor<1x512x64x64xf32>, tensor<1x512x1x1xf32>) -> tensor<1x512x64x64xf32>
    %222 = "tosa.sigmoid"(%221) : (tensor<1x512x64x64xf32>) -> tensor<1x512x64x64xf32>
    %223 = "tosa.mul"(%221, %222) <{shift = 0 : i8}> : (tensor<1x512x64x64xf32>, tensor<1x512x64x64xf32>) -> tensor<1x512x64x64xf32>
    %224 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %225 = "tosa.transpose"(%223, %224) : (tensor<1x512x64x64xf32>, tensor<4xi32>) -> tensor<1x64x64x512xf32>
    %226 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %227 = "tosa.transpose"(%arg25, %226) : (tensor<512x512x3x3xf32>, tensor<4xi32>) -> tensor<512x3x3x512xf32>
    %228 = "tosa.conv2d"(%225, %227, %arg26) <{dilation = array<i64: 1, 1>, pad = array<i64: 1, 1, 1, 1>, stride = array<i64: 1, 1>}> : (tensor<1x64x64x512xf32>, tensor<512x3x3x512xf32>, tensor<512xf32>) -> tensor<1x64x64x512xf32>
    %229 = "tosa.const"() <{value = dense<[0, 3, 1, 2]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %230 = "tosa.transpose"(%228, %229) : (tensor<1x64x64x512xf32>, tensor<4xi32>) -> tensor<1x512x64x64xf32>
    %231 = "tosa.reshape"(%230) <{new_shape = array<i64: 1, 32, 16, 4096>}> : (tensor<1x512x64x64xf32>) -> tensor<1x32x16x4096xf32>
    %232 = "tosa.reduce_sum"(%231) <{axis = 2 : i32}> : (tensor<1x32x16x4096xf32>) -> tensor<1x32x1x4096xf32>
    %233 = "tosa.reduce_sum"(%232) <{axis = 3 : i32}> : (tensor<1x32x1x4096xf32>) -> tensor<1x32x1x1xf32>
    %234 = "tosa.const"() <{value = dense<6.553600e+04> : tensor<1xf32>}> : () -> tensor<1xf32>
    %235 = "tosa.reciprocal"(%234) : (tensor<1xf32>) -> tensor<1xf32>
    %236 = "tosa.mul"(%235, %233) <{shift = 0 : i8}> : (tensor<1xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x1x1xf32>
    %237 = "tosa.sub"(%231, %236) : (tensor<1x32x16x4096xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x16x4096xf32>
    %238 = "tosa.mul"(%237, %237) <{shift = 0 : i8}> : (tensor<1x32x16x4096xf32>, tensor<1x32x16x4096xf32>) -> tensor<1x32x16x4096xf32>
    %239 = "tosa.reduce_sum"(%238) <{axis = 2 : i32}> : (tensor<1x32x16x4096xf32>) -> tensor<1x32x1x4096xf32>
    %240 = "tosa.reduce_sum"(%239) <{axis = 3 : i32}> : (tensor<1x32x1x4096xf32>) -> tensor<1x32x1x1xf32>
    %241 = "tosa.const"() <{value = dense<6.553600e+04> : tensor<1xf32>}> : () -> tensor<1xf32>
    %242 = "tosa.reciprocal"(%241) : (tensor<1xf32>) -> tensor<1xf32>
    %243 = "tosa.mul"(%242, %240) <{shift = 0 : i8}> : (tensor<1xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x1x1xf32>
    %244 = "tosa.const"() <{value = dense<9.99999997E-7> : tensor<1x32x1x1xf32>}> : () -> tensor<1x32x1x1xf32>
    %245 = "tosa.add"(%243, %244) : (tensor<1x32x1x1xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x1x1xf32>
    %246 = "tosa.rsqrt"(%245) : (tensor<1x32x1x1xf32>) -> tensor<1x32x1x1xf32>
    %247 = "tosa.sub"(%231, %236) : (tensor<1x32x16x4096xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x16x4096xf32>
    %248 = "tosa.mul"(%247, %246) <{shift = 0 : i8}> : (tensor<1x32x16x4096xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x16x4096xf32>
    %249 = "tosa.reshape"(%248) <{new_shape = array<i64: 1, 512, 64, 64>}> : (tensor<1x32x16x4096xf32>) -> tensor<1x512x64x64xf32>
    %250 = "tosa.reshape"(%arg27) <{new_shape = array<i64: 1, 512>}> : (tensor<512xf32>) -> tensor<1x512xf32>
    %251 = "tosa.reshape"(%250) <{new_shape = array<i64: 1, 512, 1>}> : (tensor<1x512xf32>) -> tensor<1x512x1xf32>
    %252 = "tosa.reshape"(%251) <{new_shape = array<i64: 1, 512, 1, 1>}> : (tensor<1x512x1xf32>) -> tensor<1x512x1x1xf32>
    %253 = "tosa.reshape"(%arg28) <{new_shape = array<i64: 1, 512>}> : (tensor<512xf32>) -> tensor<1x512xf32>
    %254 = "tosa.reshape"(%253) <{new_shape = array<i64: 1, 512, 1>}> : (tensor<1x512xf32>) -> tensor<1x512x1xf32>
    %255 = "tosa.reshape"(%254) <{new_shape = array<i64: 1, 512, 1, 1>}> : (tensor<1x512x1xf32>) -> tensor<1x512x1x1xf32>
    %256 = "tosa.mul"(%249, %255) <{shift = 0 : i8}> : (tensor<1x512x64x64xf32>, tensor<1x512x1x1xf32>) -> tensor<1x512x64x64xf32>
    %257 = "tosa.add"(%256, %252) : (tensor<1x512x64x64xf32>, tensor<1x512x1x1xf32>) -> tensor<1x512x64x64xf32>
    %258 = "tosa.sigmoid"(%257) : (tensor<1x512x64x64xf32>) -> tensor<1x512x64x64xf32>
    %259 = "tosa.mul"(%257, %258) <{shift = 0 : i8}> : (tensor<1x512x64x64xf32>, tensor<1x512x64x64xf32>) -> tensor<1x512x64x64xf32>
    %260 = "tosa.identity"(%259) : (tensor<1x512x64x64xf32>) -> tensor<1x512x64x64xf32>
    %261 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %262 = "tosa.transpose"(%260, %261) : (tensor<1x512x64x64xf32>, tensor<4xi32>) -> tensor<1x64x64x512xf32>
    %263 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %264 = "tosa.transpose"(%arg29, %263) : (tensor<512x512x3x3xf32>, tensor<4xi32>) -> tensor<512x3x3x512xf32>
    %265 = "tosa.conv2d"(%262, %264, %arg30) <{dilation = array<i64: 1, 1>, pad = array<i64: 1, 1, 1, 1>, stride = array<i64: 1, 1>}> : (tensor<1x64x64x512xf32>, tensor<512x3x3x512xf32>, tensor<512xf32>) -> tensor<1x64x64x512xf32>
    %266 = "tosa.const"() <{value = dense<[0, 3, 1, 2]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %267 = "tosa.transpose"(%265, %266) : (tensor<1x64x64x512xf32>, tensor<4xi32>) -> tensor<1x512x64x64xf32>
    %268 = "tosa.add"(%193, %267) : (tensor<1x512x64x64xf32>, tensor<1x512x64x64xf32>) -> tensor<1x512x64x64xf32>
    %269 = "tosa.const"() <{value = dense<1.000000e+00> : tensor<1x512x64x64xf32>}> : () -> tensor<1x512x64x64xf32>
    %270 = "tosa.reciprocal"(%269) : (tensor<1x512x64x64xf32>) -> tensor<1x512x64x64xf32>
    %271 = "tosa.mul"(%268, %270) <{shift = 0 : i8}> : (tensor<1x512x64x64xf32>, tensor<1x512x64x64xf32>) -> tensor<1x512x64x64xf32>
    %272 = "tosa.identity"(%271) : (tensor<1x512x64x64xf32>) -> tensor<1x512x64x64xf32>
    %273 = "tosa.reshape"(%272) <{new_shape = array<i64: 1, 32, 16, 4096>}> : (tensor<1x512x64x64xf32>) -> tensor<1x32x16x4096xf32>
    %274 = "tosa.reduce_sum"(%273) <{axis = 2 : i32}> : (tensor<1x32x16x4096xf32>) -> tensor<1x32x1x4096xf32>
    %275 = "tosa.reduce_sum"(%274) <{axis = 3 : i32}> : (tensor<1x32x1x4096xf32>) -> tensor<1x32x1x1xf32>
    %276 = "tosa.const"() <{value = dense<6.553600e+04> : tensor<1xf32>}> : () -> tensor<1xf32>
    %277 = "tosa.reciprocal"(%276) : (tensor<1xf32>) -> tensor<1xf32>
    %278 = "tosa.mul"(%277, %275) <{shift = 0 : i8}> : (tensor<1xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x1x1xf32>
    %279 = "tosa.sub"(%273, %278) : (tensor<1x32x16x4096xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x16x4096xf32>
    %280 = "tosa.mul"(%279, %279) <{shift = 0 : i8}> : (tensor<1x32x16x4096xf32>, tensor<1x32x16x4096xf32>) -> tensor<1x32x16x4096xf32>
    %281 = "tosa.reduce_sum"(%280) <{axis = 2 : i32}> : (tensor<1x32x16x4096xf32>) -> tensor<1x32x1x4096xf32>
    %282 = "tosa.reduce_sum"(%281) <{axis = 3 : i32}> : (tensor<1x32x1x4096xf32>) -> tensor<1x32x1x1xf32>
    %283 = "tosa.const"() <{value = dense<6.553600e+04> : tensor<1xf32>}> : () -> tensor<1xf32>
    %284 = "tosa.reciprocal"(%283) : (tensor<1xf32>) -> tensor<1xf32>
    %285 = "tosa.mul"(%284, %282) <{shift = 0 : i8}> : (tensor<1xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x1x1xf32>
    %286 = "tosa.const"() <{value = dense<9.99999997E-7> : tensor<1x32x1x1xf32>}> : () -> tensor<1x32x1x1xf32>
    %287 = "tosa.add"(%285, %286) : (tensor<1x32x1x1xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x1x1xf32>
    %288 = "tosa.rsqrt"(%287) : (tensor<1x32x1x1xf32>) -> tensor<1x32x1x1xf32>
    %289 = "tosa.sub"(%273, %278) : (tensor<1x32x16x4096xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x16x4096xf32>
    %290 = "tosa.mul"(%289, %288) <{shift = 0 : i8}> : (tensor<1x32x16x4096xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x16x4096xf32>
    %291 = "tosa.reshape"(%290) <{new_shape = array<i64: 1, 512, 64, 64>}> : (tensor<1x32x16x4096xf32>) -> tensor<1x512x64x64xf32>
    %292 = "tosa.reshape"(%arg31) <{new_shape = array<i64: 1, 512>}> : (tensor<512xf32>) -> tensor<1x512xf32>
    %293 = "tosa.reshape"(%292) <{new_shape = array<i64: 1, 512, 1>}> : (tensor<1x512xf32>) -> tensor<1x512x1xf32>
    %294 = "tosa.reshape"(%293) <{new_shape = array<i64: 1, 512, 1, 1>}> : (tensor<1x512x1xf32>) -> tensor<1x512x1x1xf32>
    %295 = "tosa.reshape"(%arg32) <{new_shape = array<i64: 1, 512>}> : (tensor<512xf32>) -> tensor<1x512xf32>
    %296 = "tosa.reshape"(%295) <{new_shape = array<i64: 1, 512, 1>}> : (tensor<1x512xf32>) -> tensor<1x512x1xf32>
    %297 = "tosa.reshape"(%296) <{new_shape = array<i64: 1, 512, 1, 1>}> : (tensor<1x512x1xf32>) -> tensor<1x512x1x1xf32>
    %298 = "tosa.mul"(%291, %297) <{shift = 0 : i8}> : (tensor<1x512x64x64xf32>, tensor<1x512x1x1xf32>) -> tensor<1x512x64x64xf32>
    %299 = "tosa.add"(%298, %294) : (tensor<1x512x64x64xf32>, tensor<1x512x1x1xf32>) -> tensor<1x512x64x64xf32>
    %300 = "tosa.sigmoid"(%299) : (tensor<1x512x64x64xf32>) -> tensor<1x512x64x64xf32>
    %301 = "tosa.mul"(%299, %300) <{shift = 0 : i8}> : (tensor<1x512x64x64xf32>, tensor<1x512x64x64xf32>) -> tensor<1x512x64x64xf32>
    %302 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %303 = "tosa.transpose"(%301, %302) : (tensor<1x512x64x64xf32>, tensor<4xi32>) -> tensor<1x64x64x512xf32>
    %304 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %305 = "tosa.transpose"(%arg33, %304) : (tensor<512x512x3x3xf32>, tensor<4xi32>) -> tensor<512x3x3x512xf32>
    %306 = "tosa.conv2d"(%303, %305, %arg34) <{dilation = array<i64: 1, 1>, pad = array<i64: 1, 1, 1, 1>, stride = array<i64: 1, 1>}> : (tensor<1x64x64x512xf32>, tensor<512x3x3x512xf32>, tensor<512xf32>) -> tensor<1x64x64x512xf32>
    %307 = "tosa.const"() <{value = dense<[0, 3, 1, 2]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %308 = "tosa.transpose"(%306, %307) : (tensor<1x64x64x512xf32>, tensor<4xi32>) -> tensor<1x512x64x64xf32>
    %309 = "tosa.reshape"(%308) <{new_shape = array<i64: 1, 32, 16, 4096>}> : (tensor<1x512x64x64xf32>) -> tensor<1x32x16x4096xf32>
    %310 = "tosa.reduce_sum"(%309) <{axis = 2 : i32}> : (tensor<1x32x16x4096xf32>) -> tensor<1x32x1x4096xf32>
    %311 = "tosa.reduce_sum"(%310) <{axis = 3 : i32}> : (tensor<1x32x1x4096xf32>) -> tensor<1x32x1x1xf32>
    %312 = "tosa.const"() <{value = dense<6.553600e+04> : tensor<1xf32>}> : () -> tensor<1xf32>
    %313 = "tosa.reciprocal"(%312) : (tensor<1xf32>) -> tensor<1xf32>
    %314 = "tosa.mul"(%313, %311) <{shift = 0 : i8}> : (tensor<1xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x1x1xf32>
    %315 = "tosa.sub"(%309, %314) : (tensor<1x32x16x4096xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x16x4096xf32>
    %316 = "tosa.mul"(%315, %315) <{shift = 0 : i8}> : (tensor<1x32x16x4096xf32>, tensor<1x32x16x4096xf32>) -> tensor<1x32x16x4096xf32>
    %317 = "tosa.reduce_sum"(%316) <{axis = 2 : i32}> : (tensor<1x32x16x4096xf32>) -> tensor<1x32x1x4096xf32>
    %318 = "tosa.reduce_sum"(%317) <{axis = 3 : i32}> : (tensor<1x32x1x4096xf32>) -> tensor<1x32x1x1xf32>
    %319 = "tosa.const"() <{value = dense<6.553600e+04> : tensor<1xf32>}> : () -> tensor<1xf32>
    %320 = "tosa.reciprocal"(%319) : (tensor<1xf32>) -> tensor<1xf32>
    %321 = "tosa.mul"(%320, %318) <{shift = 0 : i8}> : (tensor<1xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x1x1xf32>
    %322 = "tosa.const"() <{value = dense<9.99999997E-7> : tensor<1x32x1x1xf32>}> : () -> tensor<1x32x1x1xf32>
    %323 = "tosa.add"(%321, %322) : (tensor<1x32x1x1xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x1x1xf32>
    %324 = "tosa.rsqrt"(%323) : (tensor<1x32x1x1xf32>) -> tensor<1x32x1x1xf32>
    %325 = "tosa.sub"(%309, %314) : (tensor<1x32x16x4096xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x16x4096xf32>
    %326 = "tosa.mul"(%325, %324) <{shift = 0 : i8}> : (tensor<1x32x16x4096xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x16x4096xf32>
    %327 = "tosa.reshape"(%326) <{new_shape = array<i64: 1, 512, 64, 64>}> : (tensor<1x32x16x4096xf32>) -> tensor<1x512x64x64xf32>
    %328 = "tosa.reshape"(%arg35) <{new_shape = array<i64: 1, 512>}> : (tensor<512xf32>) -> tensor<1x512xf32>
    %329 = "tosa.reshape"(%328) <{new_shape = array<i64: 1, 512, 1>}> : (tensor<1x512xf32>) -> tensor<1x512x1xf32>
    %330 = "tosa.reshape"(%329) <{new_shape = array<i64: 1, 512, 1, 1>}> : (tensor<1x512x1xf32>) -> tensor<1x512x1x1xf32>
    %331 = "tosa.reshape"(%arg36) <{new_shape = array<i64: 1, 512>}> : (tensor<512xf32>) -> tensor<1x512xf32>
    %332 = "tosa.reshape"(%331) <{new_shape = array<i64: 1, 512, 1>}> : (tensor<1x512xf32>) -> tensor<1x512x1xf32>
    %333 = "tosa.reshape"(%332) <{new_shape = array<i64: 1, 512, 1, 1>}> : (tensor<1x512x1xf32>) -> tensor<1x512x1x1xf32>
    %334 = "tosa.mul"(%327, %333) <{shift = 0 : i8}> : (tensor<1x512x64x64xf32>, tensor<1x512x1x1xf32>) -> tensor<1x512x64x64xf32>
    %335 = "tosa.add"(%334, %330) : (tensor<1x512x64x64xf32>, tensor<1x512x1x1xf32>) -> tensor<1x512x64x64xf32>
    %336 = "tosa.sigmoid"(%335) : (tensor<1x512x64x64xf32>) -> tensor<1x512x64x64xf32>
    %337 = "tosa.mul"(%335, %336) <{shift = 0 : i8}> : (tensor<1x512x64x64xf32>, tensor<1x512x64x64xf32>) -> tensor<1x512x64x64xf32>
    %338 = "tosa.identity"(%337) : (tensor<1x512x64x64xf32>) -> tensor<1x512x64x64xf32>
    %339 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %340 = "tosa.transpose"(%338, %339) : (tensor<1x512x64x64xf32>, tensor<4xi32>) -> tensor<1x64x64x512xf32>
    %341 = "tosa.const"() <{value = dense<[0, 2, 3, 1]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %342 = "tosa.transpose"(%arg37, %341) : (tensor<512x512x3x3xf32>, tensor<4xi32>) -> tensor<512x3x3x512xf32>
    %343 = "tosa.conv2d"(%340, %342, %arg38) <{dilation = array<i64: 1, 1>, pad = array<i64: 1, 1, 1, 1>, stride = array<i64: 1, 1>}> : (tensor<1x64x64x512xf32>, tensor<512x3x3x512xf32>, tensor<512xf32>) -> tensor<1x64x64x512xf32>
    %344 = "tosa.const"() <{value = dense<[0, 3, 1, 2]> : tensor<4xi32>}> : () -> tensor<4xi32>
    %345 = "tosa.transpose"(%343, %344) : (tensor<1x64x64x512xf32>, tensor<4xi32>) -> tensor<1x512x64x64xf32>
    %346 = "tosa.add"(%271, %345) : (tensor<1x512x64x64xf32>, tensor<1x512x64x64xf32>) -> tensor<1x512x64x64xf32>
    %347 = "tosa.const"() <{value = dense<1.000000e+00> : tensor<1x512x64x64xf32>}> : () -> tensor<1x512x64x64xf32>
    %348 = "tosa.reciprocal"(%347) : (tensor<1x512x64x64xf32>) -> tensor<1x512x64x64xf32>
    %349 = "tosa.mul"(%346, %348) <{shift = 0 : i8}> : (tensor<1x512x64x64xf32>, tensor<1x512x64x64xf32>) -> tensor<1x512x64x64xf32>
    %350 = "tosa.identity"(%349) : (tensor<1x512x64x64xf32>) -> tensor<1x512x64x64xf32>
    %351 = "tosa.reshape"(%350) <{new_shape = array<i64: 1, 32, 16, 4096>}> : (tensor<1x512x64x64xf32>) -> tensor<1x32x16x4096xf32>
    %352 = "tosa.reduce_sum"(%351) <{axis = 2 : i32}> : (tensor<1x32x16x4096xf32>) -> tensor<1x32x1x4096xf32>
    %353 = "tosa.reduce_sum"(%352) <{axis = 3 : i32}> : (tensor<1x32x1x4096xf32>) -> tensor<1x32x1x1xf32>
    %354 = "tosa.const"() <{value = dense<6.553600e+04> : tensor<1xf32>}> : () -> tensor<1xf32>
    %355 = "tosa.reciprocal"(%354) : (tensor<1xf32>) -> tensor<1xf32>
    %356 = "tosa.mul"(%355, %353) <{shift = 0 : i8}> : (tensor<1xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x1x1xf32>
    %357 = "tosa.sub"(%351, %356) : (tensor<1x32x16x4096xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x16x4096xf32>
    %358 = "tosa.mul"(%357, %357) <{shift = 0 : i8}> : (tensor<1x32x16x4096xf32>, tensor<1x32x16x4096xf32>) -> tensor<1x32x16x4096xf32>
    %359 = "tosa.reduce_sum"(%358) <{axis = 2 : i32}> : (tensor<1x32x16x4096xf32>) -> tensor<1x32x1x4096xf32>
    %360 = "tosa.reduce_sum"(%359) <{axis = 3 : i32}> : (tensor<1x32x1x4096xf32>) -> tensor<1x32x1x1xf32>
    %361 = "tosa.const"() <{value = dense<6.553600e+04> : tensor<1xf32>}> : () -> tensor<1xf32>
    %362 = "tosa.reciprocal"(%361) : (tensor<1xf32>) -> tensor<1xf32>
    %363 = "tosa.mul"(%362, %360) <{shift = 0 : i8}> : (tensor<1xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x1x1xf32>
    %364 = "tosa.const"() <{value = dense<9.99999997E-7> : tensor<1x32x1x1xf32>}> : () -> tensor<1x32x1x1xf32>
    %365 = "tosa.add"(%363, %364) : (tensor<1x32x1x1xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x1x1xf32>
    %366 = "tosa.rsqrt"(%365) : (tensor<1x32x1x1xf32>) -> tensor<1x32x1x1xf32>
    %367 = "tosa.sub"(%351, %356) : (tensor<1x32x16x4096xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x16x4096xf32>
    %368 = "tosa.mul"(%367, %366) <{shift = 0 : i8}> : (tensor<1x32x16x4096xf32>, tensor<1x32x1x1xf32>) -> tensor<1x32x16x4096xf32>
    %369 = "tosa.reshape"(%368) <{new_shape = array<i64: 1, 512, 64, 64>}> : (tensor<1x32x16x4096xf32>) -> tensor<1x512x64x64xf32>
    %370 = "tosa.reshape"(%arg39) <{new_shape = array<i64: 1, 512>}> : (tensor<512xf32>) -> tensor<1x512xf32>
    %371 = "tosa.reshape"(%370) <{new_shape = array<i64: 1, 512, 1>}> : (tensor<1x512xf32>) -> tensor<1x512x1xf32>
    %372 = "tosa.reshape"(%371) <{new_shape = array<i64: 1, 512, 1, 1>}> : (tensor<1x512x1xf32>) -> tensor<1x512x1x1xf32>
    %373 = "tosa.reshape"(%arg40) <{new_shape = array<i64: 1, 512>}> : (tensor<512xf32>) -> tensor<1x512xf32>
